{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-30T09:04:38.093Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "gv6zK265OUE",
      "title": "Build your first GraphRAG Powered Agent! (No Graph Expert Required) | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-30T06:40:49.000Z",
      "url": "https://www.youtube.com/watch?v=gv6zK265OUE",
      "thumbnail": "https://i.ytimg.com/vi/gv6zK265OUE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This session demonstrates how to build a GraphRAG-powered knowledge graph in an afternoon using the same AI tools teams already use, making it possible to unlock information trapped in docs, PDFs, and wikis. It includes a live demo with real documents and provides sample code so teams can get started without a six-month project or graph expertise.",
        "bullets": [
          "Knowledge in documents, PDFs, and wikis is often trapped and not usable by models; knowledge graphs can unlock it.",
          "Building a knowledge graph is presented as an achievable afternoon project, not a massive undertaking.",
          "The talk includes a live demo using real documents to show the process end-to-end.",
          "No graph expert required—uses familiar AI tools teams already have.",
          "Sample code notebook is provided to help attendees get started quickly."
        ],
        "takeaways": [
          "Prototype knowledge graphs quickly to surface operational knowledge from manuals, runbooks, and documentation.",
          "Shorter project timelines mean faster experimentation and earlier ROI on AI-enabled knowledge retrieval.",
          "Provided sample code and demo lower engineering barriers for teams without graph expertise.",
          "Improved access to documented institutional knowledge can support maintenance, training, and incident response workflows."
        ],
        "tags": [
          "GraphRAG",
          "knowledge-graph",
          "databases-for-AI",
          "AWS-Neptune",
          "AI-tools",
          "document-intelligence",
          "live-demo",
          "sample-code"
        ]
      }
    },
    {
      "id": "azzmtqcIeCU",
      "title": "Cloud Cost Efficiency I The Keys to AWS Optimization | S16 E2",
      "channel": "AWS Events",
      "published_at": "2026-01-30T05:12:30.000Z",
      "url": "https://www.youtube.com/watch?v=azzmtqcIeCU",
      "thumbnail": "https://i.ytimg.com/vi/azzmtqcIeCU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this livestream examines the key metrics that drive AWS cost efficiency—highlighting KPIs such as cost per transaction, resource utilization rates, and ROI calculations. It shows how to measure, track, benchmark, and optimize AWS spending and build dashboards that align technical performance with business outcomes for cloud engineers, FinOps teams, and technical leaders.",
        "bullets": [
          "Focus on essential KPIs: cost per transaction, utilization rates, and ROI.",
          "Practical frameworks for measuring and tracking AWS spend.",
          "Approaches to benchmarking cloud efficiency and spotting optimization opportunities.",
          "Guidance on building dashboards to communicate value to stakeholders.",
          "Target audience: cloud engineers, FinOps teams, and technical leaders."
        ],
        "takeaways": [
          "Measure cost per transaction and utilization to link technical changes to financial impact.",
          "Use ROI calculations and benchmarking to prioritize optimization efforts.",
          "Build clear dashboards so stakeholders can see the business value of cloud changes.",
          "Align metrics frameworks with business outcomes to guide cost-reduction decisions."
        ],
        "tags": [
          "AWS",
          "CloudCosts",
          "FinOps",
          "CostOptimization",
          "CloudMetrics",
          "AWSCostManagement",
          "CloudEfficiency",
          "ROI",
          "ResourceUtilization"
        ]
      }
    },
    {
      "id": "oQtkaHzUYlY",
      "title": "Copilot helps Christa find her inner star 🌟",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-29T18:33:49.000Z",
      "url": "https://www.youtube.com/watch?v=oQtkaHzUYlY",
      "thumbnail": "https://i.ytimg.com/vi/oQtkaHzUYlY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the short video frames a sky full of stars and shows Copilot helping Christa find the star within. It ends with a call-to-action inviting viewers to download and try Copilot via the link in the bio.",
        "bullets": [
          "Uses a sky/stars metaphor to convey personal discovery.",
          "Highlights Copilot helping a person named Christa.",
          "Includes an explicit download/try call-to-action (link in bio).",
          "Promotional, upbeat tone with a star emoji."
        ],
        "takeaways": [
          "This consumer-facing promotion could drive interest and downloads—prepare for potential increases in user activity tied to marketing campaigns.",
          "The clear call-to-action (link in bio) suggests coordination with marketing and support teams to handle inbound user traffic and inquiries.",
          "Messaging focused on personal empowerment indicates a need for accessible onboarding and user-facing documentation.",
          "Track campaign metrics to assess impact on usage and capacity planning for backend services."
        ],
        "tags": [
          "Microsoft Copilot",
          "Copilot",
          "Christa",
          "empowerment",
          "stars",
          "download",
          "AI",
          "promo"
        ]
      }
    },
    {
      "id": "2GZM7wOHFcg",
      "title": "Follow the carbon, find the money: Turning sustainability into financial value",
      "channel": "PwC US",
      "published_at": "2026-01-29T18:04:28.000Z",
      "url": "https://www.youtube.com/watch?v=2GZM7wOHFcg",
      "thumbnail": "https://i.ytimg.com/vi/2GZM7wOHFcg/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Rich Goode, Sustainability Principal at PwC US, explains that linking carbon reduction to financial impact is essential for engaging business leaders. Translating emissions outcomes into cost savings and business value—and understanding carbon accounting fundamentals—helps move sustainability from ambition to action and drives alignment, investment, and results.",
        "bullets": [
          "Rich Goode (PwC US) emphasizes framing sustainability in business/financial terms.",
          "A ton of carbon is abstract; financial value resonates with leadership.",
          "Translate emissions outcomes into cost savings and measurable business value.",
          "Understand carbon accounting fundamentals to communicate and measure progress."
        ],
        "takeaways": [
          "Quantify emissions reductions in financial terms to justify efficiency and decarbonization investments.",
          "Apply carbon accounting fundamentals to accurately measure and report grid/data center emissions.",
          "Frame sustainability proposals around cost savings and business value to secure leadership buy-in and funding.",
          "Convert emissions metrics into operational KPIs to turn plans into measurable results."
        ],
        "tags": [
          "sustainability",
          "carbon",
          "carbon-accounting",
          "financial-impact",
          "cost-savings",
          "business-value",
          "leadership",
          "investment",
          "PwC",
          "operational-resilience"
        ]
      }
    },
    {
      "id": "BYtYm-xyKR8",
      "title": "Bringing In $251K A Year With 3 Jobs In The Bay Area",
      "channel": "CNBC Make It",
      "published_at": "2026-01-29T17:47:46.000Z",
      "url": "https://www.youtube.com/watch?v=BYtYm-xyKR8",
      "thumbnail": "https://i.ytimg.com/vi/BYtYm-xyKR8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Naseema McElroy is a 44-year-old labor and delivery nurse in Brentwood, California who brings in $251K a year from three jobs in the Bay Area and runs a personal finance brand. She amassed nearly $1 million in debt by 2015, documented her debt-payoff journey through her business Financially Intentional, and was debt-free by 2017.",
        "bullets": [
          "Labor and delivery nurse and personal finance creator based in Brentwood, CA.",
          "Earns $251K annually from three jobs in the Bay Area.",
          "Had nearly $1M in debt in 2015.",
          "Launched Financially Intentional to document her debt-payoff journey.",
          "Reached debt-free status by 2017."
        ],
        "takeaways": [
          "Combined income from multiple jobs ($251K) correlated with rapid debt reduction (nearly $1M in 2015 to debt-free by 2017).",
          "Documenting a personal finance journey enabled creation of a brand (Financially Intentional) as an additional income/engagement channel.",
          "High earnings do not necessarily mean absence of significant debt—employee financial situations can be complex.",
          "The account illustrates the potential value of financial education and side-income strategies for improving personal financial resilience."
        ],
        "tags": [
          "personal finance",
          "debt payoff",
          "side hustle",
          "labor and delivery nurse",
          "Bay Area",
          "Financially Intentional",
          "CNBC Make It",
          "multiple jobs",
          "high income"
        ]
      }
    },
    {
      "id": "t6y2cVNjCAw",
      "title": "GeForce Garage - Summer of RTX Community Build",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-29T14:01:25.000Z",
      "url": "https://www.youtube.com/watch?v=t6y2cVNjCAw",
      "thumbnail": "https://i.ytimg.com/vi/t6y2cVNjCAw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… NVIDIA's GeForce Garage highlights the winner of the Summer of RTX r/buildapc Community Build contest, u/JeffersonPutnam, who built a small-form-factor system centered on a GeForce RTX 5090 Founders Edition. The video lists the full parts (Fractal Design Era 2 chassis, MSI MPG B850I Edge, Ryzen 7 9800X3D, 32GB DDR5-6000, Corsair SF1000, Corsair Nautilus 240 RS) and links to the PCPartPicker build.",
        "bullets": [
          "Winner: u/JeffersonPutnam — SFF GeForce RTX 5090 build",
          "Chassis: Fractal Design Era 2 (small form-factor)",
          "Key components: RTX 5090 FE, Ryzen 7 9800X3D, MSI MPG B850I Edge, 32GB DDR5-6000",
          "Power and cooling: Corsair SF1000 PSU and Corsair Nautilus 240 RS AIO",
          "Full parts list available on PCPartPicker (link provided)"
        ],
        "takeaways": [
          "RTX 5090 deployed in a small-form-factor system — compact builds must address high-performance GPU integration.",
          "Mini-ITX motherboard selection (MSI MPG B850I Edge) highlights footprint and compatibility considerations for dense deployments.",
          "Use of a 1000W SFX unit (Corsair SF1000) underscores planning for sufficient power delivery in constrained spaces.",
          "An AIO cooler (Corsair Nautilus 240 RS) was chosen for thermal management in the SFF chassis — cooling solutions are critical for tight enclosures.",
          "PCPartPicker BOM link provides a component-level reference useful for evaluating compatibility and procurement."
        ],
        "tags": [
          "GeForceGarage",
          "SummerOfRTX",
          "RTX5090",
          "SFF",
          "r/buildapc",
          "Ryzen7_9800X3D",
          "mini-ITX",
          "Corsair_SF1000"
        ]
      }
    },
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy GenAI solutions, leveraging Google Cloud infrastructure to streamline operations and boost developer productivity. The collaboration compressed TTEC's digital transformation timeline and unlocked new revenue streams.",
        "bullets": [
          "TTEC worked with Google Cloud Consulting to accelerate AI solution prototyping and deployment.",
          "GenAI and Google Cloud infrastructure were used to streamline operations and improve developer productivity.",
          "The partnership compressed the company's digital transformation timeline.",
          "AI deployments opened entirely new revenue streams for TTEC."
        ],
        "takeaways": [
          "Partnering with cloud consulting can materially accelerate AI deployment timelines—consider for time-sensitive initiatives.",
          "GenAI use cases benefit from scalable, robust cloud infrastructure when planning capacity and performance.",
          "Improved developer productivity from managed cloud services can shorten time-to-market for new offerings.",
          "AI-driven products and services can create new revenue streams, supporting investment in cloud resources and expertise."
        ],
        "tags": [
          "googlecloud",
          "ttec",
          "genai",
          "aideployment",
          "operationalefficiency",
          "customerexperience",
          "googlecloudplatform",
          "generativeai"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video shows Jo discovering Copilot Groups as a way to make route planning easy. It highlights Copilot as an AI tool aimed at simplifying planning tasks.",
        "bullets": [
          "Focuses on Copilot Groups for route planning",
          "Frames route planning as made easy",
          "Features a user named Jo discovering the capability",
          "Positions Copilot as an AI assistant",
          "Includes hashtags: #copilot #microsoftcopilot #ai"
        ],
        "takeaways": [
          "Presented as simplifying route planning—decision-makers should note Copilot Groups as an option when considering routing tools.",
          "Potential relevance for teams that coordinate field work or logistics in grid/data center operations.",
          "The clip is awareness-focused; further technical evaluation is needed to assess fit and integration requirements."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "copilot-groups",
          "route-planning",
          "jo"
        ]
      }
    }
  ]
}