{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-21T07:04:03.134Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "jOC3G_N20lY",
      "title": "Year-end toolkit: Cash flow classification",
      "channel": "PwC US",
      "published_at": "2026-01-20T22:41:11.000Z",
      "url": "https://www.youtube.com/watch?v=jOC3G_N20lY",
      "thumbnail": "https://i.ytimg.com/vi/jOC3G_N20lY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this PwC year-end toolkit episode focuses on the statement of cash flows, covering SEC comment letter observations, practical considerations for complex transactions (debt restructurings, payment processing arrangements, and business combinations), and reminders and best practices for year-end reporting. The episode also highlights a FASB project on targeted improvements to the statement of cash flows and points listeners to PwC’s related guidance and resources.",
        "bullets": [
          "1:05 – Overview and key reminders for the statement of cash flows",
          "3:46 – SEC comment letter themes related to cash flow classification",
          "7:52 – Debt restructurings and practical cash flow considerations",
          "15:21 – Payment processing arrangements and classification impacts",
          "20:27 – Business combinations; 32:56 – FASB project on targeted improvements"
        ],
        "takeaways": [
          "Ensure cash flow classifications are reviewed ahead of year-end, especially for complex transactions that can affect operating vs. financing/activity presentation.",
          "Review debt restructuring terms and payment-processing contracts for disclosure and classification implications that may attract SEC attention.",
          "Assess cash-flow impacts of mergers and acquisitions early to align reporting, disclosures, and integration planning.",
          "Monitor SEC comment letter trends and the FASB project outcomes to anticipate reporting changes and update policies or controls accordingly."
        ],
        "tags": [
          "statement of cash flows",
          "cash flow classification",
          "SEC comment letters",
          "debt restructuring",
          "payment processing",
          "business combinations",
          "FASB",
          "year-end reporting",
          "PwC",
          "financial reporting"
        ]
      }
    },
    {
      "id": "3wQ_yte0TTo",
      "title": "Build Voice Agents with Amazon Nova 2 Sonic &amp; AgentCore | AWS Show and Tell",
      "channel": "AWS Events",
      "published_at": "2026-01-20T22:10:10.000Z",
      "url": "https://www.youtube.com/watch?v=3wQ_yte0TTo",
      "thumbnail": "https://i.ytimg.com/vi/3wQ_yte0TTo/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This AWS Show and Tell episode presents Amazon Nova 2 Sonic and Amazon Bedrock AgentCore advances for building conversational voice agents, highlighting features like polyglot voices, 1-million token context windows, and asynchronous tool calling. The session also covers Strands BidiAgent integration, WebSocket-based bidirectional streaming, and hands-on Python demos with workshop code samples.",
        "bullets": [
          "Nova 2 Sonic: polyglot voices, 1-million token context windows, asynchronous tool calling.",
          "AgentCore: WebSocket-based bidirectional streaming for real-time two-way voice interactions.",
          "Strands BidiAgent: integration patterns for interruption handling and agent-to-agent collaboration.",
          "Hands-on Python implementation and production-ready best practices demonstrated.",
          "Workshop materials and code samples available on GitHub (speech-to-speech Nova Sonic workshop)."
        ],
        "takeaways": [
          "Real-time bidirectional streaming implies low-latency networking and connection scaling are key infrastructure considerations.",
          "Very large context windows (1M tokens) point to increased memory and storage needs for session state and model context handling.",
          "Support for asynchronous tool calls and multi-agent collaboration may increase compute variability and orchestration requirements.",
          "Providing developer-friendly environments (workshops, sample code) helps accelerate adoption but requires secure, scalable hosting for demos and CI."
        ],
        "tags": [
          "Amazon Nova 2",
          "Nova Sonic",
          "AgentCore",
          "Strands BidiAgent",
          "bidirectional streaming",
          "voice agents",
          "speech-to-speech",
          "Python",
          "AWS",
          "workshop"
        ]
      }
    },
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this Google Cloud video shows how Rate Insurance boosts agent efficiency using Agentforce and Gemini. It directs viewers to learn more about the Google Cloud and Salesforce partnership via the provided link.",
        "bullets": [
          "Video highlights Rate Insurance improving agent efficiency.",
          "Features Agentforce and Gemini as the core technologies shown.",
          "Posted on the Google Cloud channel.",
          "Includes a link to Google Cloud and Salesforce partnership details.",
          "No transcript is available in the description."
        ],
        "takeaways": [
          "This is a vendor use case demonstrating Agentforce + Gemini for agent efficiency—watch to judge potential relevance for your operations.",
          "The video references a Google Cloud and Salesforce partnership, which may be relevant when evaluating vendor ecosystems and procurement.",
          "Decision-makers should consider reviewing the demo before assessing infrastructure or integration needs tied to these specific solutions."
        ],
        "tags": [
          "Google Cloud",
          "Salesforce",
          "Rate Insurance",
          "Agentforce",
          "Gemini",
          "agent efficiency",
          "cloud partnership",
          "insurance tech"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Charly Stoever, 35, is a financial coach who lives rent-free in Portland by pet sitting full time and has spent the last 18 months living out of two suitcases. She brings in $60,000 a year. The piece is part of CNBC Make It's Millennial Money series.",
        "bullets": [
          "Charly Stoever, 35, is a financial coach.",
          "Lives rent-free in Portland by pet sitting full time.",
          "Has been living out of two suitcases for 18 months.",
          "Earns $60,000 per year from this lifestyle.",
          "Segment produced for CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "The example highlights growing lifestyle mobility; grid and data center planners should consider how mobile, gig-based living could shift local demand patterns.",
          "A viable income from nontraditional work (reported $60k) suggests some workers may decouple housing choices from employment locations, affecting regional capacity planning.",
          "Planners should prioritize data-driven monitoring of consumption rather than relying on static residential assumptions, since lifestyle shifts can alter where and when demand occurs.",
          "Track demographic and workforce trends from gig and remote-economy segments to inform site selection, scalability, and resilience planning."
        ],
        "tags": [
          "Charly Stoever",
          "financial coach",
          "pet sitting",
          "rent-free",
          "Portland",
          "$60,000",
          "Millennial Money",
          "CNBC Make It"
        ]
      }
    },
    {
      "id": "wicD8G0rn1Y",
      "title": "New: AWS Lambda tenant isolation | Serverless Office Hours",
      "channel": "AWS Events",
      "published_at": "2026-01-20T15:40:24.000Z",
      "url": "https://www.youtube.com/watch?v=wicD8G0rn1Y",
      "thumbnail": "https://i.ytimg.com/vi/wicD8G0rn1Y/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The video demonstrates AWS Lambda's new tenant isolation mode, which provides dedicated execution environments per tenant to keep cached data and execution contexts siloed and prevent cross-tenant data exposure. It also explains how the feature reduces infrastructure complexity, enables faster scaling during traffic spikes, and includes built-in monitoring with automatic tenant identifier logging for easier tenant-specific debugging.",
        "bullets": [
          "Tenant isolation mode provides dedicated execution environments per tenant.",
          "Cached data and execution contexts are siloed to prevent cross-tenant exposure.",
          "Designed to reduce infrastructure complexity for multi-tenant SaaS apps.",
          "Enables faster scaling during traffic spikes while maintaining isolation guarantees.",
          "Built-in monitoring logs tenant identifiers automatically to aid debugging."
        ],
        "takeaways": [
          "Stronger isolation reduces the risk of cross-tenant data exposure, improving security posture for multi-tenant SaaS.",
          "Simplified infrastructure can lower operational overhead and complexity for tenant segregation.",
          "Improved scaling behavior helps maintain performance during traffic spikes without compromising isolation.",
          "Automatic tenant identifier logging streamlines tenant-specific debugging and monitoring, reducing time to resolution."
        ],
        "tags": [
          "AWS",
          "AWS Lambda",
          "tenant isolation",
          "multi-tenant",
          "serverless",
          "SaaS",
          "security",
          "scaling",
          "monitoring",
          "Serverless Office Hours"
        ]
      }
    },
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Dr. Anna Chacon is a 39-year-old dermatologist in Miami, FL who operates her own private practice. Her net worth is about $6 million, made up of $3.2 million in investments, a $1.9 million home, and a $1.1 million office building.",
        "bullets": [
          "Dr. Anna Chacon, age 39, lives in Miami, Florida.",
          "She is a dermatologist with a private practice.",
          "Estimated net worth: ~$6 million.",
          "Asset breakdown: $3.2M investments, $1.9M home, $1.1M office building."
        ],
        "takeaways": [
          "Owner-occupied medical offices (e.g., a $1.1M office building) represent stable commercial load to include in local demand forecasts.",
          "Private medical practices are part of the commercial real estate base utilities and data centers serve in urban areas like Miami.",
          "Regional planners serving Miami should account for concentration of residential and commercial assets when assessing resilience and service continuity."
        ],
        "tags": [
          "dermatologist",
          "private practice",
          "personal finance",
          "net worth",
          "real estate",
          "investments",
          "Miami",
          "medical office",
          "CNBC Make It",
          "wealth"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this giant bubble of carbon dioxide is presented as a battery that can store 20 megawatts of energy. The description frames the technology as a way to address renewable energy fluctuations and help power the shift to clean energy worldwide.",
        "bullets": [
          "Described as a giant carbon dioxide bubble that functions as a battery.",
          "Reported storage capacity of 20 megawatts.",
          "Positioned to address the intermittency of renewable energy sources.",
          "Framed as a technology to support the global transition to clean energy."
        ],
        "takeaways": [
          "Track development and validation data for CO2-based storage to assess technical maturity and applicability.",
          "Consider whether a 20 MW-class storage option fits smoothing or backup needs for local grid or data center operations.",
          "Evaluate integration, safety, and regulatory implications of CO2-based storage before pilot deployment.",
          "Monitor potential partnerships or pilot opportunities to learn real-world performance and operational costs."
        ],
        "tags": [
          "ieee",
          "tech",
          "ieeespectrum",
          "innovation",
          "future",
          "futuristic",
          "energy",
          "battery",
          "carbon-dioxide",
          "CO2"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… KPMG ON AIR episode with Monika Palmowska and Jakub Roszkiewicz outlines how AI is changing transfer pricing — from monitoring profitability and comparative analyses to automating documentation. The hosts stress that AI will strengthen advisors' work (not replace them), note risks around data/security and GDPR, and discuss practical implementation steps including personas, ERP integration, secure environments like Digital Gateway, and process organization.",
        "bullets": [
          "AI use cases: monitoring rentowności, inteligentne benchmarki i porównania.",
          "Automatyzacja dokumentacji cen transferowych ogranicza manualne zadania.",
          "AI ma wzmacniać doradców podatkowych, a nie ich zastępować.",
          "Główne ryzyka: jakość danych, bezpieczeństwo, RODO i halucynacje modeli.",
          "Wdrożenie: persony, integracja z ERP, Digital Gateway oraz uporządkowanie procesów jako fundament."
        ],
        "takeaways": [
          "Koszty i alokacja: AI może poprawić monitorowanie rentowności i benchmarki, co pomaga precyzyjniej alokować koszty operacyjne centrów danych.",
          "Automatyzacja: automatyzacja dokumentacji i raportów zmniejsza nakład pracy i ryzyko błędów przy rozliczeniach wewnątrzgrupowych.",
          "Bezpieczeństwo danych: kluczowe jest stosowanie bezpiecznych środowisk (np. Digital Gateway) i zgodność z RODO przy przetwarzaniu danych operacyjnych.",
          "Integracja systemów: połączenie AI z ERP i istniejącymi procesami umożliwia korzystanie z inteligentnych benchmarków i lepsze decyzje finansowe.",
          "Start od porządkowania procesów i pilotażu: uporządkowane dane i jasne persony ułatwiają kontrolowane wdrożenia AI i ograniczają ryzyko."
        ],
        "tags": [
          "AI",
          "transfer pricing",
          "tax",
          "automation",
          "ERP",
          "data security",
          "GDPR",
          "benchmarking",
          "KPMG",
          "Digital Gateway"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video encourages keeping momentum by stacking small wins with Microsoft Copilot. It positions Copilot as a supportive tool for workouts, projects, and personal goals to help maintain progress.",
        "bullets": [
          "Promotes stacking small wins to sustain momentum.",
          "Highlights Microsoft Copilot as the enabling tool.",
          "Applies to workouts, projects, and personal goals.",
          "Focuses on consistent progress rather than big breakthroughs.",
          "Short, motivational messaging about using Copilot daily."
        ],
        "takeaways": [
          "Use Copilot to break large data center initiatives into smaller, trackable tasks to sustain progress.",
          "Leverage Copilot for routine project management and staff workflows to build steady operational improvements.",
          "Apply Copilot-driven incremental wins to support training and adoption of new tools or processes."
        ],
        "tags": [
          "Microsoft Copilot",
          "small wins",
          "momentum",
          "productivity",
          "projects",
          "workouts",
          "personal goals",
          "goal-setting",
          "habit building",
          "AI assistant"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The video highlights the Dell PowerEdge R770AP server powered by Intel® Xeon® 6 processors, emphasizing precision and speed for high-frequency trading. It states these systems can perform hundreds of trades in seconds to help maximize gains and minimize losses and frames Intel Xeon 6 CPUs as defining the future of finance.",
        "bullets": [
          "Focus on high-frequency trading workloads.",
          "Dell PowerEdge R770AP server featured.",
          "Powered by Intel® Xeon® 6 processors.",
          "Claims of precision and speed enabling hundreds of trades in seconds.",
          "Positioning Xeon 6 CPUs as a foundation for the future of finance."
        ],
        "takeaways": [
          "For HFT use cases, prioritize servers and CPUs that deliver low-latency, high-throughput performance.",
          "Evaluate Dell PowerEdge R770AP with Intel Xeon 6 for time-sensitive trading workloads.",
          "Infrastructure performance can directly affect trading execution speed and financial outcomes.",
          "Leverage vendor resources (e.g., Intel Business) for guidance on deploying finance-focused server configurations."
        ],
        "tags": [
          "high-frequency-trading",
          "HFT",
          "Intel-Xeon-6",
          "Dell-PowerEdge-R770AP",
          "low-latency",
          "data-center",
          "trading",
          "servers",
          "finance"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video says Copilot revived a lost creative spark and invites viewers to download and try it via the link in bio. It's a brief promotional message encouraging hands-on experience with Copilot.",
        "bullets": [
          "Message: Copilot restored a lost creative spark.",
          "Call to action: Download Copilot and try it for yourself.",
          "Location to get it: link in bio.",
          "Tone: short, promotional, and upbeat."
        ],
        "takeaways": [
          "If team creativity is a concern, consider trialing Copilot to see if it helps restore creative momentum.",
          "Use the suggested download (link in bio) to evaluate Copilot hands-on before broader adoption.",
          "Keep trials focused on real workflows to quickly assess whether Copilot adds value to decision-making or problem-solving."
        ],
        "tags": [
          "creative-spark",
          "copilot",
          "brought-back-to-life",
          "download-copilot",
          "try-it",
          "link-in-bio"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this NVIDIA GeForce video spotlights the open-world martial arts RPG Where Winds Meet running with DLSS 4 and Multi Frame Generation, presented with #RTXOn visuals. The clip credits DigitalDreamsyt for the footage.",
        "bullets": [
          "Showcases Where Winds Meet, an open-world martial arts RPG",
          "Highlights DLSS 4 with Multi Frame Generation",
          "Presented with #RTXOn visuals",
          "Footage credited to DigitalDreamsyt"
        ],
        "takeaways": [
          "Demo emphasizes DLSS 4 with Multi Frame Generation—verify GPU and driver support for these features when provisioning systems.",
          "RTXOn visuals indicate need for ray-tracing capable hardware in test and demo environments.",
          "Include Multi Frame Generation and DLSS 4 in validation and compatibility testing for graphics workloads and demos."
        ],
        "tags": [
          "Where Winds Meet",
          "DLSS 4",
          "Multi Frame Generation",
          "RTXOn",
          "NVIDIA GeForce",
          "open-world",
          "martial arts",
          "DigitalDreamsyt",
          "gameplay",
          "graphics"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this Intel Business video features Taha Khalifa and is part of the Intel Business channel’s series for IT professionals. The channel provides resources, guidance, and expert insights covering topics from data centers to devices, and the description includes links to subscribe and follow Intel Business on multiple platforms.",
        "bullets": [
          "No transcript is provided for the video; details beyond the title and channel are not in the description.",
          "Video is titled 'Taha Khalifa (Intel) | Intel Business' and hosted on the Intel Business YouTube channel.",
          "Intel Business positions itself as a source of IT information spanning data centers to devices.",
          "Description links to subscribe and to Intel Business website, X, LinkedIn, and Facebook.",
          "Content is presented as resources, guidance, and expert insights to help complete IT projects."
        ],
        "takeaways": [
          "Intel Business is presented as a go-to source for data center and IT project guidance—visit the website for resources.",
          "Following or subscribing to Intel Business is the recommended way to stay updated on expert insights relevant to grid/data center decisions.",
          "Use the provided social and website links to access Intel’s guidance and resources when planning or evaluating IT/data center initiatives."
        ],
        "tags": [
          "Intel",
          "Intel Business",
          "Taha Khalifa",
          "data centers",
          "IT",
          "devices",
          "IT resources",
          "expert insights",
          "subscribe",
          "Intel IT Center"
        ]
      }
    }
  ]
}