{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-20T19:21:16.814Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video demonstrates how Rate Insurance boosts agent efficiency using Agentforce and Gemini and points viewers to resources about the Google Cloud and Salesforce partnership. It invites viewers to learn more via the provided partnership link.",
        "bullets": [
          "Highlights Rate Insurance improving agent efficiency with Agentforce and Gemini.",
          "Mentions a Google Cloud and Salesforce partnership and provides a link to learn more.",
          "Positions Agentforce and Gemini as central tools in the showcased workflow.",
          "Directs viewers to additional partnership resources via the provided URL."
        ],
        "takeaways": [
          "Consider evaluating vendor partnerships (Google Cloud + Salesforce) when assessing solution stacks for efficiency improvements.",
          "Investigate agent automation tools (e.g., Agentforce and Gemini) as potential ways to reduce operational load on staff.",
          "Review integration and support implications for cloud/CRM combined solutions before deployment in data center/grid environments.",
          "Use the provided partnership resources as a starting point for technical and commercial due diligence."
        ],
        "tags": [
          "Rate Insurance",
          "Agentforce",
          "Gemini",
          "Google Cloud",
          "Salesforce",
          "agent efficiency",
          "partnership",
          "insurance tech"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Charly Stoever, 35, is a financial coach who has spent the last 18 months living out of two suitcases and living rent-free in Portland, Oregon by pet sitting full time. She brings in $60,000 a year, and her story is featured in CNBC Make It's Millennial Money series.",
        "bullets": [
          "Charly Stoever is 35 and a financial coach.",
          "She lives rent-free in Portland by pet sitting full time.",
          "She has lived out of two suitcases for the past 18 months.",
          "Her annual income from this arrangement is $60,000.",
          "This profile appears in CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "Nontraditional, mobile income arrangements (e.g., full-time pet sitting) can support stable middle-income lifestyles—monitor how such patterns affect local residential occupancy and service demand.",
          "Transient residents who move frequently and live minimally may create short-duration or variable demand for utilities and connectivity in urban areas like Portland—plan for flexible service provisioning.",
          "Stories highlighting gig-economy living suggest a continued need for reliable, accessible services for mobile workers and renters—consider scalability and resilience in planning.",
          "Profiles of rent-free and mobile living point to evolving customer profiles; data centers and grid planners should track demographic shifts that could alter localized load and connectivity patterns."
        ],
        "tags": [
          "pet sitting",
          "rent-free",
          "travel",
          "Portland",
          "financial coach",
          "$60,000",
          "two suitcases",
          "CNBC Make It",
          "Millennial Money",
          "Charly Stoever"
        ]
      }
    },
    {
      "id": "wicD8G0rn1Y",
      "title": "New: AWS Lambda tenant isolation | Serverless Office Hours",
      "channel": "AWS Events",
      "published_at": "2026-01-20T15:40:24.000Z",
      "url": "https://www.youtube.com/watch?v=wicD8G0rn1Y",
      "thumbnail": "https://i.ytimg.com/vi/wicD8G0rn1Y/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Learn how to build secure multi-tenant SaaS applications using AWS Lambda's new tenant isolation mode. The feature provides dedicated execution environments per tenant to silo cached data and execution contexts, reduces infrastructure complexity, enables faster scaling during traffic spikes, and includes automatic tenant identifier logging for easier tenant-specific debugging.",
        "bullets": [
          "Dedicated execution environments per tenant to prevent cached-data and execution-context leakage.",
          "Siloed execution contexts reduce risk of cross-tenant data exposure.",
          "Reduces infrastructure complexity while enforcing robust security boundaries.",
          "Improves scaling behavior during traffic spikes for tenant workloads.",
          "Built-in monitoring with automatic tenant identifier logging for easier debugging."
        ],
        "takeaways": [
          "Enhance tenant security without provisioning separate infrastructure for each tenant.",
          "Lower operational complexity by relying on Lambda's isolation rather than custom isolation layers.",
          "Maintain performance under load with faster scaling for tenant traffic.",
          "Streamline incident triage and debugging using automatic tenant identifier logs."
        ],
        "tags": [
          "AWS Lambda",
          "tenant-isolation",
          "serverless",
          "multi-tenant",
          "SaaS",
          "security",
          "monitoring",
          "scaling",
          "Serverless Office Hours",
          "AWS"
        ]
      }
    },
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Dr. Anna Chacon, 39, is a Miami-based dermatologist who runs her own private practice. Her reported net worth is about $6 million, made up of $3.2 million in investments, a $1.9 million home, and a $1.1 million office building.",
        "bullets": [
          "Name: Dr. Anna Chacon, age 39",
          "Location: Miami, FL",
          "Profession: Dermatologist with a private practice",
          "Total net worth: approximately $6 million",
          "Asset breakdown: $3.2M investments, $1.9M home, $1.1M office building"
        ],
        "takeaways": [
          "Physicians with private practices may directly own commercial real estate (office buildings) — potential clients for reliable power and infrastructure services.",
          "High net worth and substantial investment holdings suggest financial capacity to fund resilience or upgrade projects when presented with clear ROI.",
          "Urban locations like Miami can concentrate medical practices and related property needs, highlighting opportunities for localized infrastructure solutions."
        ],
        "tags": [
          "dermatologist",
          "private-practice",
          "net-worth",
          "investments",
          "Miami",
          "real-estate",
          "office-building",
          "physician",
          "wealth-management"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this giant bubble of carbon dioxide is presented as a battery that can store 20 megawatts of power and provide about eight hours of energy. The technology is described as a means to smooth renewable intermittency and help accelerate the global shift to clean energy.",
        "bullets": [
          "Giant bubble of carbon dioxide functions as an energy-storage battery.",
          "Stores 20 megawatts of power and about eight hours of energy (per title).",
          "Aimed at addressing fluctuations in renewable energy supply.",
          "Framed as supporting the global transition to clean energy.",
          "Presented by IEEE Spectrum (video source)."
        ],
        "takeaways": [
          "Offers 20 MW capacity for roughly eight hours — potential for medium-duration backup or load-shifting.",
          "Could help integrate variable renewables by storing excess generation for later use.",
          "May serve as a distributed option for strengthening grid reliability or supporting data center resilience.",
          "Positioned as a scalable, clean-energy enabling technology for broader decarbonization efforts."
        ],
        "tags": [
          "CO2 battery",
          "carbon dioxide",
          "energy storage",
          "renewables",
          "grid reliability",
          "clean energy",
          "battery technology",
          "energy innovation",
          "IEEE Spectrum"
        ]
      }
    },
    {
      "id": "OINppmPan0o",
      "title": "Figure Skating | Making Team USA presented by Xfinity with Apolo Ohno",
      "channel": "Team USA",
      "published_at": "2026-01-16T19:30:36.000Z",
      "url": "https://www.youtube.com/watch?v=OINppmPan0o",
      "thumbnail": "https://i.ytimg.com/vi/OINppmPan0o/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Figure skating duo Vadym Kolesnik and Emilia Zingas sit down with Apolo Ohno ahead of the Winter Olympics on this episode of Making Team USA presented by Xfinity. The clip is promoted across Team USA’s social channels.",
        "bullets": [
          "Interview features Vadym Kolesnik and Emilia Zingas with host Apolo Ohno.",
          "Episode is part of Making Team USA and is presented by Xfinity.",
          "Positioned as Olympic-prep content ahead of the Winter Olympics.",
          "Branded with the tagline “Built on trust ⛸️.”",
          "Promoted via Team USA’s YouTube and social channels (Facebook, Twitter, Instagram, TikTok)."
        ],
        "takeaways": [
          "Olympic-timed content can drive elevated traffic — ensure CDN capacity and autoscaling to handle potential view spikes.",
          "Sponsor-branded episodes (presented by Xfinity) increase the importance of high availability and consistent quality-of-service for brand protection.",
          "Multi-platform promotion across social channels requires reliable ingest, transcoding and distribution pipelines for varied formats and audiences.",
          "Implement robust monitoring and analytics to track performance and viewer engagement across YouTube and social platforms during the campaign."
        ],
        "tags": [
          "figure skating",
          "Vadym Kolesnik",
          "Emilia Zingas",
          "Apolo Ohno",
          "Winter Olympics",
          "Making Team USA",
          "Xfinity",
          "Team USA",
          "interview",
          "MTUSA"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… KPMG's podcast episode examines how AI is already being applied to transfer pricing—monitoring profitability, performing comparative analyses, and automating documentation—while outlining steps for implementation. The hosts stress that AI will augment (not replace) tax advisers, highlight risks like data security, GDPR and hallucinations, and recommend secure environments (e.g., Digital Gateway) and orderly processes as foundations for rollout.",
        "bullets": [
          "AI use cases: monitoring profitability, intelligent benchmarks and automation of transfer-pricing documentation.",
          "AI is seen as a tool to strengthen advisers' work, not substitute them.",
          "Key risks: data quality, security, GDPR compliance and model hallucinations.",
          "Secure workspaces (Digital Gateway) and ERP integration are important enablers.",
          "Start implementation by organizing processes and taking incremental first steps."
        ],
        "takeaways": [
          "Provision secure, compliant environments (similar to Digital Gateway) for AI workloads to protect sensitive tax and pricing data.",
          "Ensure GDPR/data-governance controls and data-quality processes before deploying AI to reduce legal and operational risk.",
          "Plan for ERP integration and benchmark data flows—AI-driven monitoring and benchmarks will require reliable, connected data pipelines.",
          "Anticipate compute, storage and access-control needs to support automation and continuous monitoring use cases.",
          "Prioritize process standardization as a prerequisite to successful AI adoption and incremental deployment."
        ],
        "tags": [
          "podatki",
          "AI",
          "ceny transferowe",
          "transfer-pricing",
          "dokumentacja",
          "bezpieczeństwo danych",
          "RODO",
          "ERP",
          "Digital Gateway",
          "automatyzacja"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Copilot is presented as a tool to help you keep momentum across workouts, projects, and personal goals by stacking small wins. It frames Copilot as a way to maintain consistent progress across different types of tasks.",
        "bullets": [
          "Helps maintain momentum for workouts, projects, and personal goals",
          "Emphasizes stacking small wins to drive progress",
          "Applies to both personal routines and project work",
          "Positions Copilot as a consistency and progress aid"
        ],
        "takeaways": [
          "Based on the description: focusing on small, repeatable wins can help sustain long-term infrastructure or upgrade projects.",
          "Based on the description: maintaining momentum—even for routine tasks—can improve team consistency during operations and rollouts.",
          "Based on the description: framing initiatives as a series of manageable wins may aid adoption and steady progress on multi-phase deployments.",
          "Based on the description: tools that support consistent, incremental progress can be useful complements to large-scale planning and execution."
        ],
        "tags": [
          "Copilot",
          "momentum",
          "small-wins",
          "productivity",
          "workouts",
          "projects",
          "personal-goals",
          "consistency",
          "Microsoft"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The video highlights how the Dell PowerEdge R770AP server powered by Intel® Xeon® 6 processors delivers the precision and speed required for high-frequency trading, performing hundreds of trades in seconds to help maximize gains and minimize losses. It frames Intel Xeon 6 CPUs as a high-performance technology shaping the future of finance.",
        "bullets": [
          "High-frequency trading demands extreme precision and speed.",
          "Dell PowerEdge R770AP server is featured as the hardware platform.",
          "Powered by Intel® Xeon® 6 processors for high-performance trading workloads.",
          "Claims support for performing hundreds of trades in seconds to maximize gains and minimize losses.",
          "Video invites viewers to subscribe to Intel Business for more IT insights."
        ],
        "takeaways": [
          "Latency-sensitive trading benefits from high-performance CPUs—evaluate Intel Xeon 6 for HFT workloads.",
          "Consider Dell PowerEdge R770AP as a potential platform when specifying HFT infrastructure.",
          "Performance and precision directly affect trading outcomes—prioritize benchmarking and low-latency design.",
          "Assess capacity to handle hundreds of trades per second when sizing systems and network components."
        ],
        "tags": [
          "high-frequency trading",
          "HFT",
          "Dell PowerEdge R770AP",
          "Intel Xeon 6",
          "low latency",
          "finance",
          "data center",
          "high-performance computing",
          "Intel Business"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video states the creative spark was out and Copilot brought it back to life. It invites viewers to download Copilot and try it via the link in the bio.",
        "bullets": [
          "No transcript available.",
          "Description: the creative spark was out; Copilot brought it back to life.",
          "Call to action: download Copilot and try it.",
          "Link to download provided in the bio.",
          "Promotional, encouraging viewers to try the product themselves."
        ],
        "takeaways": [
          "The content is promotional—watch the video and try the product via the provided link to verify claimed benefits for your teams.",
          "A downloadable trial is available (link in bio), which enables hands-on evaluation before any procurement or deployment decisions.",
          "No transcript is available here; decision-makers should review the full video and gather technical documentation to assess compatibility, security, and integration needs.",
          "Treat this as initial marketing material and follow up with technical validation and stakeholder testing specific to grid/data center operations."
        ],
        "tags": [
          "Copilot",
          "Creativity",
          "AI",
          "Microsoft",
          "Download",
          "Promo",
          "Call-to-action",
          "Try Copilot",
          "Link in bio"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video showcases the open-world martial arts RPG Where Winds Meet running with NVIDIA's DLSS 4 featuring Multi Frame Generation and #RTXOn. Footage was captured by @DigitalDreamsyt to highlight the game's visuals under these NVIDIA technologies.",
        "bullets": [
          "Open-world martial arts RPG: Where Winds Meet",
          "Features DLSS 4 with Multi Frame Generation",
          "Promoted with #RTXOn visuals",
          "Footage credited to @DigitalDreamsyt",
          "Produced by NVIDIA GeForce channel"
        ],
        "takeaways": [
          "Shows DLSS 4 with Multi Frame Generation in a real-game scenario—useful for evaluating technology readiness.",
          "RTX-enabled visuals (#RTXOn) indicate workloads that leverage NVIDIA ray-tracing and related GPU features.",
          "Content can serve as a reference clip for visual quality comparisons when assessing GPU/software stacks.",
          "Footage credit provides a source for capture methodology or sample media when validating rendering workflows."
        ],
        "tags": [
          "WhereWindsMeet",
          "DLSS4",
          "MultiFrameGeneration",
          "RTXOn",
          "open-world",
          "martial-arts",
          "NVIDIA",
          "GeForce",
          "DigitalDreamsyt",
          "gaming"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this Intel Business video directs viewers to the Intel Business channel as a source for IT information and guidance. The channel offers resources and expert insights covering topics from data centers to devices and includes links to the Intel Business website and social channels with a call to subscribe.",
        "bullets": [
          "Intel Business provides IT information spanning data centers to devices",
          "Offers resources, guidance, and expert insights to support IT projects",
          "Description includes links to the Intel Business website and social channels (X, LinkedIn, Facebook)",
          "Call to subscribe to the Intel Business YouTube channel",
          "Transcript not available"
        ],
        "takeaways": [
          "Use Intel Business as a centralized resource for guidance on data center planning and device strategy",
          "Leverage expert insights from the channel to inform project decisions and reduce deployment risk",
          "Visit the Intel Business website and follow social channels for deeper resources and updates",
          "Subscribe to the channel to receive ongoing IT guidance relevant to grid and data center operations"
        ],
        "tags": [
          "Intel Business",
          "IT resources",
          "data centers",
          "devices",
          "IT projects",
          "expert insights",
          "Intel",
          "subscribe",
          "IT guidance"
        ]
      }
    }
  ]
}