{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-23T10:51:59.625Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI in audit is presented as a current, practical part of audit work—supporting repetitive tasks, analyzing full data populations and helping auditors make better decisions. The podcast features KPMG leaders explaining concrete tools (AI Transaction Scoring Tool, Clara AI, KPMG Clara), client benefits and the evolving competencies and risks tied to AI in audit.",
        "bullets": [
          "Practical AI tools discussed: AI Transaction Scoring Tool, Clara AI (conversational assistants/agents) and the KPMG Clara platform.",
          "Shift from sampling to full-population analysis enables deeper data-driven audit insights.",
          "AI supports documentation, disclosure analysis and real-time management of the audit process.",
          "Clients gain faster, more comprehensive analyses and improved communication via Clara for Clients.",
          "Key implementation topics: auditor adaptation, data security, regulatory environment and AI-related risks."
        ],
        "takeaways": [
          "Expect audits to increasingly analyze entire datasets rather than samples, which can affect how operational data from grids/data centers is reviewed.",
          "Real-time audit platforms and client-facing tools may require more timely, structured data sharing and clearer access controls.",
          "Data security and regulatory compliance are highlighted—ensure audit data handling meets evolving standards before sharing.",
          "Internal teams may need new competencies to interact with AI-driven audit workflows and to respond to findings based on large-scale data analyses."
        ],
        "tags": [
          "AI",
          "audyt",
          "KPMG",
          "KPMG Clara",
          "Clara AI",
          "AI Transaction Scoring",
          "data security",
          "audytorzy",
          "regulacje"
        ]
      }
    },
    {
      "id": "6hu7hYLiu08",
      "title": "Get Step-By-Step Fixes with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-21T20:14:00.000Z",
      "url": "https://www.youtube.com/watch?v=6hu7hYLiu08",
      "thumbnail": "https://i.ytimg.com/vi/6hu7hYLiu08/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Copilot provides real-time visual support for home projects and repairs by seeing what you see and delivering step-by-step instructions. The description highlights help for issues like leaky pipes and overflowing washing machines with clear, actionable guidance.",
        "bullets": [
          "Real-time visual support for home repairs",
          "Can 'see what you see' to assess problems",
          "Delivers step-by-step instructions",
          "Examples include leaky pipes and overflowing washing machines",
          "Emphasizes clear, actionable guidance"
        ],
        "takeaways": [
          "The described real-time, visual 'see what you see' capability may be relevant when evaluating remote-assisted troubleshooting tools for on-site infrastructure work.",
          "Step-by-step instruction delivery, as described, could support standardized repair procedures and reduce on-site errors.",
          "Applicability to mechanical and plumbing issues suggests potential usefulness for physical infrastructure maintenance tasks.",
          "Clear, actionable guidance highlighted in the description could have implications for field technician training and remote support workflows."
        ],
        "tags": [
          "Copilot",
          "real-time support",
          "visual assistance",
          "home repairs",
          "step-by-step",
          "leaky pipes",
          "washing machine",
          "troubleshooting",
          "home projects",
          "Microsoft Copilot"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield has officially launched and the trailer highlights NVIDIA DLSS 4 with Multi Frame Generation. The game is a 3D real-time strategy RPG in which you play the Endministrator exploring Talos-II; the footage was captured on a GeForce RTX 5080 at 4K Ultra with DLSS 4 Multi Frame Generation 4X mode.",
        "bullets": [
          "Official launch of Arknights: Endfield with NVIDIA DLSS 4 and Multi Frame Generation.",
          "Genre: 3D real-time strategy RPG; player role: Endministrator of Endfield Industries on Talos-II.",
          "Trailer capture: GeForce RTX 5080, 4K Ultra settings, DLSS 4 MFG 4X mode.",
          "Links provided for game info and multiple official social channels.",
          "Trailer promoted by NVIDIA GeForce with hashtags #ArknightsEndfield #RTXOn #DLSS4."
        ],
        "takeaways": [
          "Ensure infrastructure supports GPUs compatible with DLSS 4 (example cited: GeForce RTX 5080) if reproducing or benchmarking this content.",
          "For cloud gaming or demo services, plan for hardware capable of 4K Ultra plus DLSS 4 Multi Frame Generation to match promotional fidelity.",
          "Include DLSS 4 support in validation and compatibility testing when onboarding newly launched titles that advertise this feature."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "NVIDIA",
          "RTX5080",
          "4K",
          "RTS",
          "GeForce",
          "GameLaunch"
        ]
      }
    },
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video shows how Rate Insurance boosts agent efficiency using Agentforce and Gemini. It references the Google Cloud and Salesforce partnership and directs viewers to a link for more information.",
        "bullets": [
          "No transcript is available for the video.",
          "Demonstrates Rate Insurance improving agent efficiency with Agentforce and Gemini.",
          "Highlights the Google Cloud and Salesforce partnership (link provided).",
          "Published by Google Cloud on 2026-01-20.",
          "Directs viewers to learn more via the provided partnership link."
        ],
        "takeaways": [
          "Enterprises in insurance are using cloud-based tools (Agentforce and Gemini) to target agent efficiency improvements.",
          "The Google Cloud and Salesforce partnership is being highlighted as relevant to these solutions.",
          "Data center and grid decision-makers should note the prevalence of integrated cloud/SaaS deployments when planning interoperability and customer support.",
          "Refer to the provided partnership link for technical or partnership details before making infrastructure commitments."
        ],
        "tags": [
          "Google Cloud",
          "Salesforce",
          "Agentforce",
          "Gemini",
          "Rate Insurance",
          "agent efficiency",
          "cloud partnership",
          "insurance tech",
          "AI",
          "demo"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Charly Stoever, 35, is a financial coach who has spent the last 18 months living out of two suitcases while pet sitting full time in Portland, Oregon, bringing in $60,000 a year and living rent-free. The CNBC Make It Millennial Money segment profiles her approach to earning, spending, and saving through this lifestyle.",
        "bullets": [
          "Charly Stoever is a 35-year-old financial coach living rent-free in Portland, Oregon.",
          "She pet sits full time and has been living out of two suitcases for 18 months.",
          "Her reported annual income from this arrangement is $60,000.",
          "This story is part of CNBC Make It's Millennial Money series.",
          "Produced and reported by CNBC Make It staff (Lauren Shamo, Ryan Ermey, et al.)."
        ],
        "takeaways": [
          "Demonstrates aggressive cost-minimization strategies (rent-free living) that reduce fixed personal expenses.",
          "Highlights a mobile, low-overhead work/lifestyle model that can inform workforce flexibility planning.",
          "Shows how alternative income arrangements can achieve a six-figure-ish lifestyle outcome without traditional housing costs.",
          "Signals interest in nontraditional employment models that organizations may consider when assessing remote or transient staff needs."
        ],
        "tags": [
          "pet sitting",
          "rent-free",
          "Portland",
          "financial coach",
          "Millennial Money",
          "CNBC Make It",
          "travel",
          "60k income",
          "minimalist living"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this giant bubble of carbon dioxide stores 20 megawatts of energy and provides about 8 hours of storage. The description says these batteries address renewable energy fluctuations and will help power the global shift to clean energy.",
        "bullets": [
          "Technology uses a large carbon dioxide bubble as an energy storage medium.",
          "Stores 20 megawatts of energy and delivers roughly 8 hours of capacity.",
          "Designed to smooth out fluctuations from renewable energy sources.",
          "Framed as a solution to support the global transition to clean energy."
        ],
        "takeaways": [
          "Offers 8 hours of storage at a 20 MW scale — relevant for multi-hour energy shifting needs.",
          "Directly targets variability from renewables, useful for grid balancing strategies.",
          "Represents an option to consider when planning decarbonization for grids or large facilities.",
          "Positioned as a technology to support broader clean-energy deployment worldwide."
        ],
        "tags": [
          "co2",
          "carbon-dioxide",
          "energy-storage",
          "battery",
          "20-MW",
          "8-hour",
          "renewables",
          "grid",
          "data-centers",
          "clean-energy"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the podcast episode explains how AI is already affecting transfer pricing — from monitoring profitability and performing comparative analyses to automating documentation — and outlines practical steps for adoption. It highlights risks around data and security (RODO, hallucinations), mentions secure environments like Digital Gateway, and stresses that AI will augment rather than replace tax advisors.",
        "bullets": [
          "AI applications in transfer pricing: profitability monitoring, benchmarking, and documentation automation.",
          "AI complements tax advisors and can accelerate skill development for junior staff.",
          "Key risks include data protection, security, and AI hallucinations; RODO compliance is emphasized.",
          "Digital Gateway presented as a secure environment for working with AI.",
          "Integration with ERP and clean, well-ordered processes are foundational first steps for AI deployment."
        ],
        "takeaways": [
          "Prioritize secure, compliant hosting solutions (e.g., Digital Gateway) when supporting AI workloads for tax functions.",
          "Enforce strong data governance and RODO-compliant controls before exposing tax data to AI tools.",
          "Ensure ERP connectivity and standardized data pipelines to enable AI-driven benchmarking and monitoring.",
          "Support staff training and human-in-the-loop workflows since AI is positioned as an augmenting tool, not a replacement."
        ],
        "tags": [
          "AI",
          "cenytransferowe",
          "podatki",
          "transferpricing",
          "automatyzacja",
          "bezpieczeństwo danych",
          "ERP",
          "DigitalGateway",
          "KPMG"
        ]
      }
    }
  ]
}