{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-19T09:57:29.516Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "6L86-OnOXV0",
      "title": "How I Built A $1M/Year Business - And Helped My Parents Retire",
      "channel": "CNBC Make It",
      "published_at": "2026-01-17T15:00:09.000Z",
      "url": "https://www.youtube.com/watch?v=6L86-OnOXV0",
      "thumbnail": "https://i.ytimg.com/vi/6L86-OnOXV0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, when he was 15 Tuan Le vowed to help his parents retire after his family emigrated from Vietnam to Toronto in 2015. Ten years later his social video production company, ShortsCut, brings in over $1 million USD a year in sales, and he now pays his parents' rent and living expenses so they no longer have to work full time.",
        "bullets": [
          "Tuan Le emigrated from Vietnam to Toronto in 2015 and promised at 15 to help his parents retire.",
          "He founded ShortsCut, a social video production company.",
          "ShortsCut generates over $1 million USD per year in sales.",
          "He now covers his parents' rent and living expenses so they no longer work full time.",
          "Video credits include Producer/Editor Zach Green and Reporter Kamaron McNair."
        ],
        "takeaways": [
          "A high-revenue social video company highlights sustained demand for video hosting and delivery—data centers should consider scalable storage and bandwidth capacity.",
          "Creators and small media firms can scale to significant revenue, signaling opportunities for cloud, edge, and CDN services tailored to content production workloads.",
          "Affordable, flexible infrastructure options can help bootstrapped media businesses grow without heavy capital—consider pricing and service models that support startups and creators.",
          "Regional success stories (Toronto) point to localized demand; regional data center capacity and low-latency access may be valuable for content producers."
        ],
        "tags": [
          "Tuan Le",
          "ShortsCut",
          "social video production",
          "entrepreneurship",
          "immigrant story",
          "CNBC Make It",
          "$1M business",
          "Toronto",
          "family support",
          "2026"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This video highlights a new carbon-dioxide–based battery that forms a giant CO2 bubble capable of storing 20 megawatts of power and providing about 8 hours of energy. The technology is presented as a way to buffer fluctuating renewable generation and support the global shift to clean energy.",
        "bullets": [
          "Battery uses a giant carbon dioxide bubble as the storage medium.",
          "Can store 20 megawatts of power and deliver roughly 8 hours of energy.",
          "Designed to address fluctuations in renewable energy supply.",
          "Positioned as a tool to accelerate the transition to clean energy worldwide."
        ],
        "takeaways": [
          "Offers multi-hour, multi-megawatt storage that can help balance variable renewable generation.",
          "Could improve grid reliability and provide extended backup capacity compared with short-duration batteries.",
          "May be relevant for operators planning large-scale clean-energy integration or evaluating longer-duration storage options."
        ],
        "tags": [
          "co2",
          "8-hours",
          "20-MW",
          "battery",
          "energy",
          "renewables",
          "ieee",
          "tech",
          "innovation"
        ]
      }
    },
    {
      "id": "OINppmPan0o",
      "title": "Figure Skating | Making Team USA presented by Xfinity with Apolo Ohno",
      "channel": "Team USA",
      "published_at": "2026-01-16T19:30:36.000Z",
      "url": "https://www.youtube.com/watch?v=OINppmPan0o",
      "thumbnail": "https://i.ytimg.com/vi/OINppmPan0o/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, figure skating duo Vadym Kolesnik and Emilia Zingas sit down with Apolo Ohno ahead of the Winter Olympics on this episode of Making Team USA presented by Xfinity. The episode is framed around the partnership theme “Built on trust.”",
        "bullets": [
          "Vadym Kolesnik and Emilia Zingas featured in an interview with Apolo Ohno.",
          "Episode tied to the lead-up to the Winter Olympics.",
          "Framing/theme noted as “Built on trust.”",
          "Part of the Making Team USA series presented by Xfinity.",
          "Description includes calls to subscribe and follow Team USA across social platforms."
        ],
        "takeaways": [
          "Event-timed athlete content (Winter Olympics) can create predictable peaks in demand—plan capacity for promotional windows.",
          "Ensure CDN and streaming infrastructure are scaled for short-term spikes when episodic content is released around major events.",
          "Coordinate multi-platform delivery (YouTube plus social links) to maintain consistent performance and availability.",
          "Monitor engagement and telemetry during the episode release window to detect and mitigate issues quickly."
        ],
        "tags": [
          "figure-skating",
          "Vadym-Kolesnik",
          "Emilia-Zingas",
          "Apolo-Ohno",
          "Winter-Olympics",
          "Making-Team-USA",
          "Xfinity",
          "TeamUSA",
          "built-on-trust"
        ]
      }
    },
    {
      "id": "RalzsofAYHM",
      "title": "29-year-old spent $20,000 to open a store in New York — now it brings in $1.6 million a year",
      "channel": "CNBC Make It",
      "published_at": "2026-01-16T17:00:48.000Z",
      "url": "https://www.youtube.com/watch?v=RalzsofAYHM",
      "thumbnail": "https://i.ytimg.com/vi/RalzsofAYHM/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Abby Price launched Abbode while a Parsons grad student, selling dried floral arrangements on Facebook starting in 2019. By March 2022 she opened a Nolita storefront selling bouquets and home decor, used the shop’s cashflow to buy a $15,000 embroidery machine that sat in the basement for a year, and the business now brings in $1.6 million a year.",
        "bullets": [
          "Founded by Abby Price as a Parsons graduate student selling dried florals on Facebook in 2019.",
          "Opened a Nolita storefront by March 2022 offering bouquets and home decor.",
          "Shop cashflow funded a $15,000 embroidery machine purchased “on a whim.”",
          "The embroidery machine remained unused in the basement for a year.",
          "The business currently generates $1.6 million in annual revenue."
        ],
        "takeaways": [
          "Rapid online-to-brick-and-mortar growth can enable small businesses to fund significant capital purchases from operating cashflow.",
          "Capital equipment bought during expansion may sit underutilized for extended periods, affecting timing of any related infrastructure needs.",
          "Tracking local retail growth and capital expenditures can help inform short-term demand forecasting for urban infrastructure planners.",
          "High-revenue small businesses in dense neighborhoods can shift resource needs quickly as they scale from hobby to storefront operations."
        ],
        "tags": [
          "Abbode",
          "Abby Price",
          "Parsons",
          "dried flowers",
          "Nolita",
          "embroidery machine",
          "cashflow",
          "small business",
          "retail",
          "1.6M revenue"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the KPMG ON AIR podcast examines how AI is changing transfer pricing — from monitoring profitability and comparative analyses to automating documentation — and outlines how to adopt it in practice. Monika Palmowska and Jakub Roszkiewicz discuss AI as a tool to strengthen (not replace) tax advisors, integration with ERP and intelligent benchmarks, risks like data security and RODO, and practical first steps such as process organization and secure environments like Digital Gateway.",
        "bullets": [
          "AI applications in transfer pricing: profitability monitoring, benchmarking, and document automation.",
          "AI augments tax advisors' work but does not substitute professional judgment.",
          "Key risks: data privacy, security, and AI 'hallucinations' (incorrect outputs).",
          "Secure deployment options (e.g., Digital Gateway) and GDPR considerations are essential.",
          "Implementation starts with ordered processes, ERP integration, and developing staff competencies."
        ],
        "takeaways": [
          "Ensure secure, compliant infrastructure (e.g., controlled environments like Digital Gateway) before running AI workloads.",
          "Prioritize data governance and GDPR-aligned controls to mitigate privacy and security risks.",
          "Plan for ERP integration and reliable data pipelines to enable intelligent benchmarks and monitoring.",
          "Expect increased demand for compute, storage and controlled access as documentation and monitoring become automated.",
          "Start AI adoption by organizing processes and upskilling staff to maximize value and reduce operational risk."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "podatki",
          "transfer pricing",
          "automatyzacja",
          "RODO",
          "ERP",
          "bezpieczeństwo danych",
          "KPMG"
        ]
      }
    },
    {
      "id": "dGfcT63U7Mo",
      "title": "The 2026 U.S. Olympic Figure Skating Team 🇺🇸",
      "channel": "Team USA",
      "published_at": "2026-01-15T20:43:24.000Z",
      "url": "https://www.youtube.com/watch?v=dGfcT63U7Mo",
      "thumbnail": "https://i.ytimg.com/vi/dGfcT63U7Mo/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights the U.S. Olympic figure skating lineup. The post is presented in an enthusiastic tone, marked by a fire emoji and the #WinterOlympics tag.",
        "bullets": [
          "Announces the U.S. Olympic figure skating lineup.",
          "Tone is celebratory/enthusiastic (fire emoji).",
          "Includes the hashtag #WinterOlympics for event context."
        ],
        "takeaways": [
          "Tag and categorize this asset under Winter Olympics/figure skating for search and retrieval.",
          "Mark the content as event-related to prioritize inclusion in Olympic content collections.",
          "Use the #WinterOlympics tag to link with other event assets for coordinated delivery and metadata grouping."
        ],
        "tags": [
          "U.S. Olympic",
          "Figure Skating",
          "Lineup",
          "WinterOlympics",
          "Olympics",
          "Skating",
          "Team",
          "Sports"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The video encourages keeping momentum on workouts, projects, and personal goals by stacking small wins with Copilot. It positions Copilot as a companion for sustaining progress and motivation.",
        "bullets": [
          "Focus on stacking small wins to maintain momentum.",
          "Applies to workouts, projects, and personal goals.",
          "Positions Microsoft Copilot as a tool to help sustain progress.",
          "Emphasizes consistency and ongoing motivation.",
          "A short, motivational take on using Copilot for everyday goals."
        ],
        "takeaways": [
          "Small, consistent progress can help teams complete long-running projects more reliably—tools that reinforce momentum matter.",
          "For infrastructure leaders, encouraging incremental wins can reduce project fatigue and improve follow-through on ops tasks.",
          "Adopting assistants like Copilot for routine or repetitive work can free staff to focus on higher-impact tasks while maintaining steady progress.",
          "Promote workflows and tooling that make it easy to capture and celebrate small milestones to keep teams motivated."
        ],
        "tags": [
          "Copilot",
          "Microsoft",
          "momentum",
          "productivity",
          "small wins",
          "habits",
          "workouts",
          "projects",
          "personal goals",
          "motivation"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The video highlights how the Dell PowerEdge R770AP server, powered by Intel® Xeon® 6 processors, delivers the precision and speed required for high-frequency trading, enabling hundreds of trades in seconds to help maximize gains and minimize losses. It frames Intel Xeon 6 CPUs’ high-performance capabilities as shaping the future of finance.",
        "bullets": [
          "Focus on high-frequency trading where every second matters.",
          "Dell PowerEdge R770AP server featured as the hardware example.",
          "Powered by Intel® Xeon® 6 processors for high performance.",
          "Claims of enabling hundreds of trades in seconds to maximize gains and minimize losses.",
          "Positions Intel Xeon 6 CPUs as defining the future of finance."
        ],
        "takeaways": [
          "Prioritize low-latency, high-performance servers (e.g., Dell PowerEdge R770AP) for HFT workloads.",
          "Evaluate Intel Xeon 6-based systems when speed and precision directly impact trading outcomes.",
          "Infrastructure choices that reduce execution time can help maximize gains and minimize losses in finance environments."
        ],
        "tags": [
          "high-frequency-trading",
          "Intel-Xeon-6",
          "Dell-PowerEdge-R770AP",
          "low-latency",
          "finance",
          "data-center",
          "servers",
          "high-performance"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video says Copilot rekindled a lost creative spark and invites viewers to download and try it via the link in the bio. The clip is promotional and focused on encouraging users to experience Copilot for themselves.",
        "bullets": [
          "No transcript available; summary is drawn from the description.",
          "Core message: Copilot brought creativity back to life.",
          "Clear call to action: download Copilot and try it (link in bio).",
          "Promotional, user-trial focused messaging."
        ],
        "takeaways": [
          "The video frames Copilot as a tool to restore creativity—consider whether such a capability aligns with your team's workflow needs.",
          "A direct download call-to-action implies low-friction trial adoption; plan a short pilot to assess fit and impact.",
          "Marketing emphasizes user-driven exploration, so include hands-on evaluation and user feedback when assessing Copilot.",
          "If creativity or ideation support is a priority, prioritize an experiential trial to validate benefits before wider rollout."
        ],
        "tags": [
          "Copilot",
          "creativity",
          "download",
          "Microsoft",
          "AI assistant",
          "promotion",
          "link in bio",
          "trial"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This clip highlights Where Winds Meet, an open-world martial arts RPG showcased running with DLSS 4 and Multi Frame Generation. The video promotes experiencing the game with #RTXOn and credits @DigitalDreamsyt for the footage.",
        "bullets": [
          "Where Winds Meet is presented as an open-world martial arts RPG.",
          "Showcases DLSS 4 with Multi Frame Generation.",
          "Promoted with #RTXOn (RTX enabled).",
          "Video footage credited to @DigitalDreamsyt."
        ],
        "takeaways": [
          "The content highlights use of DLSS 4 with Multi Frame Generation — consider GPU and inference support for these features.",
          "RTX-enabled visuals (#RTXOn) imply a need for hardware that supports ray-tracing-capable workloads.",
          "Planning for capacity should account for AI-driven frame generation and high-performance graphics demands implied by these technologies."
        ],
        "tags": [
          "Where Winds Meet",
          "DLSS 4",
          "Multi Frame Generation",
          "RTXOn",
          "open-world",
          "martial arts",
          "NVIDIA GeForce",
          "DigitalDreamsyt"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This YouTube video is from Intel Business titled \"Taha Khalifa (Intel) | Intel Business\" and includes links to subscribe and to the Intel Business channel. The description frames Intel Business as a source of IT resources, guidance, and expert insights for projects spanning data centers to devices and provides links to the website and social channels.",
        "bullets": [
          "No transcript is available for this video.",
          "Subscribe link and channel URL are provided.",
          "Intel Business described as a resource for IT projects from data centers to devices.",
          "Connect links included: Intel Business website, X (Twitter), LinkedIn, and Facebook."
        ],
        "takeaways": [
          "Intel Business is positioned as a go-to source for guidance and expert insights relevant to data center decision-makers.",
          "Visit the Intel Business website for additional resources and project-focused information.",
          "Follow or subscribe to Intel Business on social channels to receive updates and practical IT guidance.",
          "Use the channel as a starting point to find Intel-led content that may support data center planning and execution."
        ],
        "tags": [
          "Intel",
          "Intel Business",
          "Taha Khalifa",
          "data center",
          "IT",
          "IT projects",
          "technology",
          "YouTube",
          "business",
          "resources"
        ]
      }
    },
    {
      "id": "kSocjh8PZnQ",
      "title": "Rynek dóbr luksusowych w obliczu transformacji | Andrzej Marczak, Tomasz Wiśniewski",
      "channel": "KPMG Poland",
      "published_at": "2026-01-13T10:23:31.000Z",
      "url": "https://www.youtube.com/watch?v=kSocjh8PZnQ",
      "thumbnail": "https://i.ytimg.com/vi/kSocjh8PZnQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The KPMG ON AIR podcast episode examines current trends shaping the luxury goods market in Poland and globally, such as experience-driven consumption, ESG, and the rise of \"affordable luxury.\" KPMG experts discuss market structure (top 2% account for 40% of the market), personalization, Gen Z preferences, luxury tourism and art, and future themes including AI, craftsmanship and the human dimension.",
        "bullets": [
          "Global trends: \"luxury fatigue\" and a concentrated market where 2% of clients drive 40% of sales.",
          "Shift from ownership to experiences, with strong emphasis on personalization and \"affordable luxury.\"",
          "ESG and responsible luxury gain importance (e.g., eco-leathers, certifications).",
          "Poland’s market is still growing but remains fragmented; luxury tourism, hotels and the art market are highlighted.",
          "Future outlook includes AI alongside craftsmanship and human-centered experiences."
        ],
        "takeaways": [
          "AI is cited as part of luxury's future — consider capacity planning for AI/ML workloads and related storage needs.",
          "ESG focus implies demand for low-carbon power and sustainability credentials for infrastructure providers.",
          "Growth in Poland and luxury tourism suggests rising local demand for reliable, low-latency digital services.",
          "Personalization and high-value client experiences underline the need for secure, high-availability systems and fast processing.",
          "Concentration of value among top clients means infrastructure resilience and strong security are critical for supporting premium transactions."
        ],
        "tags": [
          "luksus",
          "Polska",
          "ESG",
          "AI",
          "personalizacja",
          "turystyka-luksusowa",
          "rynek-sztuki",
          "affordable-luxury",
          "KPMG"
        ]
      }
    }
  ]
}