{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-23T05:03:31.831Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI in audit is presented as a current, practical toolkit at KPMG, with solutions like AI Transaction Scoring, Clara AI assistants and the KPMG Clara platform enabling full-population analysis, real‑time audit management and improved client communication. The hosts outline benefits for clients, changing auditor roles, required new competencies and challenges around data security, regulation and AI-related risks.",
        "bullets": [
          "AI automates repetitive audit tasks and supports analysis of large datasets and full populations.",
          "AI Transaction Scoring and Clara AI (conversational assistants and specialized agents) aid documentation, disclosure analysis and decision-making.",
          "KPMG Clara platform enables real‑time audit management; Clara for Clients modernizes client communication.",
          "Shift from sampling to full-population analysis is changing auditors' roles and skill requirements.",
          "Key implementation issues include data security, regulatory environment and potential AI risks."
        ],
        "takeaways": [
          "Budget for scalable, secure compute and storage to handle AI-driven, full-population audit workloads.",
          "Strengthen data governance, privacy controls and compliance processes to meet auditors' security and regulatory expectations.",
          "Ensure integration capabilities (APIs, secure channels) to support platforms like Clara for Clients and real‑time collaboration.",
          "Invest in upskilling staff to work alongside AI tools and adapt to evolving audit roles and workflows."
        ],
        "tags": [
          "AI",
          "audit",
          "KPMG Clara",
          "full-population analysis",
          "data security",
          "audit innovation",
          "auditor skills",
          "client communication"
        ]
      }
    },
    {
      "id": "6hu7hYLiu08",
      "title": "Get Step-By-Step Fixes with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-21T20:14:00.000Z",
      "url": "https://www.youtube.com/watch?v=6hu7hYLiu08",
      "thumbnail": "https://i.ytimg.com/vi/6hu7hYLiu08/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Copilot provides real-time visual assistance for home projects and repairs. It can \"see what you see\" and deliver step-by-step instructions with clear guidance for issues like leaky pipes and overflowing washing machines.",
        "bullets": [
          "Real-time support for home projects and repairs.",
          "Copilot uses visual input—\"sees what you see.\"",
          "Delivers step-by-step instructions.",
          "Examples include leaky pipes and overflowing washing machines.",
          "Emphasizes clear, actionable guidance."
        ],
        "takeaways": [
          "If applied in facilities, visual, real-time guidance could speed on-site troubleshooting.",
          "Step-by-step instructions may help standardize repair procedures and reduce errors.",
          "Remote visual assistance could support less-experienced technicians and accelerate training.",
          "Clear guidance has potential to reduce mean time to repair and improve equipment availability."
        ],
        "tags": [
          "Copilot",
          "real-time support",
          "visual assistance",
          "step-by-step",
          "home repairs",
          "troubleshooting",
          "maintenance",
          "DIY",
          "Microsoft Copilot",
          "guidance"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Arknights: Endfield has officially launched and the trailer highlights NVIDIA DLSS 4 with Multi Frame Generation. The footage was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 Multi Frame Generation 4X Mode, and the game is described as a 3D real-time strategy RPG where players act as the Endministrator exploring Talos-II.",
        "bullets": [
          "Official launch of Arknights: Endfield, a 3D real-time strategy RPG.",
          "Trailer showcases NVIDIA DLSS 4 with Multi Frame Generation (MFG).",
          "Captured on GeForce RTX 5080 at 4K Ultra with DLSS 4 MFG 4X Mode.",
          "Developer/publisher links and social channels provided (official site and social accounts).",
          "Video published on NVIDIA GeForce’s channel with link to DLSS 4 article."
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is shipping in a retail title—evaluate DLSS 4 support for any cloud-gaming or real-time-rendering deployments.",
          "Trailer capture used a GeForce RTX 5080 at 4K Ultra (MFG 4X), so delivering equivalent visual settings may require RTX 50-series class GPUs.",
          "Check NVIDIA’s DLSS 4 documentation and driver/SDK compatibility (link provided in description) before integration into production streaming or visualization pipelines."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "RTX5080",
          "NVIDIA",
          "4K",
          "RTS",
          "GeForce",
          "DLSS"
        ]
      }
    },
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video shows how Rate Insurance boosts agent efficiency using Agentforce and Gemini within the context of the Google Cloud and Salesforce partnership. Viewers are directed to a link to learn more about the partnership.",
        "bullets": [
          "Showcases Rate Insurance using Agentforce and Gemini to improve agent efficiency.",
          "Highlights collaboration between Google Cloud and Salesforce.",
          "Acts as a product/solution showcase focused on agent workflows.",
          "Directs viewers to a partnership link for more information."
        ],
        "takeaways": [
          "Consider the role of cloud-hosted customer-service solutions (e.g., Agentforce and Gemini) when planning infrastructure and capacity.",
          "Evaluate vendor partnerships—like Google Cloud + Salesforce—early to inform integration and lifecycle planning.",
          "Use the provided partnership link to collect technical and commercial details before procurement decisions.",
          "Engage business stakeholders to quantify expected agent-efficiency gains prior to scaling resources."
        ],
        "tags": [
          "Rate Insurance",
          "Agentforce",
          "Gemini",
          "Google Cloud",
          "Salesforce",
          "agent efficiency",
          "cloud partnership",
          "customer service",
          "insurance tech",
          "product demo"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Charly Stoever, 35, is a financial coach who lives rent-free in Portland by pet sitting full time. Over the past 18 months she has lived out of two suitcases and brings in about $60,000 a year, as profiled in CNBC Make It's Millennial Money series.",
        "bullets": [
          "Charly Stoever, 35 — financial coach and full-time pet sitter.",
          "Lives rent-free in Portland through pet sitting.",
          "Has lived out of two suitcases for the last 18 months.",
          "Earns approximately $60,000 per year from pet sitting.",
          "Profile appears in CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "Profile documents a sustained income ($60K/yr) paired with a highly mobile, low–fixed-residence lifestyle — useful as a data point when assessing residential demand patterns.",
          "The described lifestyle reduces reliance on permanent housing, which could be considered when modeling localized energy consumption trends.",
          "This example highlights alternative work/living arrangements to include in user-segmentation for service and capacity planning."
        ],
        "tags": [
          "pet-sitting",
          "rent-free",
          "financial-coach",
          "minimalist",
          "digital-nomad",
          "Portland",
          "CNBCMakeIt",
          "MillennialMoney"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This giant carbon dioxide \"bubble\" battery stores about 20 megawatts of power and provides roughly 8 hours of energy. The technology is presented as a way to manage fluctuating renewable generation and help enable a global shift to clean energy.",
        "bullets": [
          "Battery uses a large CO2 \"bubble\" as the storage medium.",
          "Stores approximately 20 megawatts of capacity.",
          "Provides about 8 hours of energy storage.",
          "Aimed at mitigating renewable energy variability.",
          "Positioned as a tool to support a global transition to clean energy."
        ],
        "takeaways": [
          "20 MW × ~8 hours offers a long-duration option that can buffer multi-hour renewable shortfalls—relevant for grid balancing and large-site backup.",
          "Technology targets the intermittent nature of renewables, so it could help reduce curtailment and firm up clean generation.",
          "Carbon-dioxide-based storage may align with decarbonization goals while expanding storage options.",
          "Decision-makers should compare the 20 MW/8-hour scale to site needs and request further technical, cost, and integration details (not provided in the description)."
        ],
        "tags": [
          "ieee",
          "tech",
          "energy-storage",
          "CO2",
          "carbon-dioxide",
          "battery",
          "renewables",
          "clean-energy",
          "8-hour-storage"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… W podcaście KPMG ON AIR eksperci Monika Palmowska i Jakub Roszkiewicz omawiają, jak AI już zmienia podejście do cen transferowych — m.in. monitorowanie rentowności, benchmarki i automatyzacja dokumentacji — oraz dlaczego technologia powinna wspierać, a nie zastępować doradców podatkowych. Poruszono też ryzyka i wymagania wdrożeniowe: bezpieczeństwo danych, RODO, halucynacje AI, integracja z ERP, Digital Gateway oraz konieczność uporządkowania procesów i rozwoju kompetencji pracowników.",
        "bullets": [
          "AI wspiera monitorowanie rentowności, analizy porównawcze i automatyzację dokumentacji cen transferowych.",
          "Eksperci podkreślają, że AI wzmocni pracę doradców, ale ich nie zastąpi.",
          "Główne ryzyka to dane i bezpieczeństwo, RODO oraz zjawisko halucynacji AI.",
          "Rozwiązania warto wdrażać przez bezpieczne środowiska (Digital Gateway) i integrację z ERP.",
          "Pierwsze kroki to uporządkowanie procesów, budowa kompetencji i definiowanie person."
        ],
        "takeaways": [
          "Zadbaj o bezpieczne środowisko (np. Digital Gateway) i zgodność z RODO przed przetwarzaniem danych AI.",
          "Upewnij się, że AI integruje się z istniejącymi systemami ERP, by uzyskać wartościowe, inteligentne benchmarki.",
          "Przed wdrożeniem uporządkuj procesy i role — to fundament skutecznej transformacji AI.",
          "Planuj szkolenia i rozwój kompetencji młodszych pracowników, bo AI ma wspierać ich pracę.",
          "Oceń ryzyka związane z jakością danych i potencjalnymi halucynacjami modeli przy automatyzacji dokumentacji."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "podatki",
          "monitorowanie rentowności",
          "dokumentacja",
          "bezpieczeństwo danych",
          "RODO",
          "ERP",
          "Digital Gateway",
          "KPMG"
        ]
      }
    }
  ]
}