{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-20T20:36:49.713Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this Google Cloud video showcases how Rate Insurance boosts agent efficiency using Agentforce and Gemini and points viewers to the Google Cloud–Salesforce partnership. The description links to more information about that partnership and invites viewers to watch the case study.",
        "bullets": [
          "Google Cloud video demonstrating Rate Insurance's use of Agentforce and Gemini to improve agent efficiency.",
          "Description includes a link to learn more about the Google Cloud and Salesforce partnership.",
          "Presented as a case study viewers are encouraged to watch.",
          "No transcript is available for the video."
        ],
        "takeaways": [
          "Consider vendor partnerships (Google Cloud + Salesforce) when evaluating platform compatibility and vendor-managed integrations.",
          "Ensure infrastructure and networking can support integrations referenced (Agentforce, Gemini) when planning deployments.",
          "Factor in scalability and support requirements for productivity tools used by customer-facing agents.",
          "Include partnership-driven solutions in procurement and architecture discussions to streamline deployment and support."
        ],
        "tags": [
          "Google Cloud",
          "Salesforce",
          "Rate Insurance",
          "Agentforce",
          "Gemini",
          "agent efficiency",
          "partnership",
          "case study",
          "cloud integration",
          "customer service"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Charly Stoever, 35, is a financial coach who has lived rent-free in Portland, Oregon by pet sitting full time while traveling with two suitcases for the past 18 months. She earns about $60,000 a year from this lifestyle, which is profiled in CNBC Make It's Millennial Money series.",
        "bullets": [
          "Charly Stoever lives rent-free in Portland by pet sitting full time.",
          "She has been living out of two suitcases while traveling for 18 months.",
          "Her pet-sitting work brings in approximately $60,000 annually.",
          "Profiled by CNBC Make It as part of the Millennial Money series.",
          "Video production credits include producer Lauren Shamo and reporter Ryan Ermey."
        ],
        "takeaways": [
          "So what: Mobile, location-independent earners like Charly create demand for reliable on-the-go connectivity and services.",
          "So what: Transient living arrangements can alter local residential energy and capacity patterns that planners may need to account for.",
          "So what: Supporting a dispersed, mobile user base points to value in distributed/edge infrastructure and flexible capacity planning.",
          "So what: Nontraditional income streams increase reliance on remote-access platforms and uptime, reinforcing the need for resilient systems."
        ],
        "tags": [
          "pet sitting",
          "rent-free",
          "financial coach",
          "travel",
          "minimalism",
          "financial independence",
          "CNBC Make It",
          "Millennial Money"
        ]
      }
    },
    {
      "id": "wicD8G0rn1Y",
      "title": "New: AWS Lambda tenant isolation | Serverless Office Hours",
      "channel": "AWS Events",
      "published_at": "2026-01-20T15:40:24.000Z",
      "url": "https://www.youtube.com/watch?v=wicD8G0rn1Y",
      "thumbnail": "https://i.ytimg.com/vi/wicD8G0rn1Y/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AWS Lambda's new tenant isolation mode provides dedicated execution environments per tenant so cached data and execution contexts remain siloed and avoid cross-tenant data exposure. The session covers implementing robust security boundaries while reducing infrastructure complexity, enabling faster scaling during traffic spikes, and shows built-in monitoring with automatic tenant identifier logging to ease tenant-specific debugging.",
        "bullets": [
          "Dedicated execution environments per tenant to keep cached data and execution contexts siloed",
          "Prevents cross-tenant data exposure by enforcing stronger isolation guarantees",
          "Reduces infrastructure complexity while enabling robust security boundaries",
          "Enables faster scaling during traffic spikes",
          "Built-in monitoring with automatic tenant identifier logging for easier tenant-specific debugging"
        ],
        "takeaways": [
          "Stronger isolation lowers risk of cross-tenant data exposure — a key security requirement for multi-tenant SaaS",
          "Simplified infrastructure can reduce operational complexity and management overhead for hosted services",
          "Faster scaling during spikes improves capacity planning and service reliability under variable loads",
          "Automatic tenant identifier logging helps speed troubleshooting and supports tenant-level auditing/compliance"
        ],
        "tags": [
          "AWS",
          "AWS Lambda",
          "tenant isolation",
          "serverless",
          "multi-tenant",
          "SaaS",
          "security",
          "monitoring",
          "scaling",
          "provisioned-mode"
        ]
      }
    },
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Dr. Anna Chacon is a 39-year-old dermatologist in Miami who runs her own private practice. Her net worth is about $6 million, made up of $3.2 million in investments, a $1.9 million home, and a $1.1 million office building.",
        "bullets": [
          "Age: 39",
          "Location: Miami, FL",
          "Profession: Dermatologist with a private practice",
          "Estimated net worth: ~$6 million",
          "Net worth breakdown: $3.2M investments, $1.9M home, $1.1M office building"
        ],
        "takeaways": [
          "Private medical practices that own office buildings could represent local customers for colocation or managed IT services.",
          "High-net-worth professionals with significant investments and property may prioritize secure, reliable data backup and financial-record storage.",
          "A regional presence (home, practice, office) suggests opportunities for low-latency, regionally focused hosting and redundancy services.",
          "Targeting affluent professionals could justify premium, value-added offerings tailored to small-business owners in healthcare."
        ],
        "tags": [
          "dermatologist",
          "private practice",
          "Miami",
          "net worth",
          "investments",
          "real estate",
          "office building",
          "personal finance",
          "wealth",
          "Dr Anna Chacon"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights a giant carbon dioxide \"bubble\" battery that can store 20 megawatts of power and provides about 8 hours of energy. The system is presented as a multi‑hour storage solution to help manage renewable energy variability and support the global shift to clean energy.",
        "bullets": [
          "Device is a large carbon dioxide bubble used as an energy storage medium.",
          "Stores 20 megawatts of power with approximately 8 hours of energy capacity.",
          "Targets the intermittency of renewable energy sources.",
          "Framed as enabling the transition to clean energy worldwide.",
          "Presented by IEEE Spectrum (video details only; no transcript available)."
        ],
        "takeaways": [
          "20 MW / 8-hour capacity indicates potential for multi‑hour backup or load-shifting applications.",
          "Designed to address renewable variability, so it could help integrate higher shares of wind and solar.",
          "May be relevant for planners evaluating options for long-duration storage to improve grid or data center resiliency."
        ],
        "tags": [
          "co2",
          "carbon-dioxide",
          "energy-storage",
          "battery",
          "renewable-energy",
          "grid",
          "innovation",
          "ieee",
          "tech"
        ]
      }
    },
    {
      "id": "OINppmPan0o",
      "title": "Figure Skating | Making Team USA presented by Xfinity with Apolo Ohno",
      "channel": "Team USA",
      "published_at": "2026-01-16T19:30:36.000Z",
      "url": "https://www.youtube.com/watch?v=OINppmPan0o",
      "thumbnail": "https://i.ytimg.com/vi/OINppmPan0o/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Figure skating duo Vadym Kolesnik and Emilia Zingas sit down with Apolo Ohno on this episode of Making Team USA presented by Xfinity ahead of the Winter Olympics. The episode emphasizes their partnership and the role of trust in their Olympic preparation.",
        "bullets": [
          "Vadym Kolesnik and Emilia Zingas are featured together on the episode.",
          "Apolo Ohno hosts the conversation with the skating duo.",
          "The episode is part of Making Team USA presented by Xfinity and released by Team USA.",
          "A central theme highlighted is that the partnership is “built on trust.”",
          "The description includes links to subscribe and follow Team USA across social platforms."
        ],
        "takeaways": [
          "Trust and strong partnerships matter—prioritize reliable collaboration when coordinating complex operations.",
          "Ahead-of-event preparation is key—plan resources and contingencies for major, predictable demand spikes.",
          "Use personal stories and profiles to engage stakeholders and communicate readiness or performance goals."
        ],
        "tags": [
          "FigureSkating",
          "VadymKolesnik",
          "EmiliaZingas",
          "ApoloOhno",
          "MakingTeamUSA",
          "Xfinity",
          "WinterOlympics",
          "TeamUSA",
          "Trust",
          "AthleteProfile"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The podcast discusses how AI is changing transfer pricing—enabling monitoring of profitability, comparative analyses and automation of documentation—while exploring practical implementation, integration with ERP, and future use cases. KPMG experts Monika Palmowska and Jakub Roszkiewicz emphasize that AI will strengthen rather than replace tax advisors and highlight risks (data, security, RODO, hallucinations) and initial steps for adoption.",
        "bullets": [
          "AI applications in transfer pricing: profitability monitoring, intelligent benchmarks and automated documentation",
          "AI as a tool to augment, not replace, tax advisors",
          "Implementation topics: integration with ERP, persona-driven approaches and first steps to deploy AI",
          "Risks and compliance: data security, GDPR/RODO concerns and model hallucinations",
          "Secure environments (Digital Gateway) and process organization as foundations for AI rollout"
        ],
        "takeaways": [
          "Consider AI to monitor profitability and benchmarking of intercompany services to improve pricing visibility",
          "Automating transfer pricing documentation can reduce manual effort and speed compliance workflows",
          "Ensure secure, compliant environments (e.g., Digital Gateway) and address GDPR/data-security requirements before deployment",
          "Plan ERP integration for intelligent benchmarks and analytics to get actionable insights from AI",
          "Begin with process cleanup and staff upskilling as foundational steps for successful AI adoption"
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "podatki",
          "transfer-pricing",
          "automatyzacja",
          "ERP",
          "RODO",
          "bezpieczeństwo",
          "KPMG",
          "Digital Gateway"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Microsoft Copilot is framed as a way to keep momentum by stacking small wins across activities like workouts, projects, and personal goals. The emphasis is on sustaining progress through a sequence of achievable steps with Copilot's support.",
        "bullets": [
          "Focuses on maintaining momentum through incremental progress",
          "Applies to workouts, projects, and personal goals",
          "Encourages stacking small, achievable wins",
          "Positions Copilot as an assisting tool for ongoing progress",
          "Aims to keep users moving forward rather than tackling everything at once"
        ],
        "takeaways": [
          "Break large data center or grid projects into smaller milestones to preserve momentum and visibility.",
          "Use a ‘small wins’ approach to drive steady operational improvements and reduce project fatigue.",
          "Apply Copilot as an aid for coordinating incremental tasks, training steps, and routine workflows.",
          "Celebrate and track incremental progress to maintain team morale and sustain long-term initiatives."
        ],
        "tags": [
          "Microsoft Copilot",
          "small wins",
          "momentum",
          "productivity",
          "workouts",
          "projects",
          "personal goals",
          "habit building",
          "motivation"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The video highlights how the Dell PowerEdge R770AP server, powered by Intel® Xeon® 6 processors, accelerates high-frequency trading by executing hundreds of trades in seconds to help maximize gains and minimize losses. It positions Intel Xeon 6 CPUs' high-performance capabilities as shaping the future of finance.",
        "bullets": [
          "Focus on high-frequency trading where speed and precision are critical.",
          "Showcases Dell PowerEdge R770AP with Intel® Xeon® 6 processors.",
          "Claims the setup can perform hundreds of trades in seconds.",
          "Emphasizes maximizing gains and minimizing losses via performance.",
          "Promoted by Intel Business with links to additional resources."
        ],
        "takeaways": [
          "High-frequency trading workloads demand low-latency, high-performance servers.",
          "Evaluate Dell PowerEdge R770AP paired with Intel Xeon 6 CPUs for HFT use cases.",
          "Choosing the right CPU/platform can directly impact trade execution speed and financial outcomes.",
          "Leverage Intel Business resources for guidance on deploying finance-focused infrastructure."
        ],
        "tags": [
          "high-frequency-trading",
          "HFT",
          "Intel Xeon 6",
          "PowerEdge R770AP",
          "low-latency",
          "finance",
          "data-center",
          "Intel Business",
          "Dell"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the short clip says the creative spark was gone and Copilot brought it back to life. It ends with a call to action to download Copilot and try it via the link in bio.",
        "bullets": [
          "Message: Copilot revived lost creativity.",
          "Clear call to action to download and try Copilot.",
          "Promotion is short and focused on inspiration.",
          "No transcript is available for the video."
        ],
        "takeaways": [
          "Consider a hands-on trial of Copilot (via the provided link) to evaluate its impact on creative workflows before wider adoption.",
          "Pilot results could inform software procurement and licensing decisions related to productivity/creative tools.",
          "Assess integration and user adoption effort if Copilot proves beneficial for content-creation teams.",
          "Use short promotional trials as a low-cost way to validate vendor claims about creativity/productivity improvements."
        ],
        "tags": [
          "Copilot",
          "AI",
          "creativity",
          "download",
          "link-in-bio",
          "try-now",
          "Microsoft",
          "promotion",
          "creative-tools",
          "inspiration"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this NVIDIA GeForce clip highlights the open-world martial arts RPG Where Winds Meet running with RTX On and DLSS 4 with Multi Frame Generation. The short description credits @DigitalDreamsyt as the source and no transcript is available.",
        "bullets": [
          "Open-world martial arts RPG: Where Winds Meet",
          "Showcases DLSS 4 with Multi Frame Generation",
          "Presented with #RTXOn (ray-tracing enabled)",
          "Video credited to @DigitalDreamsyt"
        ],
        "takeaways": [
          "The video spotlights DLSS 4 with Multi Frame Generation—consider supporting hardware that enables DLSS 4 for demos and streaming workloads.",
          "RTX On content implies need for GPUs with ray-tracing capabilities when hosting or showcasing similar titles.",
          "Ensure software stacks and drivers are compatible with DLSS 4 and related SDKs to reproduce these visuals in cloud or demo environments.",
          "Coordinate with content creators (credit shown) when sourcing assets or footage for promotional/benchmarking purposes."
        ],
        "tags": [
          "WhereWindsMeet",
          "DLSS4",
          "MultiFrameGeneration",
          "RTXOn",
          "NVIDIA",
          "DigitalDreamsyt",
          "open-world",
          "martial-arts",
          "gaming",
          "GeForce"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This video is from Intel Business and is titled \"Taha Khalifa (Intel) | Intel Business.\" The Intel Business channel provides IT resources, guidance, and expert insights covering topics from data centers to devices and includes links to subscribe and connect on multiple platforms.",
        "bullets": [
          "Title/speaker: Taha Khalifa (Intel) on the Intel Business channel.",
          "Intel Business offers resources, guidance, and expert insights for IT projects across data centers and devices.",
          "Subscribe link provided to follow the channel for more content.",
          "Connect via Intel Business website, X (Twitter), LinkedIn, and Facebook—links included in the description.",
          "Video published on 2026-01-14."
        ],
        "takeaways": [
          "Intel Business is a centralized source for guidance and expert insights that can support data center planning and operations.",
          "Decision-makers should use the Intel Business website and social channels to access up-to-date IT resources and guidance.",
          "Subscribing to the channel helps ensure timely access to Intel’s IT-focused content relevant for grid and data center projects."
        ],
        "tags": [
          "Intel",
          "IntelBusiness",
          "TahaKhalifa",
          "data center",
          "IT",
          "devices",
          "ITresources",
          "YouTube",
          "business",
          "technology"
        ]
      }
    }
  ]
}