{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-27T15:51:26.541Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "azzmtqcIeCU",
      "title": "AWS Cost Efficiency Metrics I The Keys to AWS Optimization | S16 E2",
      "channel": "AWS Events",
      "published_at": "2026-01-27T10:14:44.000Z",
      "url": "https://www.youtube.com/watch?v=azzmtqcIeCU",
      "thumbnail": "https://i.ytimg.com/vi/azzmtqcIeCU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This livestream examines the key KPIs that drive AWS cost efficiency, including cost per transaction, resource utilization rates, and ROI calculations. It explains how to measure, track, benchmark, and communicate cloud cost and performance metrics to identify optimization opportunities and align technical performance with business outcomes.",
        "bullets": [
          "Defines essential AWS cost-efficiency KPIs: cost per transaction, utilization, ROI.",
          "Shows practical approaches to measuring and tracking those metrics.",
          "Covers benchmarking methods to spot optimization opportunities.",
          "Explains building dashboards to communicate value to stakeholders.",
          "Aimed at cloud engineers, FinOps teams, and technical leaders."
        ],
        "takeaways": [
          "Track cost-per-transaction to compare workload economics and prioritize consolidation or migration.",
          "Measure resource utilization rates to reveal underused capacity and guide rightsizing or decommissioning.",
          "Use ROI calculations to justify investments in optimization tools or automation to stakeholders.",
          "Benchmarking helps set realistic efficiency targets and identify high-impact optimization areas.",
          "Dashboards that link technical metrics to business outcomes make it easier to secure budget and executive buy-in."
        ],
        "tags": [
          "AWS",
          "CloudCosts",
          "FinOps",
          "CostOptimization",
          "CloudMetrics",
          "AWSCostManagement",
          "CloudEfficiency",
          "KPIs"
        ]
      }
    },
    {
      "id": "9vS5kvxbPMQ",
      "title": "My Porta-Potty Business Brings In $4.3M/Year",
      "channel": "CNBC Make It",
      "published_at": "2026-01-24T15:00:30.000Z",
      "url": "https://www.youtube.com/watch?v=9vS5kvxbPMQ",
      "thumbnail": "https://i.ytimg.com/vi/9vS5kvxbPMQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Daniel Tom, 31, owns and operates Bay Area Sanitation, which runs a fleet of almost 2,000 portable toilets servicing construction sites and events across the San Francisco Bay Area. The company reported $4.3 million in total income in 2025.",
        "bullets": [
          "Owner: Daniel Tom, 31",
          "Company: Bay Area Sanitation",
          "Fleet size: almost 2,000 portable toilets",
          "Service area: construction sites and events in the San Francisco Bay Area",
          "2025 total income: $4.3 million"
        ],
        "takeaways": [
          "A vendor managing ~2,000 distributed units represents a sizeable logistics and maintenance operation that facilities teams may evaluate for large on-site service needs.",
          "The $4.3M 2025 income indicates substantial market demand for portable sanitation services in a major metro area.",
          "A locally focused provider in the San Francisco Bay Area could offer region-specific coverage and responsiveness for facility or event support requirements."
        ],
        "tags": [
          "Daniel Tom",
          "Bay Area Sanitation",
          "portable toilets",
          "sanitation",
          "small business",
          "2025 revenue",
          "construction services",
          "event services",
          "CNBC Make It"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Jo discovers the power of Copilot Groups and demonstrates that route planning is made easy. The short video highlights Copilot's route-planning capabilities and includes hashtags #copilot, #microsoftcopilot, and #ai.",
        "bullets": [
          "Route planning made easy, per the description.",
          "Jo discovers and showcases Copilot Groups.",
          "Focus is on Copilot Groups as a feature.",
          "Description includes #copilot, #microsoftcopilot, and #ai."
        ],
        "takeaways": [
          "If Copilot Groups simplifies route planning, grid/data center teams could improve field crew routing and reduce travel time.",
          "Easier route planning could help coordinate maintenance and emergency response logistics for distributed infrastructure.",
          "Decision-makers should consider piloting Copilot Groups for routing workflows to assess operational impact and efficiency gains."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "route-planning",
          "copilot-groups",
          "Jo"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Podcast KPMG ON AIR z Katarzyną Chojniak i Alicją Barską omawia praktyczne zastosowania AI w audycie, w tym narzędzia do analizowania pełnych populacji danych, konwersacyjne asystenty (Clara AI) i platformę KPMG Clara do zarządzania badaniem w czasie rzeczywistym. Rozmowa porusza też wpływ technologii na rolę audytora, kluczowe kompetencje, wyzwania wdrożeniowe, bezpieczeństwo danych, regulacje oraz potencjalne zagrożenia i przyszłość AI w audycie.",
        "bullets": [
          "AI wspiera powtarzalne czynności i analizę dużych zbiorów danych w audycie.",
          "AI Transaction Scoring Tool umożliwia analizę pełnych populacji zamiast próbkowania.",
          "Clara AI to konwersacyjny asystent i agenci wyspecjalizowani wspomagający audytorów.",
          "Platforma KPMG Clara pozwala na zarządzanie badaniem i komunikację z klientem w czasie rzeczywistym.",
          "Omówione są też wyzwania: adaptacja audytorów, bezpieczeństwo danych, środowisko regulacyjne i potencjalne zagrożenia AI."
        ],
        "takeaways": [
          "Pełna analiza populacji danych zwiększa przejrzystość i może skrócić czas potrzebny na wykrywanie anomalii — warto przygotować infrastrukturę danych do takiej analizy.",
          "Real‑time audit management (np. KPMG Clara) umożliwia szybszą wymianę informacji z audytorem — zwiększ dostępność i jakość danych dla bieżącego monitoringu.",
          "Wdrażając AI, priorytetem są zabezpieczenia danych i zgodność z regulacjami — wprowadź silne mechanizmy ochrony i audytu dostępu.",
          "Rola audytora przesuwa się w stronę nadzoru nad narzędziami i interpretacji wyników — inwestuj w szkolenia technologiczne i kompetencje analityczne zespołów.",
          "Potencjalne ryzyka AI wymagają wdrożenia kontroli governance i ocen ryzyka technologicznego przed szerokim zastosowaniem rozwiązań."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMG Clara",
          "Clara AI",
          "analiza danych",
          "bezpieczeństwo danych",
          "automatyzacja",
          "kompetencje",
          "regulacje"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield has officially launched and the trailer highlights support for NVIDIA DLSS 4 with Multi Frame Generation. The 3D real-time strategy RPG puts you in the role of the Endministrator on Talos-II, and the footage was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 MFG 4X Mode.",
        "bullets": [
          "Official launch of Arknights: Endfield, a 3D real-time strategy RPG.",
          "Trailer emphasizes NVIDIA DLSS 4 with Multi Frame Generation.",
          "Captured on GeForce RTX 5080 at 4K Ultra, DLSS 4 MFG 4X Mode.",
          "Player role: Endministrator of Endfield Industries across Talos-II.",
          "Description includes links to the game site and official social channels."
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is being used in shipping titles—consider supporting AI-driven frame synthesis in GPU infrastructure planning.",
          "Footage captured on an RTX 5080 at 4K Ultra indicates demand for high-performance GPUs for real-time 4K rendering workloads.",
          "Cloud gaming and streaming providers should assess GPU capacity and latency requirements to accommodate launches leveraging advanced frame-generation tech.",
          "Evaluate AI inference and real-time rendering support in server deployments to enable similar generative graphics features."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "RTX5080",
          "4K",
          "GameLaunch",
          "RealTimeRPG",
          "NVIDIA",
          "GeForce",
          "CloudGaming"
        ]
      }
    }
  ]
}