{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-31T07:47:23.895Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "6B29VDvPPzc",
      "title": "Build Knowledge Graph-powered AI Agents For Your Use Case | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-31T06:10:50.000Z",
      "url": "https://www.youtube.com/watch?v=6B29VDvPPzc",
      "thumbnail": "https://i.ytimg.com/vi/6B29VDvPPzc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this session demonstrates how to automatically build a knowledge graph from raw documents and connect it to an AI agent so the agent can understand your company's data. The presenters build the solution end-to-end and emphasize that no prior graph expertise is required.",
        "bullets": [
          "Automatic construction of a knowledge graph from raw documents.",
          "Integration of the graph with an AI agent so it understands company-specific information.",
          "No need to learn graph queries or graph theory.",
          "End-to-end live build/demonstration.",
          "Links to a related episode comparing VectorDB vs GraphDB for Gen AI agents."
        ],
        "takeaways": [
          "Makes proprietary operational and asset data accessible to AI agents, improving decision support.",
          "Automation reduces the need for specialized graph expertise and lowers integration overhead.",
          "End-to-end approach can shorten deployment timelines for enterprise AI initiatives.",
          "Helps mitigate AI misunderstandings of internal systems by grounding agents in corporate data."
        ],
        "tags": [
          "knowledge-graph",
          "AI-agents",
          "enterprise-AI",
          "graph-database",
          "vector-database",
          "automation",
          "document-ingestion",
          "AWS-events"
        ]
      }
    },
    {
      "id": "z-X9MYi1Rr0",
      "title": "Leveraging tax credits and incentives for sustainability projects",
      "channel": "PwC US",
      "published_at": "2026-01-30T13:27:25.000Z",
      "url": "https://www.youtube.com/watch?v=z-X9MYi1Rr0",
      "thumbnail": "https://i.ytimg.com/vi/z-X9MYi1Rr0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Randa Barsoum, Tax Partner at PwC US, highlights that energy incentives are only part of the tax picture for sustainability projects and points to less obvious opportunities such as state and local abatements, location-based incentives, and R&D tax credits tied to innovation like reimagining packaging or processes. The core message: viewing sustainability investments through a broader tax lens can unlock meaningful tax value for businesses.",
        "bullets": [
          "Energy incentives are common but not the only tax opportunities for sustainability.",
          "State and local abatements and location-based incentives can support projects.",
          "R&D tax credits may apply to innovation efforts (e.g., new packaging or process changes).",
          "A broader tax-focused view of sustainability investments can create added value.",
          "PwC encourages leaders to consider these varied incentives when planning sustainability work."
        ],
        "takeaways": [
          "Don’t limit analysis to energy credits—include state/local abatements and location-based incentives in project evaluations.",
          "Factor available tax incentives into site selection and investment decisions for grid and data center projects.",
          "Document innovation activities and process improvements to support potential R&D tax credit claims.",
          "Treat sustainability spending as a source of tax value; integrate tax-incentive analysis into project business cases."
        ],
        "tags": [
          "sustainability",
          "tax credits",
          "incentives",
          "R&D tax credit",
          "state abatements",
          "location-based incentives",
          "PwC",
          "corporate tax",
          "operational resilience"
        ]
      }
    },
    {
      "id": "oQtkaHzUYlY",
      "title": "Copilot helps Christa find her inner star 🌟",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-29T18:33:49.000Z",
      "url": "https://www.youtube.com/watch?v=oQtkaHzUYlY",
      "thumbnail": "https://i.ytimg.com/vi/oQtkaHzUYlY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The sky is full of stars, and Copilot helps Christa find the star within. Viewers are invited to download and try Copilot via the link in the bio.",
        "bullets": [
          "Description frames Copilot as helping Christa 'find the star within.'",
          "Imagery evokes a sky full of stars.",
          "Direct call to action: download and try Copilot (link in bio).",
          "Tone is uplifting and personal."
        ],
        "takeaways": [
          "The video is a consumer-focused promotion encouraging downloads of Copilot, indicating active user acquisition efforts.",
          "Messaging centers on personal empowerment and creative self-expression, suggesting emphasis on individualized features and experiences.",
          "Decision-makers should note continued marketing-driven demand for Copilot, which may affect usage patterns and service load."
        ],
        "tags": [
          "Copilot",
          "Christa",
          "star",
          "stars",
          "sky",
          "download",
          "link in bio",
          "try"
        ]
      }
    },
    {
      "id": "BYtYm-xyKR8",
      "title": "Bringing In $251K A Year With 3 Jobs In The Bay Area",
      "channel": "CNBC Make It",
      "published_at": "2026-01-29T17:47:46.000Z",
      "url": "https://www.youtube.com/watch?v=BYtYm-xyKR8",
      "thumbnail": "https://i.ytimg.com/vi/BYtYm-xyKR8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Naseema McElroy, 44, is a labor and delivery nurse in Brentwood, California who also runs a personal finance brand and — per the video title — brings in $251K a year across three jobs. She amassed nearly $1 million in debt in 2015, started the brand Financially Intentional to document her debt-payoff journey, and was debt-free by 2017.",
        "bullets": [
          "Video title: 'Bringing In $251K A Year With 3 Jobs In The Bay Area.'",
          "Naseema McElroy, 44, is a labor and delivery nurse based in Brentwood, CA and operates a personal finance brand called Financially Intentional.",
          "In 2015 she accumulated nearly $1 million in debt and began documenting her payoff journey through her business.",
          "By 2017 she had paid off her debt and was debt-free.",
          "This piece is part of CNBC Make It's Millennial Money series profiling how people earn, spend, and save."
        ],
        "takeaways": [
          "Personal-brand creators (like Financially Intentional) rely on reliable hosting, streaming, and storage for content — consider capacity for media workloads.",
          "High-earning individuals in the Bay Area with multiple income streams can drive localized demand for cloud and content-delivery services.",
          "Produced video content (CNBC Make It) suggests recurring media distribution and storage needs—ensure scalable delivery and redundancy for peak traffic."
        ],
        "tags": [
          "Naseema McElroy",
          "Financially Intentional",
          "labor and delivery nurse",
          "debt payoff",
          "Brentwood CA",
          "Bay Area",
          "CNBC Make It",
          "Millennial Money",
          "personal finance",
          "$251K income"
        ]
      }
    },
    {
      "id": "t6y2cVNjCAw",
      "title": "GeForce Garage - Summer of RTX Community Build",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-29T14:01:25.000Z",
      "url": "https://www.youtube.com/watch?v=t6y2cVNjCAw",
      "thumbnail": "https://i.ytimg.com/vi/t6y2cVNjCAw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The video announces the winner of NVIDIA GeForce's Summer of RTX r/buildapc Community Build Contest (u/JeffersonPutnam) and showcases their small‑form‑factor GeForce RTX 5090 system. The build uses a Fractal Design Era 2 chassis and lists full parts including an RTX 5090 Founders Edition, Ryzen 7 9800X3D, MSI MPG B850I Edge mini‑ITX motherboard, 32GB DDR5‑6000, Corsair SF1000 PSU, and a Corsair Nautilus 240 AIO.",
        "bullets": [
          "Winner: u/JeffersonPutnam's SFF GeForce RTX 5090 build (Summer of RTX r/buildapc contest).",
          "Chassis: Fractal Design Era 2 (small form factor).",
          "GPU: GeForce RTX 5090 Founders Edition.",
          "Key components: Ryzen 7 9800X3D, MSI MPG B850I Edge (mini‑ITX), 32GB DDR5‑6000 RAM.",
          "Power/cooling: Corsair SF1000 PSU and Corsair Nautilus 240 AIO."
        ],
        "takeaways": [
          "High‑end desktop GPUs like the RTX 5090 are being deployed in compact SFF builds, underscoring the importance of tight thermal and spatial planning.",
          "A 1000W SFX power supply (Corsair SF1000) is used to support a very high‑power GPU in a small chassis—power density is a key consideration.",
          "A 240mm AIO (Corsair Nautilus 240) is employed for cooling in the SFF config, highlighting liquid cooling as a common solution for compact high‑performance systems.",
          "Mini‑ITX platforms (MSI MPG B850I Edge) paired with high‑performance CPUs (Ryzen 7 9800X3D) show tradeoffs between compute capability and expansion/space constraints that should be evaluated for deployment."
        ],
        "tags": [
          "GeForceGarage",
          "RTX5090",
          "GeForceRTX50",
          "SFF",
          "BuildAPC",
          "FractalEra2",
          "Ryzen9800X3D",
          "CorsairSF1000",
          "Nautilus240",
          "MiniITX"
        ]
      }
    },
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy generative AI solutions, unlocking new revenue streams while streamlining operations. Sreeni Alakappan highlights that leveraging GenAI and Google Cloud infrastructure boosted developer productivity and compressed TTEC's digital transformation timeline.",
        "bullets": [
          "TTEC worked with Google Cloud Consulting to accelerate AI prototyping and deployment.",
          "Generative AI and Google Cloud infrastructure were used to streamline operations.",
          "Efforts aimed to boost developer productivity across the organization.",
          "The partnership reportedly unlocked entirely new revenue streams for TTEC.",
          "Google Cloud Consulting helped compress TTEC's digital transformation timeline."
        ],
        "takeaways": [
          "Cloud infrastructure can accelerate AI rollouts, reducing time-to-deployment for new services.",
          "Improved developer productivity from GenAI tooling may shorten project cycles and lower operational overhead.",
          "Rapid prototyping and consulting support can help transform pilots into revenue-generating products faster.",
          "Partnering with cloud consulting can compress digital transformation timelines, limiting disruption during migration or upgrades."
        ],
        "tags": [
          "googlecloud",
          "ttec",
          "genai",
          "aideployment",
          "operationalefficiency",
          "customerexperience",
          "googlecloudplatform",
          "generativeai"
        ]
      }
    }
  ]
}