{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-27T10:54:56.570Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "azzmtqcIeCU",
      "title": "AWS Cost Efficiency Metrics I The Keys to AWS Optimization | S16 E2",
      "channel": "AWS Events",
      "published_at": "2026-01-27T10:14:44.000Z",
      "url": "https://www.youtube.com/watch?v=azzmtqcIeCU",
      "thumbnail": "https://i.ytimg.com/vi/azzmtqcIeCU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this livestream explores key metrics that drive AWS cost efficiency, highlighting KPIs such as cost per transaction, resource utilization rates, and ROI calculations. It also covers benchmarking, identifying optimization opportunities, and building dashboards to align technical performance with business outcomes for cloud engineers, FinOps teams, and technical leaders.",
        "bullets": [
          "Focus on essential KPIs: cost per transaction, utilization rates, and ROI.",
          "Practical methods to measure, track, and optimize AWS spending.",
          "Approaches to benchmarking cloud efficiency and spotting optimization opportunities.",
          "Guidance on building dashboards to communicate value to stakeholders.",
          "Audience: cloud engineers, FinOps teams, and technical leaders."
        ],
        "takeaways": [
          "Use KPIs (cost per transaction, utilization, ROI) to quantify and compare cloud costs.",
          "Benchmarking reveals where efficiency improvements or cost savings exist.",
          "Dashboards are critical for translating technical metrics into business value for stakeholders.",
          "Applying FinOps-style metrics and tracking helps maximize AWS investment."
        ],
        "tags": [
          "AWS",
          "CloudCosts",
          "FinOps",
          "CostOptimization",
          "CloudMetrics",
          "AWSCostManagement",
          "CloudEfficiency",
          "Benchmarking",
          "ROI"
        ]
      }
    },
    {
      "id": "wCJ_O97ww-k",
      "title": "World 1-3: Lens of Truth Obtained – Detective Controls Unlocked",
      "channel": "AWS Events",
      "published_at": "2026-01-27T08:10:22.000Z",
      "url": "https://www.youtube.com/watch?v=wCJ_O97ww-k",
      "thumbnail": "https://i.ytimg.com/vi/wCJ_O97ww-k/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This episode of the weekly cloud security deep dive, hosted by Russ Noll and Tristan Watty Ph.D., uses the 'Lens of Truth' metaphor to explore deploying AWS detective controls. The session focuses on making hidden threats and invisible risks visible to transform cloud security posture.",
        "bullets": [
          "Weekly one-hour cloud security deep dive airing Mondays at 11am PST.",
          "Hosts: Russ Noll and Tristan Watty Ph.D.",
          "Episode theme: 'Lens of Truth' analogy for revealing hidden threats.",
          "Practical focus on deploying AWS detective controls.",
          "Goal: illuminate the cloud environment and improve security visibility."
        ],
        "takeaways": [
          "Deploying AWS detective controls helps surface otherwise invisible threats and misconfigurations affecting critical systems.",
          "Improved visibility enables faster detection and response, reducing operational risk for grid and data center services.",
          "Detective controls support compliance and auditing needs by providing clearer evidence of environment state.",
          "Investing in visibility tools is a practical step toward a more resilient and manageable infrastructure security posture."
        ],
        "tags": [
          "cloud-security",
          "AWS",
          "detective-controls",
          "visibility",
          "threat-detection",
          "incident-response",
          "compliance",
          "cloud-ops"
        ]
      }
    },
    {
      "id": "9vS5kvxbPMQ",
      "title": "My Porta-Potty Business Brings In $4.3M/Year",
      "channel": "CNBC Make It",
      "published_at": "2026-01-24T15:00:30.000Z",
      "url": "https://www.youtube.com/watch?v=9vS5kvxbPMQ",
      "thumbnail": "https://i.ytimg.com/vi/9vS5kvxbPMQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Daniel Tom, 31, owns Bay Area Sanitation and manages nearly 2,000 portable toilets serving construction sites and events across the San Francisco Bay Area. The company reported $4.3 million in total income in 2025.",
        "bullets": [
          "Owner: Daniel Tom, 31",
          "Company: Bay Area Sanitation",
          "Fleet: almost 2,000 portable toilets",
          "Clients: construction sites and events across the San Francisco Bay Area",
          "Revenue: $4.3 million total income in 2025"
        ],
        "takeaways": [
          "Fleet size (~2,000 units) and $4.3M revenue indicate a sizable, operationally complex service business.",
          "Concentration in the San Francisco Bay Area suggests region-specific demand patterns and logistics.",
          "Client mix (construction sites and events) reflects distributed, mobile service requirements across many locations."
        ],
        "tags": [
          "portable-toilets",
          "sanitation",
          "Bay-Area",
          "Daniel-Tom",
          "small-business",
          "entrepreneurship",
          "CNBC-Make-It",
          "2025-revenue"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video presents route planning as made easy while Jo discovers the power of Copilot Groups. It highlights Copilot, Microsoft Copilot, and AI using the hashtags #copilot #microsoftcopilot #ai.",
        "bullets": [
          "Jo explores Copilot Groups in the context of route planning.",
          "Route planning is presented as simpler or 'made easy.'",
          "Emphasis on Copilot, Microsoft Copilot, and AI via hashtags.",
          "Short, discovery-focused description without a transcript."
        ],
        "takeaways": [
          "If Copilot Groups simplifies route planning, it could be worth piloting for field crew routing and maintenance scheduling.",
          "Simpler route planning may offer opportunities to reduce travel time and improve operational efficiency.",
          "Evaluate how Copilot Groups would integrate with existing dispatch and workforce coordination tools before wider rollout."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "route-planning",
          "copilot-groups",
          "jo",
          "discovery"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI in audit is presented as a current, practical part of KPMG’s audit work: directors Katarzyna Chojniak and Alicja Barska discuss tools and workflows that use AI to analyze large datasets, automate repetitive tasks and support decision-making. They highlight specific solutions (AI Transaction Scoring, Clara AI, KPMG Clara), the shift from sampling to full-population analysis, changing auditor competencies, implementation challenges, data security and regulatory issues, and potential risks and future directions.",
        "bullets": [
          "AI automates repetitive audit tasks and enables analysis of full populations of data instead of sampling.",
          "AI Transaction Scoring Tool supports population-wide analyses; Clara AI offers conversational assistants and specialized agents.",
          "KPMG Clara platform provides real-time audit management; Clara for Clients modernizes client communication.",
          "Technologies change the auditor’s role and require new competencies and adaptation.",
          "Key implementation issues include data security, regulatory environment and potential AI-related risks."
        ],
        "takeaways": [
          "Prepare data quality and accessibility for audits that increasingly analyse entire datasets rather than samples.",
          "Ensure secure data-sharing practices and regulatory compliance when engaging AI-enabled audit tools.",
          "Select audit partners with demonstrated AI platforms (e.g., KPMG Clara/Clara AI) and relevant expertise to streamline audit processes and communication.",
          "Include assessment of AI-related controls and risks in oversight of audits affecting critical infrastructure and operations."
        ],
        "tags": [
          "audit",
          "AI",
          "KPMG",
          "KPMG Clara",
          "Clara AI",
          "transaction scoring",
          "audit automation",
          "data security",
          "regulation"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video is the 4K launch trailer for Arknights: Endfield and highlights NVIDIA DLSS 4 with Multi Frame Generation. The footage was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 Multi Frame Generation 4X Mode, and the description includes links to the game and NVIDIA's DLSS 4 announcement.",
        "bullets": [
          "Official launch trailer for Arknights: Endfield (3D real-time strategy RPG).",
          "Features NVIDIA DLSS 4 with Multi Frame Generation (MFG).",
          "Captured on GeForce RTX 5080 at 4K Ultra with DLSS 4 MFG 4X Mode.",
          "Includes links to NVIDIA’s DLSS 4 article and the game’s official site.",
          "Lists official Arknights: Endfield and NVIDIA GeForce social channels."
        ],
        "takeaways": [
          "NVIDIA is showcasing DLSS 4 and Multi Frame Generation in high-resolution game capture—data center teams should track DLSS 4 availability and support for rendering pipelines.",
          "The trailer was captured on an RTX 5080 at 4K, signaling use of high-end GPUs for flagship visual demos—consider GPU capability requirements for comparable workloads.",
          "Direct link to NVIDIA’s DLSS 4 announcement is provided—use that official resource for technical and deployment details before planning integration.",
          "Presence of MFG 4X mode suggests new DLSS operational modes to validate for compatibility and licensing in GPU-accelerated services."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "NVIDIA",
          "RTX5080",
          "4K",
          "GeForce",
          "Gaming"
        ]
      }
    }
  ]
}