{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-19T05:55:57.969Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "6L86-OnOXV0",
      "title": "How I Built A $1M/Year Business - And Helped My Parents Retire",
      "channel": "CNBC Make It",
      "published_at": "2026-01-17T15:00:09.000Z",
      "url": "https://www.youtube.com/watch?v=6L86-OnOXV0",
      "thumbnail": "https://i.ytimg.com/vi/6L86-OnOXV0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Tuan Le vowed at 15 to help his parents retire after his family emigrated from Vietnam to Toronto in 2015. Ten years later his social video production company, ShortsCut, brings in over $1 million USD a year in sales, and he now pays his parents' rent and living expenses so they no longer have to work full time.",
        "bullets": [
          "Tuan Le emigrated from Vietnam to Toronto in 2015 and promised at 15 to help his parents retire.",
          "He founded ShortsCut, a social video production company.",
          "ShortsCut generates over $1 million USD in annual sales.",
          "Le now covers his parents' rent and living expenses, allowing them to stop full-time work.",
          "The story was produced by CNBC Make It with production credits listed in the description."
        ],
        "takeaways": [
          "Digital media companies can scale to substantial, recurring revenue—consider them as potential long-term infrastructure customers.",
          "Founder-driven missions can translate into resilient businesses; prioritize stability and flexible contract options for such clients.",
          "Growth of content production firms suggests demand for reliable storage and delivery solutions—factor this into capacity planning.",
          "Regional success stories (e.g., Toronto) highlight the value of local presence and support when targeting media production customers."
        ],
        "tags": [
          "Tuan Le",
          "ShortsCut",
          "entrepreneurship",
          "video production",
          "immigrant success",
          "small business",
          "CNBC Make It",
          "1M/year",
          "Toronto",
          "family support"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, a giant bubble of carbon dioxide is presented as a storage system capable of holding 20 megawatts of energy. The description says these batteries are intended to address fluctuations in renewable generation and to help drive the global shift to clean energy.",
        "bullets": [
          "A carbon dioxide \"bubble\" system is described as an energy storage device.",
          "The device can store 20 megawatts of energy (per the description).",
          "Framed as a solution for fluctuations in renewable energy output.",
          "Positioned as supporting the global transition to clean energy.",
          "Presented by IEEE Spectrum (per video description hashtags)."
        ],
        "takeaways": [
          "20 MW storage capacity is highlighted — worth evaluating for large-scale grid or facility applications.",
          "Designed to buffer renewable intermittency, so it could be considered as part of renewables integration strategies.",
          "May offer an additional option for planners seeking technologies to support clean-energy reliability.",
          "Reference from a technical outlet (IEEE Spectrum) could warrant follow-up for technical specifications and deployment details."
        ],
        "tags": [
          "ieee",
          "tech",
          "energy",
          "battery",
          "innovation",
          "future",
          "carbon-dioxide",
          "energy-storage"
        ]
      }
    },
    {
      "id": "OINppmPan0o",
      "title": "Figure Skating | Making Team USA presented by Xfinity with Apolo Ohno",
      "channel": "Team USA",
      "published_at": "2026-01-16T19:30:36.000Z",
      "url": "https://www.youtube.com/watch?v=OINppmPan0o",
      "thumbnail": "https://i.ytimg.com/vi/OINppmPan0o/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, figure skating duo Vadym Kolesnik and Emilia Zingas sit down with Apolo Ohno on this week’s episode of Making Team USA presented by Xfinity ahead of the Winter Olympics. The episode emphasizes the trust between the skating partners.",
        "bullets": [
          "Interview features Vadym Kolesnik and Emilia Zingas with host Apolo Ohno.",
          "Part of the Making Team USA series, presented by Xfinity.",
          "Framed as an Olympic preview, released ahead of the Winter Olympics.",
          "Highlights trust within the skating partnership.",
          "Distributed via Team USA’s YouTube and social channels (links provided)."
        ],
        "takeaways": [
          "Branded Olympic content (Xfinity) can drive viewership peaks—plan CDN capacity and monitoring around episode release and Olympic windows.",
          "Multi-platform distribution (YouTube + social links) suggests need for consistent encoding, caching, and analytics across channels.",
          "Short athlete interview assets are likely reusable—ensure storage, metadata, and rights management for repurposing.",
          "Coordinate co-branded campaign delivery with marketing to align ad-serving, SLAs, and traffic forecasting."
        ],
        "tags": [
          "Vadym Kolesnik",
          "Emilia Zingas",
          "Apolo Ohno",
          "Figure Skating",
          "Making Team USA",
          "Xfinity",
          "Winter Olympics",
          "Team USA",
          "Olympic Preview",
          "Sports Interview"
        ]
      }
    },
    {
      "id": "RalzsofAYHM",
      "title": "29-year-old spent $20,000 to open a store in New York — now it brings in $1.6 million a year",
      "channel": "CNBC Make It",
      "published_at": "2026-01-16T17:00:48.000Z",
      "url": "https://www.youtube.com/watch?v=RalzsofAYHM",
      "thumbnail": "https://i.ytimg.com/vi/RalzsofAYHM/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Abby Price launched Abbode as a Parsons graduate student selling dried floral arrangements on Facebook in 2019, opened a Nolita storefront in March 2022, and used store cashflow to buy a $15,000 embroidery machine. The video title reports she spent $20,000 to open the store and it now brings in $1.6 million a year.",
        "bullets": [
          "Started Abbode selling dried floral arrangements on Facebook in 2019 while at Parsons School of Design.",
          "Opened a storefront in New York’s Nolita neighborhood in March 2022.",
          "Store cashflow financed a $15,000 embroidery machine bought on a whim.",
          "Title states $20,000 initial cost to open the store.",
          "Title states the business now generates $1.6 million in annual revenue."
        ],
        "takeaways": [
          "Growth from online sales to a physical storefront can rapidly change local commercial demand patterns.",
          "Investments in equipment (e.g., a $15,000 embroidery machine) highlight the need for reliable onsite utilities and services.",
          "Dependence on digital channels (Facebook origin) underscores the importance of resilient connectivity and data services for small retailers.",
          "Concentrated urban retail success (Nolita storefront) may drive localized infrastructure and capacity planning."
        ],
        "tags": [
          "Abby Price",
          "Abbode",
          "Nolita",
          "embroidery machine",
          "small business",
          "retail",
          "dried florals",
          "Parsons School of Design",
          "entrepreneurship",
          "New York City"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The KPMG ON AIR episode examines how AI is already changing transfer pricing—enabling profitability monitoring, comparative analyses and automation of documentation—while outlining smart adoption paths. Experts Monika Palmowska and Jakub Roszkiewicz discuss AI’s supportive role for advisors, associated risks (data, security, RODO, hallucinations), secure environments like Digital Gateway, ERP integration, and first implementation steps focused on process organization.",
        "bullets": [
          "AI use cases: rentability monitoring, intelligent benchmarks and automated transfer pricing documentation.",
          "AI complements rather than replaces tax advisors, also supporting junior staff development.",
          "Key risks include data privacy, security and AI hallucinations; compliance (RODO) is highlighted.",
          "Digital Gateway presented as a secure environment for AI work with sensitive data.",
          "Implementation advice: start with process cleanup, ERP integration and defined first steps."
        ],
        "takeaways": [
          "Provide a secure, compliant environment (e.g., Digital Gateway-type setup) for AI workloads handling sensitive tax data.",
          "Ensure ERP systems can integrate with AI tools to enable intelligent benchmarking and automated monitoring.",
          "Prioritize data governance, privacy and auditability to mitigate RODO and security risks associated with AI.",
          "Prepare infrastructure and workflows to support automation of documentation and analytics to reduce manual effort and improve monitoring."
        ],
        "tags": [
          "podatki",
          "AI",
          "ceny transferowe",
          "transfer pricing",
          "automatyzacja",
          "ERP",
          "bezpieczeństwo danych",
          "Digital Gateway",
          "RODO",
          "benchmarks"
        ]
      }
    },
    {
      "id": "dGfcT63U7Mo",
      "title": "The 2026 U.S. Olympic Figure Skating Team 🇺🇸",
      "channel": "Team USA",
      "published_at": "2026-01-15T20:43:24.000Z",
      "url": "https://www.youtube.com/watch?v=dGfcT63U7Mo",
      "thumbnail": "https://i.ytimg.com/vi/dGfcT63U7Mo/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video from Team USA highlights the 2026 U.S. Olympic Figure Skating Team. The description is very brief (\"This U.S. Olympic Figure Skating lineup. 🔥\") and no transcript is available.",
        "bullets": [
          "Title: The 2026 U.S. Olympic Figure Skating Team",
          "Channel: Team USA",
          "Published: 2026-01-15T20:43:24.000Z",
          "Description: \"This U.S. Olympic Figure Skating lineup. 🔥\" with #WinterOlympics",
          "Transcript: not available"
        ],
        "takeaways": [
          "Metadata signals Olympic-related content (title + #WinterOlympics) — anticipate potential seasonal traffic around Winter Olympics periods.",
          "Short description and missing transcript imply low immediate need for heavy NLP/transcription processing; deprioritize automated transcription until requested.",
          "Recent publish date (Jan 15, 2026) suggests topical relevance—consider CDN caching or edge placement if expecting short-term engagement spikes.",
          "Official channel (Team USA) may drive higher engagement and should be monitored for priority distribution and verification in content pipelines."
        ],
        "tags": [
          "U.S. Olympic Team",
          "Figure Skating",
          "Winter Olympics",
          "Team USA",
          "2026",
          "Olympics",
          "FigureSkating",
          "Sports"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video encourages keeping momentum by stacking small wins with Microsoft Copilot. It frames Copilot as a companion for sustaining progress across workouts, projects, and personal goals.",
        "bullets": [
          "Encourages stacking small wins to maintain momentum.",
          "Positions Microsoft Copilot as a tool to help sustain progress.",
          "Applies the idea to workouts, projects, and personal goals.",
          "Emphasizes steady, incremental progress over one-time big leaps."
        ],
        "takeaways": [
          "Break large grid or data-center initiatives into small, measurable wins to sustain team momentum.",
          "Consider the described approach—using Copilot to stack small wins—to keep long-running projects moving forward.",
          "Regular incremental progress can help demonstrate momentum to stakeholders and reduce project stall risk.",
          "Focus on steady, repeatable tasks and milestones to maintain operational continuity during modernization efforts."
        ],
        "tags": [
          "Microsoft Copilot",
          "Copilot",
          "productivity",
          "momentum",
          "small wins",
          "workouts",
          "projects",
          "personal goals",
          "motivation",
          "self-improvement"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video highlights how high-frequency trading relies on precision and speed and showcases the Dell PowerEdge R770AP server powered by Intel® Xeon® 6 processors. It says the platform performs hundreds of trades in seconds to help maximize gains and minimize losses and positions Intel Xeon 6 CPUs as shaping the future of finance.",
        "bullets": [
          "Focuses on high-frequency trading where every second matters",
          "Showcases Dell PowerEdge R770AP server",
          "Powered by Intel® Xeon® 6 processors",
          "Claims capability to perform hundreds of trades in seconds",
          "Frames Intel Xeon 6 CPUs as defining the future of finance"
        ],
        "takeaways": [
          "For low-latency trading workloads, evaluate servers with high-performance CPUs like Intel Xeon 6",
          "Consider platforms (e.g., Dell PowerEdge R770AP) marketed for rapid, high-throughput transaction processing",
          "Investing in faster, more precise infrastructure is presented as a way to reduce losses and improve trading gains",
          "Plan capacity to support hundreds-of-trades-per-second workloads if pursuing HFT use cases"
        ],
        "tags": [
          "high-frequency-trading",
          "HFT",
          "Dell-PowerEdge-R770AP",
          "Intel-Xeon-6",
          "low-latency",
          "finance",
          "data-center",
          "servers",
          "high-performance"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video presents Copilot as a tool that revived a lost creative spark. Viewers are invited to download Copilot and try it for themselves via the link in the bio.",
        "bullets": [
          "The creative spark was out; Copilot brought it back to life.",
          "Call to action: download Copilot and try it yourself.",
          "Download available via the link in the bio.",
          "Short promotional video from Microsoft Copilot.",
          "Published 2026-01-14."
        ],
        "takeaways": [
          "If your teams are struggling creatively, consider trying Copilot as a quick way to spark ideas.",
          "Use the link in the bio to rapidly access and pilot Copilot with a small group.",
          "Assess whether Copilot-generated ideas help brainstorming or design sessions before broader adoption.",
          "Track results from early trials to determine practical value for operational planning and problem-solving."
        ],
        "tags": [
          "Copilot",
          "Microsoft Copilot",
          "creativity",
          "spark",
          "download",
          "link-in-bio",
          "try-it",
          "creative-tools"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this NVIDIA GeForce video presents the open-world martial arts RPG Where Winds Meet showcasing DLSS 4 with Multi Frame Generation and RTX On. The clip credits creator DigitalDreamsyt and emphasizes the combination of the game and NVIDIA rendering features.",
        "bullets": [
          "Open-world martial arts RPG: Where Winds Meet",
          "Highlights DLSS 4 with Multi Frame Generation",
          "Emphasizes RTX On visuals",
          "Video footage credited to DigitalDreamsyt"
        ],
        "takeaways": [
          "Use of DLSS 4 with Multi Frame Generation implies titles leveraging the latest NVIDIA inference/upscaling features may benefit from GPUs that support DLSS 4.",
          "RTX On emphasis suggests a need to provision hardware capable of real-time ray tracing for accurate testing or cloud deployment.",
          "Deployments for cloud gaming or visualization should consider compatibility and validation for DLSS 4 and RTX-enabled workloads.",
          "Monitoring demand for advanced-rendering titles like this can inform GPU capacity planning and upgrade cycles."
        ],
        "tags": [
          "Where Winds Meet",
          "DLSS 4",
          "Multi Frame Generation",
          "RTX On",
          "open-world",
          "martial arts RPG",
          "NVIDIA GeForce",
          "DigitalDreamsyt",
          "gaming",
          "ray tracing"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this Intel Business video is titled \"Taha Khalifa (Intel)\" and includes links to subscribe and connect with the Intel Business channel. The description states Intel Business provides resources, guidance, and expert insights to help IT projects — from data centers to devices — and lists the website and social profiles.",
        "bullets": [
          "Video titled \"Taha Khalifa (Intel)\" on the Intel Business channel.",
          "No transcript is available for this video.",
          "Subscribe link is provided in the description.",
          "Intel Business offers resources, guidance, and expert insights for IT projects spanning data centers to devices.",
          "Connect links included: Intel Business website, X, LinkedIn, Facebook, and channel URL."
        ],
        "takeaways": [
          "Intel Business positions itself as a resource for data center and device-related IT projects.",
          "Subscribing and following their channels gives access to guidance and expert insights relevant to project planning and execution.",
          "Use the Intel Business website and social profiles to find additional resources and updates.",
          "The video page serves as an entry point to Intel's curated IT content and contacts."
        ],
        "tags": [
          "Intel",
          "Intel Business",
          "Taha Khalifa",
          "IT",
          "Data Centers",
          "Devices",
          "IT Resources",
          "Enterprise IT",
          "Tech Insights",
          "Subscribe"
        ]
      }
    },
    {
      "id": "kSocjh8PZnQ",
      "title": "Rynek dóbr luksusowych w obliczu transformacji | Andrzej Marczak, Tomasz Wiśniewski",
      "channel": "KPMG Poland",
      "published_at": "2026-01-13T10:23:31.000Z",
      "url": "https://www.youtube.com/watch?v=kSocjh8PZnQ",
      "thumbnail": "https://i.ytimg.com/vi/kSocjh8PZnQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The KPMG ON AIR podcast episode features Andrzej Marczak and Tomasz Wiśniewski discussing current trends in the luxury goods market in Poland and globally, and why Poland’s market continues to grow despite global declines. Key themes include experience-driven luxury, ESG and responsible sourcing, affordable luxury, Gen Z preferences, the role of art and tourism, and emerging tech like AI.",
        "bullets": [
          "Shift from possession to experiences and personalized, exclusive customer journeys.",
          "Growing importance of ESG and responsible-luxury practices (e.g., eco-leathers, certifications).",
          "‘Affordable luxury’ and aspirational consumers expanding product categories beyond top-tier buyers.",
          "Poland’s luxury market is growing but remains fragmented compared to global markets.",
          "Future drivers highlighted: AI, craftsmanship, luxury in hospitality/film, and youth-driven art/tourism trends."
        ],
        "takeaways": [
          "Experience-led and AI-enabled luxury services imply higher demand for reliable, low-latency digital infrastructure and scalable compute resources.",
          "ESG emphasis suggests preference for energy-efficient, certified data center solutions to align with clients’ sustainability goals.",
          "Growth and fragmentation of the Polish luxury market point to opportunities for localized capacity and distributed infrastructure to serve premium hospitality, tourism, and brand-experience use cases.",
          "Personalization and multimedia brand worlds (hotels, film) increase need for high-availability content delivery and secure hosting for digital touchpoints."
        ],
        "tags": [
          "luxury",
          "luksus",
          "ESG",
          "Poland",
          "personalization",
          "GenZ",
          "AI",
          "tourism",
          "KPMG"
        ]
      }
    }
  ]
}