{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-20T07:50:29.255Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Dr. Anna Chacon, 39, is a Miami-based dermatologist who runs her own private practice and is reported to earn $900,000 a year. Her net worth is about $6 million, comprised of $3.2M in investments, a $1.9M home and a $1.1M office building.",
        "bullets": [
          "Dr. Anna Chacon, 39, dermatologist in Miami, FL with a private practice.",
          "Reported annual earnings: $900,000.",
          "Total net worth: approximately $6 million.",
          "Asset breakdown: $3.2M investments, $1.9M home, $1.1M office building.",
          "Source: CNBC Make It video description (no transcript available)."
        ],
        "takeaways": [
          "Owners of private medical practices can also be commercial property owners (office building ownership) — consider them as local stakeholders when assessing commercial demand.",
          "High-income professionals with substantial investments and real estate holdings may represent concentrated, reliable demand for premium energy and connectivity services in affluent markets.",
          "When planning capacity or outreach in urban areas, include privately owned medical offices as consistent points of commercial energy and IT infrastructure demand."
        ],
        "tags": [
          "dermatologist",
          "personal finance",
          "net worth",
          "private practice",
          "real estate",
          "investments",
          "Miami",
          "high income",
          "CNBC Make It",
          "wealth"
        ]
      }
    },
    {
      "id": "6L86-OnOXV0",
      "title": "How I Built A $1M/Year Business - And Helped My Parents Retire",
      "channel": "CNBC Make It",
      "published_at": "2026-01-17T15:00:09.000Z",
      "url": "https://www.youtube.com/watch?v=6L86-OnOXV0",
      "thumbnail": "https://i.ytimg.com/vi/6L86-OnOXV0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Tuan Le emigrated from Vietnam to Toronto in 2015 and vowed at age 15 to help his parents retire. Ten years later his social video production company, ShortsCut, is generating over $1 million USD a year in sales, and he now pays his parents' rent and living expenses so they no longer have to work full time.",
        "bullets": [
          "Tuan Le and his family emigrated from Vietnam to Toronto in 2015.",
          "At age 15 he promised to help his parents retire.",
          "He founded ShortsCut, a social video production company.",
          "ShortsCut now brings in over $1M USD annually in sales.",
          "He uses his earnings to cover his parents' rent and living expenses."
        ],
        "takeaways": [
          "High-revenue digital content firms (e.g., ShortsCut) represent a growing customer segment that may require reliable hosting, storage, and distribution services.",
          "Video production businesses can scale to significant revenues within a decade, implying increasing demand for bandwidth and low-latency delivery.",
          "Grid and data center planners should consider capacity and service offerings tailored to content creators and media companies.",
          "Support services (backup, CDN, scalable storage) could be relevant value propositions for rapidly growing media-production clients."
        ],
        "tags": [
          "Tuan Le",
          "ShortsCut",
          "CNBC Make It",
          "social video",
          "content creation",
          "entrepreneurship",
          "immigrant success",
          "family support",
          "small business",
          "video production"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video describes a giant bubble of carbon dioxide that can store 20 megawatts of energy. It says these new batteries can help manage fluctuations in renewable energy and support the global shift to clean energy.",
        "bullets": [
          "Giant carbon dioxide bubble used as an energy storage medium.",
          "Reported storage capacity of 20 megawatts.",
          "Framed as a solution for fluctuating renewable energy resources.",
          "Positioned as aiding the global transition to clean energy."
        ],
        "takeaways": [
          "Consider evaluating CO2-bubble storage as a potential option for meeting multi-megawatt capacity needs (noting the cited 20 MW figure).",
          "Assess whether such storage could help smooth renewable generation variability on your grid or at data center sites.",
          "Include emerging CO2-based battery concepts in longer-term decarbonization and resilience planning.",
          "Request further technical and operational details (availability, scalability, round-trip efficiency) before procurement decisions."
        ],
        "tags": [
          "ieee",
          "tech",
          "ieeespectrum",
          "innovation",
          "future",
          "futuristic",
          "energy",
          "battery"
        ]
      }
    },
    {
      "id": "OINppmPan0o",
      "title": "Figure Skating | Making Team USA presented by Xfinity with Apolo Ohno",
      "channel": "Team USA",
      "published_at": "2026-01-16T19:30:36.000Z",
      "url": "https://www.youtube.com/watch?v=OINppmPan0o",
      "thumbnail": "https://i.ytimg.com/vi/OINppmPan0o/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, figure skating duo Vadym Kolesnik and Emilia Zingas sit down with Apolo Ohno on an episode of Making Team USA presented by Xfinity ahead of the Winter Olympics. The episode is framed around the theme of trust and is promoted across Team USA's digital channels.",
        "bullets": [
          "Vadym Kolesnik and Emilia Zingas feature in the episode with host Apolo Ohno.",
          "The series episode is presented by Xfinity and tied to the Winter Olympics.",
          "Theme highlighted in the description: 'Built on trust.'",
          "Promoted on Team USA's YouTube and social platforms (links provided).",
          "Calls to action encourage subscribing and following Team USA across channels."
        ],
        "takeaways": [
          "Xfinity's title sponsorship underscores the value of brand partnerships in athlete-focused content.",
          "Distribution on YouTube and multiple social platforms signals ongoing digital audience engagement opportunities.",
          "Athlete narratives centered on trust and teamwork offer ready-made messaging for corporate or employee engagement campaigns.",
          "Clear cross-promotion (subscribe/follow links) indicates strategies to grow and retain digital viewership."
        ],
        "tags": [
          "figure skating",
          "Vadym Kolesnik",
          "Emilia Zingas",
          "Apolo Ohno",
          "Team USA",
          "Making Team USA",
          "Xfinity",
          "Winter Olympics",
          "trust",
          "YouTube"
        ]
      }
    },
    {
      "id": "dGfcT63U7Mo",
      "title": "The 2026 U.S. Olympic Figure Skating Team 🇺🇸",
      "channel": "Team USA",
      "published_at": "2026-01-15T20:43:24.000Z",
      "url": "https://www.youtube.com/watch?v=dGfcT63U7Mo",
      "thumbnail": "https://i.ytimg.com/vi/dGfcT63U7Mo/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this Team USA video announces the U.S. Olympic Figure Skating lineup. The short description highlights the roster and includes the #WinterOlympics tag.",
        "bullets": [
          "Video presents the U.S. Olympic Figure Skating lineup.",
          "Published by Team USA on 2026-01-15.",
          "No transcript is available for the video.",
          "Description is brief and uses the #WinterOlympics hashtag."
        ],
        "takeaways": [
          "This is Olympic-related content from an official team channel—expect event-driven interest tied to the Winter Olympics timeframe.",
          "Plan for potential increases in streaming and download traffic when Olympic selections and related coverage are published.",
          "Ensure CDN caching and delivery capacity for short-form announcement videos from official channels to preserve viewer experience.",
          "Monitor analytics around the publication date and Olympic schedule to allocate resources for peaks in demand."
        ],
        "tags": [
          "Team USA",
          "U.S. Olympic",
          "Figure Skating",
          "Winter Olympics",
          "Olympics",
          "FigureSkatingLineup",
          "Sports",
          "TeamAnnouncement"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video encourages keeping momentum with Microsoft Copilot when tackling workouts, projects, or personal goals. It promotes stacking small wins to sustain progress and motivation.",
        "bullets": [
          "Highlights using Copilot to maintain momentum.",
          "Applies across workouts, projects, and personal goals.",
          "Emphasizes stacking small wins to keep progress steady.",
          "Short, motivational framing rather than technical detail."
        ],
        "takeaways": [
          "Consider applying a small-wins approach to long infrastructure or migration projects to sustain progress.",
          "Evaluate tools like Copilot as aids for breaking complex tasks into manageable steps to help teams maintain momentum.",
          "Encourage incremental achievements among staff to reduce fatigue and keep multi-phase initiatives moving forward."
        ],
        "tags": [
          "Microsoft Copilot",
          "Copilot",
          "productivity",
          "small wins",
          "momentum",
          "goals",
          "projects",
          "workouts",
          "personal growth"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights how the Dell PowerEdge R770AP server, powered by Intel® Xeon® 6 processors, delivers the precision and speed required for high-frequency trading. It emphasizes that Intel Xeon 6 CPUs enable hundreds of trades in seconds to help maximize gains and minimize losses and frames this technology as shaping the future of finance.",
        "bullets": [
          "Dell PowerEdge R770AP server paired with Intel® Xeon® 6 processors.",
          "Built for high-frequency trading where every second matters.",
          "Capable of performing hundreds of trades in seconds to maximize gains and minimize losses.",
          "Positions Intel Xeon 6 CPUs as a high-performance foundation for finance.",
          "Intel Business channel provides resources and links for IT professionals (subscribe/website/socials)."
        ],
        "takeaways": [
          "For latency-sensitive trading workloads, evaluate servers like the Dell PowerEdge R770AP configured with Intel Xeon 6 CPUs.",
          "Prioritize CPU performance and low-latency infrastructure to support high-frequency trading volumes (hundreds of trades/second).",
          "Factor potential financial impact (maximize gains/minimize losses) into hardware selection for trading platforms.",
          "Leverage vendor resources and guidance from Intel Business when planning finance-focused deployments."
        ],
        "tags": [
          "high-frequency-trading",
          "HFT",
          "Dell-PowerEdge-R770AP",
          "Intel-Xeon-6",
          "low-latency",
          "data-center",
          "finance",
          "high-performance-computing"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the creative spark was out and Copilot brought it back to life. The short description invites viewers to download Copilot and try it via the link in bio.",
        "bullets": [
          "Message: Copilot renewed creativity.",
          "Clear call-to-action to download Copilot.",
          "Provides a link in bio for access.",
          "No transcript available—only the brief promotional description.",
          "Concise promotional tone focused on user trial."
        ],
        "takeaways": [
          "The description frames Copilot as a creativity aid—if creative work factors into your teams' roles, consider downloading and testing it via the link in bio.",
          "Use the easy call-to-action as a low-friction way to pilot the tool with a small group before broader adoption.",
          "Treat the promotional claim as a prompt to validate benefits through direct evaluation rather than relying solely on the description."
        ],
        "tags": [
          "Copilot",
          "creativity",
          "creative-spark",
          "download",
          "link-in-bio",
          "promo"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This video showcases the open-world martial arts RPG Where Winds Meet running with DLSS 4's Multi Frame Generation and RTX On. The clip is presented by @DigitalDreamsyt on the NVIDIA GeForce channel.",
        "bullets": [
          "Shows Where Winds Meet, an open-world martial arts RPG",
          "Features DLSS 4 with Multi Frame Generation",
          "Highlights RTX On visuals",
          "Video credited to @DigitalDreamsyt",
          "Published on the NVIDIA GeForce channel"
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is featured—ensure GPU nodes support DLSS 4 and NVIDIA RTX capabilities for testing or deployment.",
          "Content emphasizes RTX-enabled rendering—verify driver and software stack compatibility for RTX workloads.",
          "For streaming or visuals-heavy workloads, validate infrastructure can deliver GPU-accelerated ray-tracing and DLSS features."
        ],
        "tags": [
          "WhereWindsMeet",
          "DLSS4",
          "MultiFrameGeneration",
          "RTXOn",
          "OpenWorld",
          "MartialArtsRPG",
          "NVIDIAGeForce",
          "DigitalDreamsyt",
          "RTX",
          "Gaming"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this Intel Business video is titled “Taha Khalifa (Intel)” and is hosted on the Intel Business YouTube channel. The channel offers IT resources, guidance, and expert insights for projects ranging from data centers to devices, and the description includes links to subscribe, the Intel Business website, and social channels.",
        "bullets": [
          "No transcript is available for the video.",
          "Video title: Taha Khalifa (Intel) — hosted on Intel Business.",
          "Channel purpose: provide IT information, resources, guidance, and expert insights.",
          "Subscribe link included in the description.",
          "Links provided to the Intel Business website and social channels (X, LinkedIn, Facebook)."
        ],
        "takeaways": [
          "Intel Business positions itself as a resource hub for data center and device-related IT projects—useful for decision-makers seeking vendor-backed guidance.",
          "Visit the Intel Business website (link in description) to access more detailed resources and support for grid/data-center initiatives.",
          "Follow Intel Business on social channels and subscribe to the YouTube channel to stay updated on insights and guidance relevant to infrastructure planning."
        ],
        "tags": [
          "Intel Business",
          "Taha Khalifa",
          "Intel",
          "data centers",
          "IT resources",
          "IT projects",
          "enterprise IT",
          "tech insights"
        ]
      }
    }
  ]
}