{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-23T20:47:12.344Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… KPMG eksperci opisują, że AI w audycie to już codzienność — narzędzia automatyzują powtarzalne czynności, analizują duże zbiory danych i wspierają podejmowanie decyzji. Omawiane rozwiązania to m.in. AI Transaction Scoring Tool, Clara AI oraz platforma KPMG Clara (w tym Clara for Clients), a rozmowa porusza też zmiany roli audytora, wyzwania implementacyjne, bezpieczeństwo danych i potencjalne ryzyka.",
        "bullets": [
          "AI automatyzuje powtarzalne zadania i umożliwia analizę pełnych populacji danych.",
          "AI Transaction Scoring Tool – analiza pełnych populacji zamiast klasycznego próbkowania.",
          "Clara AI – konwersacyjny asystent i wyspecjalizowani agenci wspierający pracę audytową.",
          "KPMG Clara i Clara for Clients – zarządzanie badaniem w czasie rzeczywistym i nowoczesna komunikacja z klientem.",
          "Poruszono też adaptację kompetencji audytorów, wyzwania wdrożeniowe, bezpieczeństwo danych i regulacje oraz potencjalne zagrożenia AI."
        ],
        "takeaways": [
          "Rozważ audit oparty na analizie pełnej populacji danych, by uzyskać bardziej kompletną kontrolę i zgodność.",
          "Wybieraj narzędzia oferujące zarządzanie badaniem w czasie rzeczywistym i usprawnioną komunikację z klientem.",
          "Zapewnij wymagania dotyczące bezpieczeństwa danych i zgodności regulacyjnej przy korzystaniu z rozwiązań AI.",
          "Planuj szkolenia i rozwój kompetencji audytorów oraz alokację zasobów na wdrożenie nowych technologii.",
          "Wymagaj od partnerów audytowych jasnych strategii zarządzania ryzykiem związanym z AI."
        ],
        "tags": [
          "audyt",
          "sztuczna inteligencja",
          "KPMG Clara",
          "Clara AI",
          "analiza pełnej populacji",
          "narzędzia AI",
          "bezpieczeństwo danych",
          "regulacje",
          "kompetencje audytorów",
          "innowacje"
        ]
      }
    },
    {
      "id": "6hu7hYLiu08",
      "title": "Get Step-By-Step Fixes with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-21T20:14:00.000Z",
      "url": "https://www.youtube.com/watch?v=6hu7hYLiu08",
      "thumbnail": "https://i.ytimg.com/vi/6hu7hYLiu08/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Copilot offers real-time visual support for home projects and repairs by seeing what you see and delivering step-by-step instructions. It provides clear, guided troubleshooting for issues ranging from leaky pipes to overflowing washing machines.",
        "bullets": [
          "Real-time visual support: Copilot can see what the user sees.",
          "Delivers step-by-step instructions for repairs and projects.",
          "Targets common home issues such as leaky pipes and overflowing washing machines.",
          "Aims to provide clear, guided troubleshooting to assist users.",
          "Designed to support both projects and repairs with on-the-spot guidance."
        ],
        "takeaways": [
          "Evaluate whether Copilot's real-time visual and step-by-step guidance fits your facilities or maintenance workflows.",
          "Consider using a similar visual-assistance model to support on-site technicians during troubleshooting.",
          "Assess alignment between Copilot's guidance capabilities and your operational requirements before adoption."
        ],
        "tags": [
          "Copilot",
          "real-time support",
          "visual assistance",
          "step-by-step instructions",
          "home repairs",
          "plumbing",
          "appliances",
          "troubleshooting",
          "Microsoft"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield has officially launched and the trailer highlights NVIDIA DLSS 4 with Multi Frame Generation. The 4K launch trailer was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 Multi Frame Generation 4X Mode, and the description links to the game site and NVIDIA's DLSS 4 article.",
        "bullets": [
          "Arknights: Endfield is a newly launched 3D real-time strategy RPG where players act as the Endministrator on Talos-II.",
          "Trailer emphasizes NVIDIA DLSS 4 with Multi Frame Generation (MFG).",
          "Captured on GeForce RTX 5080 at 4K Ultra settings using DLSS 4 MFG 4X Mode.",
          "Description includes links to the game site and NVIDIA DLSS 4 announcement.",
          "Official social channels for Arknights: Endfield and GeForce are listed."
        ],
        "takeaways": [
          "Provision hardware that supports DLSS 4 (the trailer was captured on an RTX 5080) for high-resolution capture and rendering workloads.",
          "DLSS 4 with Multi Frame Generation is being used in 4K capture workflows, so evaluate GPUs and software stacks for frame-generation capabilities.",
          "Ensure driver/software compatibility and access to vendor resources (NVIDIA and game developer links provided) when deploying systems that must support DLSS 4.",
          "Plan for the power, cooling, and bandwidth needs associated with sustained 4K Ultra capture on high-end GPUs."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "NVIDIA",
          "RTX5080",
          "MultiFrameGeneration",
          "4K",
          "GeForce",
          "GameLaunch",
          "Endfield",
          "GamingTrailer"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this giant bubble of carbon dioxide can store 20 megawatts of energy and provides about 8 hours of energy storage. The technology is presented as a battery solution to help smooth fluctuating renewable generation and support the global shift to clean energy.",
        "bullets": [
          "Giant CO2 bubble battery stores 20 megawatts of power",
          "Provides roughly 8 hours of energy storage",
          "Designed to address fluctuations in renewable energy generation",
          "Positioned to support the global transition to clean energy",
          "Presented by IEEE Spectrum as an energy storage innovation"
        ],
        "takeaways": [
          "A 20 MW, 8-hour storage profile offers multi-hour flexibility useful for shifting daily renewable output and backing critical loads",
          "Can be considered as part of strategies to smooth renewable intermittency and reduce curtailment",
          "Grid and data-center planners should note the availability of a CO2-based, multi-hour storage option when evaluating decarbonization and resilience solutions"
        ],
        "tags": [
          "CO2",
          "carbon-dioxide",
          "battery",
          "energy-storage",
          "renewables",
          "grid",
          "data-centers",
          "innovation",
          "ieee",
          "tech"
        ]
      }
    }
  ]
}