{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-30T06:08:40.525Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "azzmtqcIeCU",
      "title": "Cloud Cost Efficiency I The Keys to AWS Optimization | S16 E2",
      "channel": "AWS Events",
      "published_at": "2026-01-30T05:12:30.000Z",
      "url": "https://www.youtube.com/watch?v=azzmtqcIeCU",
      "thumbnail": "https://i.ytimg.com/vi/azzmtqcIeCU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this livestream breaks down the KPIs that drive AWS cost efficiency—highlighting cost per transaction, resource utilization rates, and ROI calculations—to help measure and optimize cloud spending. It also covers benchmarking methods, spotting optimization opportunities, and building dashboards that align technical performance with business outcomes for cloud engineers, FinOps teams, and technical leaders.",
        "bullets": [
          "Core KPIs: cost per transaction, resource utilization rates, and ROI calculations",
          "Practical measurement and tracking techniques for AWS spending",
          "Benchmarking approaches to assess cloud efficiency",
          "Identifying cost optimization and rightsizing opportunities",
          "Building dashboards to communicate value to stakeholders"
        ],
        "takeaways": [
          "Use cost-per-transaction as a comparable metric to prioritize workload savings",
          "Monitor resource utilization to identify and eliminate wasted capacity",
          "Apply ROI calculations to justify and sequence optimization investments",
          "Benchmarking establishes targets and context for efficiency improvements",
          "Dashboards translate technical metrics into stakeholder-facing business value"
        ],
        "tags": [
          "AWS",
          "CloudCosts",
          "FinOps",
          "CostOptimization",
          "CloudMetrics",
          "AWSCostManagement",
          "CloudEfficiency",
          "Benchmarking",
          "Dashboards",
          "Livestream"
        ]
      }
    },
    {
      "id": "oQtkaHzUYlY",
      "title": "Copilot helps Christa find her inner star 🌟",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-29T18:33:49.000Z",
      "url": "https://www.youtube.com/watch?v=oQtkaHzUYlY",
      "thumbnail": "https://i.ytimg.com/vi/oQtkaHzUYlY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the clip frames Copilot as a supportive tool that helps Christa \"find the star within\" amid a sky full of stars. The short promo invites viewers to download and try Copilot via the link in the channel bio.",
        "bullets": [
          "Promotional clip using star-filled imagery and an inspirational theme",
          "Positions Copilot as helping Christa \"find the star within\"",
          "Direct call-to-action to download and try Copilot",
          "Download link referenced as \"link in bio\"",
          "Uses a star emoji to reinforce the uplifting tone"
        ],
        "takeaways": [
          "Copilot is being promoted as a consumer-downloadable product (link in bio).",
          "Marketing emphasizes personal, inspirational messaging aimed at end users.",
          "The presence of a clear CTA suggests a focus on driving direct installs or trials.",
          "Campaign framing may warrant tracking consumer uptake and related infrastructure demand."
        ],
        "tags": [
          "Copilot",
          "Microsoft",
          "Christa",
          "stars",
          "inspiration",
          "download",
          "link-in-bio",
          "promo",
          "AI-assistant"
        ]
      }
    },
    {
      "id": "2GZM7wOHFcg",
      "title": "Follow the carbon, find the money: Turning sustainability into financial value",
      "channel": "PwC US",
      "published_at": "2026-01-29T18:04:28.000Z",
      "url": "https://www.youtube.com/watch?v=2GZM7wOHFcg",
      "thumbnail": "https://i.ytimg.com/vi/2GZM7wOHFcg/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Rich Goode of PwC US explains that sustainability gains traction when framed in business terms by linking carbon reductions to measurable financial impact. Translating emissions outcomes into cost savings and business value makes carbon concrete and helps move sustainability from ambition to action by driving alignment, investment, and results.",
        "bullets": [
          "Frame sustainability in financial terms to engage leadership.",
          "Link carbon reduction outcomes to cost savings and business value.",
          "A ton of carbon is abstract; dollar impacts are concrete.",
          "Translate emissions metrics into business outcomes to prompt action.",
          "Understand carbon accounting fundamentals to communicate effectively."
        ],
        "takeaways": [
          "Convert emissions reductions into dollar impacts to secure executive buy-in and capital for upgrades.",
          "Prioritize projects by emissions-to-financial-return to optimize investments in efficiency and renewables.",
          "Establish basic carbon accounting to validate sustainability claims and demonstrate ROI.",
          "Report sustainability outcomes in business metrics to align operations, procurement, and finance."
        ],
        "tags": [
          "sustainability",
          "carbon-accounting",
          "financial-value",
          "decarbonization",
          "energy-efficiency",
          "corporate-strategy",
          "PwC",
          "emissions-management"
        ]
      }
    },
    {
      "id": "BYtYm-xyKR8",
      "title": "Bringing In $251K A Year With 3 Jobs In The Bay Area",
      "channel": "CNBC Make It",
      "published_at": "2026-01-29T17:47:46.000Z",
      "url": "https://www.youtube.com/watch?v=BYtYm-xyKR8",
      "thumbnail": "https://i.ytimg.com/vi/BYtYm-xyKR8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Naseema McElroy, 44, is a labor and delivery nurse in Brentwood, California who also runs a personal finance brand called Financially Intentional. She earned $251K a year working three jobs in the Bay Area, documented a journey from nearly $1 million in debt in 2015 to becoming debt-free by 2017, and is featured in CNBC Make It's Millennial Money series.",
        "bullets": [
          "Naseema McElroy, 44, is a labor and delivery nurse and founder of Financially Intentional in Brentwood, CA.",
          "She brings in $251K annually by working three jobs in the Bay Area.",
          "By 2015 she had nearly $1 million in debt and began documenting her debt-payoff journey.",
          "She became debt-free by 2017.",
          "This profile is part of CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "For grid and data center decision-makers: individuals combining clinical work with a digital brand rely on consistent power and connectivity at home and work.",
          "High-earning, multi-job professionals in the Bay Area may place a premium on low-downtime services for content creation and remote work; consider resilience and SLAs accordingly.",
          "Content-driven personal finance brands imply demand for reliable cloud, storage, and streaming infrastructure—plan capacity and redundancy with creator use cases in mind."
        ],
        "tags": [
          "CNBCMakeIt",
          "MillennialMoney",
          "personal-finance",
          "debt-payoff",
          "FinanciallyIntentional",
          "nurse",
          "Bay-Area",
          "multiple-jobs",
          "Brentwood-CA"
        ]
      }
    },
    {
      "id": "t6y2cVNjCAw",
      "title": "GeForce Garage - Summer of RTX Community Build",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-29T14:01:25.000Z",
      "url": "https://www.youtube.com/watch?v=t6y2cVNjCAw",
      "thumbnail": "https://i.ytimg.com/vi/t6y2cVNjCAw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… GeForce Garage announces the winner of the Summer of RTX r/buildapc Community Build: u/JeffersonPutnam, who built a small-form-factor GeForce RTX 5090 rig. The description lists the full parts and links (PCPartPicker, host Dwight, and GeForce social channels) and highlights chassis, GPU, motherboard, CPU, RAM, PSU, and AIO choices.",
        "bullets": [
          "Winner: u/JeffersonPutnam — SFF GeForce RTX 5090 build.",
          "Key parts: Fractal Design Era 2, GeForce RTX 5090 Founders Edition, MSI MPG B850I Edge, Ryzen 7 9800X3D, 32GB DDR5-6000, Corsair SF1000, Corsair Nautilus 240 RS.",
          "PCPartPicker link provided for full winning system specs.",
          "Host: GeForce host Dwight (Twitter link included).",
          "Video description includes multiple GeForce social links and campaign hashtags (#GeForceGarage, #RTXOn, #GeForceRTX50)."
        ],
        "takeaways": [
          "Compact, high-end desktop builds (SFF) are using top-tier consumer GPUs like the RTX 5090, requiring careful attention to power delivery (build includes a 1000W SFX PSU).",
          "Active AIO cooling (Corsair Nautilus 240 RS) is part of this SFF high-performance configuration, underscoring cooling needs in cramped chassis.",
          "Platform choices (MSI B850I Edge + Ryzen 7 9800X3D) show pairing of high-performance CPUs with high-end GPUs in small footprints, relevant when assessing compatibility and thermal/power provisioning.",
          "Provided PCPartPicker and component list make it straightforward to evaluate exact component specs and integration for procurement or lab testing purposes."
        ],
        "tags": [
          "GeForceGarage",
          "RTX5090",
          "SFF",
          "PCBuild",
          "NVIDIA",
          "Ryzen",
          "FractalEra2",
          "CorsairSF1000",
          "AIO",
          "BuildAPC"
        ]
      }
    },
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy GenAI solutions that unlocked new revenue streams. The project leveraged Google Cloud infrastructure to streamline operations, boost developer productivity, and compress TTEC's digital transformation timeline.",
        "bullets": [
          "TTEC worked with Google Cloud Consulting to accelerate AI deployment.",
          "Rapid prototyping and deployment of GenAI solutions enabled new revenue opportunities.",
          "Google Cloud's infrastructure supported operational streamlining.",
          "Developer productivity was increased through the cloud and AI tooling.",
          "Consulting engagement compressed the digital transformation timeline and expanded business ambitions."
        ],
        "takeaways": [
          "Consider engaging cloud consulting partners to speed AI prototyping and shorten time-to-value.",
          "Invest in robust cloud infrastructure to improve developer productivity and operational efficiency.",
          "Rapid prototyping on cloud platforms can help launch new, revenue-generating services faster.",
          "Prioritize cloud-native and GenAI capabilities to compress digital transformation timelines and scale business ambitions."
        ],
        "tags": [
          "google-cloud",
          "ttec",
          "genai",
          "ai-deployment",
          "operational-efficiency",
          "customer-experience",
          "cloud-consulting",
          "developer-productivity",
          "digital-transformation"
        ]
      }
    },
    {
      "id": "gv6zK265OUE",
      "title": "Build your first GraphRAG Powered Agent! (No Graph Expert Required) | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-27T20:55:49.000Z",
      "url": "https://www.youtube.com/watch?v=gv6zK265OUE",
      "thumbnail": "https://i.ytimg.com/vi/gv6zK265OUE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The video shows how to build a GraphRAG-powered agent that helps AI reason over knowledge trapped in documents, PDFs, and wikis. It includes a live demo with real documents and sample code so teams can create a knowledge-graph-enabled agent in an afternoon without a six-month project or graph expertise.",
        "bullets": [
          "Explains how knowledge graphs unlock information in docs, PDFs, and wikis.",
          "Promises a hands-on live demo using real documents.",
          "Claims the build can be done in an afternoon, not months.",
          "Emphasizes no graph expert is required to follow the approach.",
          "Provides a sample notebook/code link for implementation."
        ],
        "takeaways": [
          "Enables AI to access and reason over internal documents (docs, PDFs, wikis) relevant to operations and policy.",
          "Short build time (an afternoon) lowers project timeline risk and speeds potential deployment.",
          "No need for specialized graph expertise reduces the barrier to adoption and training overhead.",
          "Leverages existing AI tools, so teams can reuse current investments and workflows.",
          "Sample code is provided to accelerate prototyping and evaluation."
        ],
        "tags": [
          "GraphRAG",
          "knowledge-graphs",
          "Databases-for-AI",
          "AWS",
          "AWS-Neptune",
          "agents",
          "RAG",
          "sample-code"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video shows Jo discovering how Copilot Groups makes route planning easy. It highlights the \"power of Copilot Groups\" in a short, practical demonstration.",
        "bullets": [
          "Focuses on route planning being made easy.",
          "Centers on Jo's discovery of Copilot Groups.",
          "Positions Copilot Groups as a helpful tool.",
          "Short, demonstration-style messaging.",
          "Uses hashtags: #copilot #microsoftcopilot #ai"
        ],
        "takeaways": [
          "If Copilot Groups simplify route planning (per the description), it could reduce the time spent coordinating field routes.",
          "Easier route planning may improve operational efficiency for teams that manage physical assets or technicians.",
          "Decision-makers should note the emphasis on a group-based Copilot feature for collaborative routing tasks.",
          "The content suggests evaluating Copilot Groups for route-related workflows where streamlined planning matters."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "copilot-groups",
          "route-planning",
          "jo"
        ]
      }
    }
  ]
}