{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-28T18:01:08.733Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy GenAI solutions on Google Cloud, streamlining operations and boosting developer productivity. The collaboration compressed TTEC's digital transformation timeline and unlocked entirely new revenue streams for their customer experience business.",
        "bullets": [
          "TTEC worked with Google Cloud Consulting to accelerate AI prototyping and deployment.",
          "The project leveraged GenAI and Google Cloud infrastructure.",
          "Outcomes included streamlined operations and improved developer productivity.",
          "The engagement compressed the digital transformation timeline.",
          "TTEC unlocked entirely new revenue streams and expanded business ambitions."
        ],
        "takeaways": [
          "Partnering with cloud consulting can compress AI deployment timelines for faster time-to-value.",
          "Deploying GenAI on a robust cloud platform can streamline operations and boost developer productivity.",
          "Rapid prototyping and deployment can enable new revenue streams—support experimentation capabilities.",
          "For customer-experience-focused organizations, combining GenAI with cloud infrastructure can expand service offerings."
        ],
        "tags": [
          "google cloud",
          "ttec",
          "genai",
          "ai deployment",
          "operational efficiency",
          "customer experience",
          "google cloud platform",
          "generative ai"
        ]
      }
    },
    {
      "id": "yUpQ9pWA9WE",
      "title": "Watch Live: Fed Chair Jerome Powell Holds News Conference | WSJ",
      "channel": "WSJ News",
      "published_at": "2026-01-27T20:49:24.000Z",
      "url": "https://www.youtube.com/watch?v=yUpQ9pWA9WE",
      "thumbnail": "https://i.ytimg.com/vi/yUpQ9pWA9WE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Federal Reserve Chair Jerome Powell speaks to reporters following the Federal Reserve's two-day policy-setting meeting. WSJ News streamed a live news conference of his remarks.",
        "bullets": [
          "Jerome Powell spoke to reporters after the Fed's two-day policy-setting meeting.",
          "The appearance was a live news conference.",
          "Coverage was provided by WSJ News.",
          "Remarks occurred immediately following the policy meeting.",
          "Video metadata includes #JeromePowell #Fed #WSJ"
        ],
        "takeaways": [
          "Monitor Powell's post-meeting remarks for official Fed guidance that may affect financing conditions.",
          "Use direct statements from the news conference to inform short-term budgeting, refinancing, or capital-planning decisions.",
          "Follow live coverage for timely information to update operational and risk assessments."
        ],
        "tags": [
          "JeromePowell",
          "Fed",
          "WSJ",
          "news conference",
          "policy meeting",
          "FederalReserve",
          "live",
          "reporters",
          "centralbank"
        ]
      }
    },
    {
      "id": "5CyVBSbHmbA",
      "title": "Year-end toolkit: Strengthening audit committee collaboration",
      "channel": "PwC US",
      "published_at": "2026-01-27T17:20:31.000Z",
      "url": "https://www.youtube.com/watch?v=5CyVBSbHmbA",
      "thumbnail": "https://i.ytimg.com/vi/5CyVBSbHmbA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This PwC year-end toolkit episode explains how finance teams can strengthen collaboration with audit committees amid a packed agenda and expanding oversight responsibilities. It covers streamlining reporting and addressing emerging issues such as AI oversight, enterprise risk management, transformation initiatives, cyber risk in the age of AI, and elevating proxy disclosures.",
        "bullets": [
          "Strengthening management/audit committee communication and collaboration.",
          "Key year-end accounting and reporting issues finance teams should be ready to address.",
          "Oversight of AI: assessing risks, opportunities, and necessary controls.",
          "Enhancing enterprise risk oversight and managing transformation initiatives.",
          "Navigating the evolving cyber risk landscape and elevating proxy disclosures."
        ],
        "takeaways": [
          "Ensure audit committees receive clear, concise updates on AI risks, controls, and related reporting implications to support oversight.",
          "Prioritize year-end reporting topics so finance can address audit-committee expectations efficiently during a crowded agenda.",
          "Integrate cyber risk considerations—especially those arising from AI—into enterprise risk and continuity planning for critical operations.",
          "Align transformation initiatives with enterprise risk oversight to demonstrate governance and control to the audit committee.",
          "Anticipate greater scrutiny of disclosures (including proxy disclosures) and prepare governance-ready materials for committee review."
        ],
        "tags": [
          "audit committee",
          "year-end reporting",
          "finance",
          "AI oversight",
          "enterprise risk",
          "cybersecurity",
          "proxy disclosures",
          "governance",
          "transformation initiatives"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The video highlights Jo discovering the power of Copilot Groups as a way to make route planning easy. It positions Copilot Groups as an AI-driven tool for simplifying planning tasks.",
        "bullets": [
          "Focus on route planning made easy",
          "Jo is shown discovering Copilot Groups",
          "Highlights Copilot Groups as a capability",
          "Branded with #copilot #microsoftcopilot #ai",
          "Short, demo-style presentation tone"
        ],
        "takeaways": [
          "Microsoft frames Copilot Groups as a tool to simplify route planning—decision-makers should note this positioning.",
          "If your operations involve routing or field crew planning, review Copilot Groups to determine potential relevance.",
          "Follow the Microsoft Copilot channel or product documentation for full feature details before evaluating adoption."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "copilot-groups",
          "route-planning",
          "navigation",
          "demo",
          "productivity"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI jest już częścią codziennego audytu — w podcaście Katarzyna Chojniak i Alicja Barska omawiają praktyczne zastosowania narzędzi takich jak AI Transaction Scoring Tool, Clara AI i platforma KPMG Clara, które umożliwiają analizę pełnych populacji danych, asystentów konwersacyjnych i zarządzanie badaniem w czasie rzeczywistym. Rozmowa porusza też wpływ technologii na rolę audytora, kluczowe kompetencje, wyzwania wdrożeniowe oraz kwestie bezpieczeństwa danych i regulacji.",
        "bullets": [
          "Wykorzystanie narzędzi AI (AI Transaction Scoring Tool, Clara AI, KPMG Clara) do analizy pełnych populacji i automatyzacji powtarzalnych zadań.",
          "Clara AI działa jako konwersacyjny asystent i zestaw wyspecjalizowanych agentów wspierających audyt.",
          "Przejście od próbkowania do analiz pełnych populacji wpływa na trafność i zakres badań.",
          "Technologie wspierają dokumentację, analizę ujawnień, komunikację z klientem i zarządzanie badaniem w czasie rzeczywistym.",
          "Omówione wyzwania obejmują adaptację audytorów, bezpieczeństwo danych, środowisko regulacyjne oraz potencjalne zagrożenia AI."
        ],
        "takeaways": [
          "Zadbaj o bezpieczne i zgodne z przepisami przechowywanie oraz transfer danych, bo AI w audycie operuje na pełnych populacjach danych.",
          "Umożliw dostęp do kompletnych zbiorów danych i integracji systemowej, aby wspierać analizy pełnopopulacyjne wykonywane przez narzędzia AI.",
          "Przygotuj infrastrukturę i procesy do współpracy z platformami zarządzającymi audytem w czasie rzeczywistym (np. KPMG Clara).",
          "Inwestuj w kompetencje personelu i zarządzanie zmianą, by maksymalizować korzyści z automatyzacji i współpracy z audytorami.",
          "Monitoruj wymagania regulacyjne i wdrażaj kontrole ryzyka związane z wykorzystaniem AI w procesach audytowych."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMG Clara",
          "Clara AI",
          "AI Transaction Scoring",
          "bezpieczeństwo danych",
          "regulacje",
          "innowacje",
          "pełna populacja",
          "audytorzy"
        ]
      }
    }
  ]
}