{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-31T07:04:20.063Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "6B29VDvPPzc",
      "title": "Build Knowledge Graph-powered AI Agents For Your Use Case | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-31T06:10:50.000Z",
      "url": "https://www.youtube.com/watch?v=6B29VDvPPzc",
      "thumbnail": "https://i.ytimg.com/vi/6B29VDvPPzc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This session demonstrates building a knowledge graph automatically from raw documents and connecting it to an AI agent so the agent can understand company-specific information. The end-to-end demo requires no graph expertise and shows practical steps to make agents that understand your business.",
        "bullets": [
          "Knowledge graphs address AI agents' lack of company-specific understanding.",
          "The session builds a knowledge graph automatically from raw documents.",
          "The graph is connected to an AI agent that can reason about your business.",
          "No graph queries, graph theory, or specialist expertise required.",
          "Includes a link to a prior episode comparing VectorDB vs GraphDB for agents."
        ],
        "takeaways": [
          "Knowledge graphs can make AI agents aware of internal company data and context.",
          "Automated graph construction lowers the barrier to deploying business-aware agents (no graph expertise needed).",
          "An end-to-end demo provides a practical blueprint for integrating documents, graphs, and agents in your environment."
        ],
        "tags": [
          "knowledge-graph",
          "AI-agents",
          "enterprise-AI",
          "document-ingestion",
          "graph-db",
          "vector-db",
          "Databases-for-AI",
          "AWS-Events"
        ]
      }
    },
    {
      "id": "z-X9MYi1Rr0",
      "title": "Leveraging tax credits and incentives for sustainability projects",
      "channel": "PwC US",
      "published_at": "2026-01-30T13:27:25.000Z",
      "url": "https://www.youtube.com/watch?v=z-X9MYi1Rr0",
      "thumbnail": "https://i.ytimg.com/vi/z-X9MYi1Rr0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Randa Barsoum, Tax Partner at PwC US, explains that energy incentives are only part of the tax picture for sustainability projects and highlights other, less obvious credits and incentives. She points to state and local abatements, location-based incentives, and R&D tax credits tied to innovation (for example, reimagining packaging or processes), and urges businesses to view sustainability investments through a broader lens to unlock tax value.",
        "bullets": [
          "Energy incentives are commonly considered but aren’t the whole story for sustainability tax planning.",
          "State and local abatements can provide material support for sustainability initiatives.",
          "Location-based incentives may influence site selection and project economics.",
          "R&D tax credits can apply to innovation efforts like redesigning packaging or processes.",
          "Viewing sustainability investments broadly can reveal meaningful tax value."
        ],
        "takeaways": [
          "Don’t assume energy incentives are the only tax levers—evaluate state/local abatements and location-based incentives when planning sites or upgrades.",
          "Consider R&D tax credits for process or packaging innovations that support operational sustainability.",
          "Integrate a broad tax-incentive review into project planning to improve overall project economics and investment case."
        ],
        "tags": [
          "sustainability",
          "tax credits",
          "incentives",
          "R&D",
          "state abatements",
          "location incentives",
          "PwC",
          "energy incentives",
          "sustainability strategy"
        ]
      }
    },
    {
      "id": "oQtkaHzUYlY",
      "title": "Copilot helps Christa find her inner star 🌟",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-29T18:33:49.000Z",
      "url": "https://www.youtube.com/watch?v=oQtkaHzUYlY",
      "thumbnail": "https://i.ytimg.com/vi/oQtkaHzUYlY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the clip frames Copilot as an empowering tool that helps Christa \"find the star within,\" using a stars metaphor. It includes a clear call to action inviting viewers to download and try Copilot via the link in the bio.",
        "bullets": [
          "Uses a stars metaphor to position Copilot as empowering.",
          "Features Christa as the subject of the short promotional clip.",
          "Clear call to action: \"Download & try Copilot.\"",
          "CTA directs viewers to a \"link in bio.\"",
          "No transcript or technical details are provided."
        ],
        "takeaways": [
          "A downloadable trial is offered—decision-makers can obtain Copilot directly for hands-on evaluation.",
          "Promotion via \"link in bio\" suggests social/mobile distribution; consider this channel when planning pilot rollouts.",
          "The content is promotional and lacks technical detail—seek product specs and security/compliance information before operational adoption.",
          "Short inspirational messaging could support internal adoption efforts, but technical validation remains necessary for grid/data center use."
        ],
        "tags": [
          "Copilot",
          "Microsoft Copilot",
          "Christa",
          "inspiration",
          "call-to-action",
          "download",
          "social",
          "stars"
        ]
      }
    },
    {
      "id": "BYtYm-xyKR8",
      "title": "Bringing In $251K A Year With 3 Jobs In The Bay Area",
      "channel": "CNBC Make It",
      "published_at": "2026-01-29T17:47:46.000Z",
      "url": "https://www.youtube.com/watch?v=BYtYm-xyKR8",
      "thumbnail": "https://i.ytimg.com/vi/BYtYm-xyKR8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Naseema McElroy, 44, is a labor and delivery nurse in Brentwood, California who also runs a personal finance brand called Financially Intentional. She accumulated nearly $1 million in debt by 2015, documented her payoff journey through her business, and became debt-free by 2017; the video’s title notes she brings in $251K a year working three jobs in the Bay Area.",
        "bullets": [
          "Naseema McElroy, 44, is a labor and delivery nurse and founder of Financially Intentional.",
          "She amassed nearly $1 million in debt by 2015 and documented her payoff journey publicly.",
          "By 2017 she was debt-free after starting her business to track her progress.",
          "Video title reports she earns $251K per year through three jobs in the Bay Area.",
          "This profile is part of CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "Growth of individual personal brands (e.g., Financially Intentional) can increase demand for reliable hosting and content-delivery services.",
          "Professionals combining multiple income streams and digital businesses may drive higher usage of cloud and platform services that data centers support.",
          "Data center and grid planners should track trends in creator/small-business hosting needs as part of capacity and resilience planning."
        ],
        "tags": [
          "Naseema McElroy",
          "labor and delivery nurse",
          "Financially Intentional",
          "debt payoff",
          "Millennial Money",
          "CNBC Make It",
          "Brentwood CA",
          "multiple income streams",
          "personal finance"
        ]
      }
    },
    {
      "id": "t6y2cVNjCAw",
      "title": "GeForce Garage - Summer of RTX Community Build",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-29T14:01:25.000Z",
      "url": "https://www.youtube.com/watch?v=t6y2cVNjCAw",
      "thumbnail": "https://i.ytimg.com/vi/t6y2cVNjCAw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, NVIDIA’s GeForce Garage highlights the Summer of RTX r/buildapc community build winner, u/JeffersonPutnam, who built a small-form-factor PC featuring a GeForce RTX 5090. The description lists the full parts used, including a Fractal Design Era 2 chassis, Ryzen 7 9800X3D, 32GB DDR5-6000, Corsair SF1000, and a Corsair Nautilus 240 RS AIO.",
        "bullets": [
          "Contest winner: u/JeffersonPutnam’s SFF GeForce RTX 5090 build.",
          "Key components linked via PCPartPicker: Fractal Era 2, RTX 5090 Founders Edition, MSI MPG B850I Edge, Ryzen 7 9800X3D.",
          "Memory and power: 32GB Teamgroup T-Create DDR5-6000 and Corsair SF1000 SFX PSU.",
          "Cooling: Corsair Nautilus 240 RS AIO used in the compact chassis.",
          "Video hosted by GeForce (host Dwight) with social and community links included."
        ],
        "takeaways": [
          "Latest-generation consumer GPUs (RTX 5090) in compact builds highlight the need to plan for higher power delivery when deploying dense or small-form-factor nodes.",
          "SFF chassis with high-end GPUs require robust cooling solutions—AIO cooling and careful airflow management are important for thermal reliability.",
          "Use of a 1000W SFX PSU indicates significant peak power requirements even in small systems; power provisioning and connector compatibility matter for integration.",
          "Modern DDR5-6000 memory paired with high-core CPUs (Ryzen 7 9800X3D) points to increased memory and CPU bandwidth expectations for workstation-class workloads."
        ],
        "tags": [
          "SFF",
          "RTX 5090",
          "GeForce Garage",
          "buildapc",
          "Fractal Era 2",
          "Ryzen 7 9800X3D",
          "DDR5-6000",
          "Corsair SF1000",
          "Community Build"
        ]
      }
    },
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy GenAI solutions that unlocked new revenue streams and streamlined operations. The company leveraged Google Cloud’s infrastructure to boost developer productivity and compress its digital transformation timeline, expanding what’s possible for the business.",
        "bullets": [
          "TTEC worked with Google Cloud Consulting to accelerate AI prototyping and deployment.",
          "Generative AI (GenAI) and Google Cloud infrastructure were central to the effort.",
          "The initiative aimed to streamline operations and increase developer productivity.",
          "Faster deployment translated into compressed digital transformation timelines.",
          "New AI-driven revenue streams were unlocked as a result of the partnership."
        ],
        "takeaways": [
          "Cloud platforms that support rapid GenAI prototyping can shorten time-to-market for new services.",
          "Partnering with cloud consulting can compress transformation timelines and reduce in-house ramp-up time.",
          "Investing in managed cloud infrastructure can boost developer productivity and operational efficiency.",
          "Supporting AI deployments can open new revenue opportunities tied to customer experience innovations."
        ],
        "tags": [
          "googlecloud",
          "ttec",
          "genai",
          "ai-deployment",
          "operational-efficiency",
          "developer-productivity",
          "digital-transformation",
          "cloud-consulting"
        ]
      }
    }
  ]
}