{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-23T21:40:51.277Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI is already a routine part of audit work at KPMG, with tools that automate repetitive tasks, analyse full data populations and support decision-making. In the podcast two KPMG audit leaders outline practical solutions (AI Transaction Scoring, Clara AI, KPMG Clara), client benefits, changing auditor roles, challenges in adoption, data security and regulatory considerations.",
        "bullets": [
          "AI tools help auditors process large datasets and shift from sampling to full-population analysis.",
          "Clara AI offers conversational assistance and specialised agents to support audit tasks and documentation.",
          "KPMG Clara provides real-time audit management and Clara for Clients improves client communication.",
          "Discussion covers auditor skill requirements, adoption challenges and potential AI-related risks.",
          "Data security and the regulatory environment are highlighted as key considerations for AI in audit."
        ],
        "takeaways": [
          "Full-population analysis enabled by AI can deliver more comprehensive audits of grid and data centre operations—expect deeper insight into asset and transaction data.",
          "Real-time audit platforms improve operational transparency, aiding uptime, incident response and compliance reporting.",
          "Prioritise data security and regulatory compliance when evaluating AI audit tools handling sensitive infrastructure information.",
          "Invest in AI literacy or partner with experienced auditors to ensure proper oversight and effective use of AI-driven audit outputs.",
          "Build governance and risk controls around AI use to address potential model or process-related vulnerabilities."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMG",
          "KPMG Clara",
          "Clara AI",
          "AI Transaction Scoring",
          "bezpieczeństwo danych",
          "innowacje",
          "regulacje"
        ]
      }
    },
    {
      "id": "6hu7hYLiu08",
      "title": "Get Step-By-Step Fixes with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-21T20:14:00.000Z",
      "url": "https://www.youtube.com/watch?v=6hu7hYLiu08",
      "thumbnail": "https://i.ytimg.com/vi/6hu7hYLiu08/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Copilot provides real-time visual support for home projects and repairs, offering step-by-step instructions and clear guidance. It can 'see what you see' to help troubleshoot issues like leaky pipes or overflowing washing machines.",
        "bullets": [
          "Real-time, visual assistance that follows what the user sees",
          "Delivers step-by-step instructions for repairs and projects",
          "Examples include plumbing (leaky pipes) and appliance issues (overflowing washing machines)",
          "Aims to provide clear, actionable guidance during troubleshooting",
          "Focused on on-the-spot support for home repair scenarios"
        ],
        "takeaways": [
          "Shows capability for real-time visual, step-by-step guidance that could be relevant to onsite maintenance teams",
          "Potential to reduce time spent diagnosing and repairing physical issues through guided instructions",
          "Because the tool 'sees what you see', evaluate data handling, privacy, and access controls before deployment",
          "Recommend piloting the approach on routine, low-risk maintenance tasks to validate effectiveness for operations"
        ],
        "tags": [
          "Copilot",
          "real-time support",
          "visual assistance",
          "step-by-step",
          "home repairs",
          "troubleshooting",
          "plumbing",
          "appliance repair",
          "Microsoft Copilot"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield has officially launched and the trailer highlights support for NVIDIA DLSS 4 with Multi Frame Generation. The footage was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 Multi Frame Generation 4X mode, and the description includes links to the game site and social channels.",
        "bullets": [
          "Official launch trailer for Arknights: Endfield features NVIDIA DLSS 4 with Multi Frame Generation.",
          "Arknights: Endfield is a 3D real-time strategy RPG where players act as the Endministrator exploring Talos-II.",
          "Trailer captured on GeForce RTX 5080 at 4K Ultra Settings with DLSS 4 Multi Frame Generation 4X Mode.",
          "Description provides links to the game website and multiple social channels (Twitter, YouTube, Instagram, Facebook, TikTok).",
          "Published by NVIDIA GeForce with calls to follow/subscribe to GeForce channels."
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is being showcased in a shipped game trailer, indicating adoption of DLSS4-enabled rendering workflows.",
          "Capture was performed on a GeForce RTX 5080 at 4K Ultra settings, demonstrating a use case for high-performance GPUs in real-time 4K rendering and capture.",
          "The trailer and description link to multiple social platforms, reflecting distributed content delivery and promotion across streaming/social channels."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "RTX5080",
          "4K",
          "NVIDIA",
          "GeForce",
          "RealTimeStrategy",
          "LaunchTrailer",
          "Gaming"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video highlights a giant carbon dioxide \"bubble\" battery that can store 20 megawatts of energy and holds energy for about 8 hours. The technology is framed as a multi-hour storage solution to smooth renewable generation fluctuations and help drive a global shift to clean energy.",
        "bullets": [
          "Giant bubble of carbon dioxide used as a battery",
          "Stores 20 megawatts of energy",
          "Provides about 8 hours of energy storage (from the title)",
          "Designed to smooth renewable energy fluctuations",
          "Presented as supporting a global shift to clean energy"
        ],
        "takeaways": [
          "8-hour, 20-MW scale storage addresses multi-hour renewable intermittency and load-shifting needs",
          "Relevant for capacity planning and backup strategies for grids and data centers integrating more renewables",
          "Framed as a tool to support decarbonization and increased renewable deployment"
        ],
        "tags": [
          "CO2 battery",
          "carbon dioxide",
          "energy storage",
          "8-hour storage",
          "20 MW",
          "renewables",
          "grid",
          "data center backup",
          "clean energy",
          "IEEE Spectrum"
        ]
      }
    }
  ]
}