{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-25T13:49:02.969Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "9vS5kvxbPMQ",
      "title": "My Porta-Potty Business Brings In $4.3M/Year",
      "channel": "CNBC Make It",
      "published_at": "2026-01-24T15:00:30.000Z",
      "url": "https://www.youtube.com/watch?v=9vS5kvxbPMQ",
      "thumbnail": "https://i.ytimg.com/vi/9vS5kvxbPMQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Daniel Tom, 31, owns Bay Area Sanitation and oversees a fleet of almost 2,000 portable toilets serving construction sites and events across the San Francisco Bay Area. The company reported $4.3 million in total income in 2025.",
        "bullets": [
          "Owner/operator: Daniel Tom, 31, of Bay Area Sanitation.",
          "Fleet size: almost 2,000 portable toilets.",
          "Service area: construction sites and events across the San Francisco Bay Area.",
          "Revenue: $4.3 million total income in 2025.",
          "Video produced by CNBC Make It with listed production and reporting credits."
        ],
        "takeaways": [
          "A fleet of ~2,000 units indicates substantial distributed asset management and logistical coordination needs.",
          "$4.3M annual income reflects a sizable revenue base that can support investments in operations and systems.",
          "Serving construction sites and events across a metro area implies geographically variable demand that benefits from efficient routing and capacity planning.",
          "The large, physical fleet presents opportunities for operational optimization through monitoring and data-driven maintenance to improve utilization."
        ],
        "tags": [
          "porta-potty",
          "portable toilets",
          "sanitation",
          "Bay Area",
          "small business",
          "entrepreneurship",
          "revenue",
          "CNBC Make It",
          "Daniel Tom",
          "Bay Area Sanitation"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this short video shows Jo discovering how Copilot Groups makes route planning easier. It presents Copilot Groups as a tool for simplifying routing and coordination.",
        "bullets": [
          "Focuses on route planning made easy with Copilot Groups.",
          "Features a character named Jo discovering the capability.",
          "Promotional content from the Microsoft Copilot channel.",
          "Uses hashtags: #copilot #microsoftcopilot #ai."
        ],
        "takeaways": [
          "Easier route planning could help optimize dispatch and maintenance routing for grid and data center operations.",
          "Copilot Groups may improve coordination among teams responsible for site visits and responses.",
          "Worth evaluating for operational planning workflows that rely on efficient routing and task grouping.",
          "Potential to support faster, more organized field operations during routine work or incident response."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "route-planning",
          "copilot-groups",
          "logistics",
          "field-operations",
          "productivity"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI w audycie jest przedstawiona jako już powszechne narzędzie wspierające powtarzalne czynności, analizę pełnych populacji danych i podejmowanie trafnych decyzji audytowych. Rozmówczynie opisują konkretne rozwiązania (AI Transaction Scoring Tool, Clara AI, platforma KPMG Clara), korzyści dla klientów oraz wyzwania związane z wdrożeniem, kompetencjami audytorów i bezpieczeństwem danych.",
        "bullets": [
          "AI wspiera analizę pełnych populacji zamiast tradycyjnego próbkowania.",
          "Konkretne narzędzia: AI Transaction Scoring Tool, konwersacyjny asystent Clara AI i platforma KPMG Clara.",
          "AI pomaga w dokumentacji, analizie ujawnień i zarządzaniu badaniem w czasie rzeczywistym.",
          "Clara for Clients usprawnia komunikację z klientem podczas procesu audytu.",
          "W dyskusji poruszono też wyzwania wdrożeniowe, bezpieczeństwo danych i aspekty regulacyjne."
        ],
        "takeaways": [
          "Przygotuj dane i governance — audyty mogą obejmować pełne populacje danych, więc jakość i dostępność danych ma bezpośredni wpływ na przebieg badania.",
          "Oczekuj szybszych i bardziej szczegółowych wyników audytu — real‑time reporting i analiza pełnych danych mogą skrócić czas decyzji operacyjnych.",
          "Zadbaj o bezpieczeństwo i zgodność — integracja z platformami audytowymi wymaga mocnych zabezpieczeń i zgodności z regulacjami.",
          "Upewnij się, że zespół potrafi współpracować z narzędziami AI — kompetencje w pracy z technologiami i interpretacji wyników stają się kluczowe."
        ],
        "tags": [
          "AI",
          "audyt",
          "KPMG",
          "KPMG Clara",
          "Clara AI",
          "analiza danych",
          "bezpieczeństwo danych",
          "innowacje",
          "komunikacja z klientem"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield has launched and the trailer highlights NVIDIA DLSS 4 with Multi Frame Generation. The 4K trailer was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 Multi Frame Generation 4X Mode, and the game is described as a 3D real-time strategy RPG where players act as the Endministrator exploring Talos-II.",
        "bullets": [
          "Launch trailer emphasizes NVIDIA DLSS 4 with Multi Frame Generation (4X Mode).",
          "Captured on GeForce RTX 5080 at 4K Ultra settings.",
          "Game type: 3D real-time strategy RPG; player role is the Endministrator on Talos-II.",
          "Official links to game site and social channels are provided by NVIDIA GeForce.",
          "Published by NVIDIA GeForce on Jan 21, 2026."
        ],
        "takeaways": [
          "Hardware compatibility: DLSS 4 content requires NVIDIA GPUs that support DLSS 4 (example capture used GeForce RTX 5080); ensure test and deployment hardware supports the feature.",
          "Performance benchmarking: Include DLSS 4 Multi Frame Generation modes (e.g., 4X Mode) in performance tests for high-resolution workloads to assess throughput and quality trade-offs.",
          "Driver and SDK validation: Validate NVIDIA driver and DLSS SDK integration across systems used for capture, streaming, or visualization to ensure consistent results.",
          "Storage and delivery impact: 4K assets captured with DLSS 4 may increase storage, transcoding, and network requirements—plan capacity accordingly."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "RTX5080",
          "4K",
          "NVIDIA",
          "GeForce",
          "RTS",
          "RPG",
          "GameLaunch"
        ]
      }
    }
  ]
}