{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-22T07:00:46.209Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "t33Fh1JZVgA",
      "title": "AI at Speed: From Investment to Performance",
      "channel": "PwC US",
      "published_at": "2026-01-21T22:48:29.000Z",
      "url": "https://www.youtube.com/watch?v=t33Fh1JZVgA",
      "thumbnail": "https://i.ytimg.com/vi/t33Fh1JZVgA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, at the 2026 World Economic Forum in Davos PwC US Senior Partner and CEO Paul Griggs spoke with CNBC’s Emma Crosby about how organizations are moving from AI exploration to execution. They emphasize evaluating AI through investment discipline, measurable performance and value, moving early with intentional capital allocation, and designing operating models that remain resilient without sacrificing performance.",
        "bullets": [
          "Discussion held at WEF 2026 in Davos between Paul Griggs (PwC US) and CNBC’s Emma Crosby.",
          "Focus on shifting from AI exploration to execution with investment discipline.",
          "Leaders are placing capital with intent to capture early advantages.",
          "Emphasis on operating models that balance resilience and performance.",
          "AI is presented as delivering measurable outcomes now while enabling future transformation."
        ],
        "takeaways": [
          "Prioritize AI investments that demonstrate measurable ROI and performance metrics for capacity and cost planning.",
          "Allocate capital proactively to targeted AI initiatives that can deliver near-term outcomes and scale.",
          "Design data center and grid operating models for resilience while preserving throughput and latency targets.",
          "Ensure governance and investment discipline around AI projects to align spending with measurable business value."
        ],
        "tags": [
          "AI",
          "investment",
          "performance",
          "measurable value",
          "operating models",
          "resilience",
          "Davos 2026",
          "PwC",
          "CNBC",
          "enterprise AI"
        ]
      }
    },
    {
      "id": "6hu7hYLiu08",
      "title": "Get Step-By-Step Fixes with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-21T20:14:00.000Z",
      "url": "https://www.youtube.com/watch?v=6hu7hYLiu08",
      "thumbnail": "https://i.ytimg.com/vi/6hu7hYLiu08/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Copilot offers real-time visual support for home projects and repairs. It can see what you see and provide clear, step-by-step instructions for issues like leaky pipes or overflowing washing machines.",
        "bullets": [
          "Provides real-time visual assistance for home repairs.",
          "Delivers step-by-step instructions tailored to what the user shows.",
          "Targets common household issues (e.g., plumbing, appliances).",
          "Focuses on clear, actionable guidance to help users perform repairs.",
          "Designed for on-the-spot troubleshooting using user visuals."
        ],
        "takeaways": [
          "Visual remote troubleshooting shown here can be applied to on-site equipment diagnostics to accelerate fault resolution.",
          "Step-by-step, visual guidance could standardize repair procedures and reduce human error during maintenance.",
          "Real-time assistance may decrease unnecessary specialist dispatches, improving resource allocation and response times.",
          "Such guidance tools can augment field technician training and support, shortening onboarding and improving first-time fix rates."
        ],
        "tags": [
          "Copilot",
          "real-time-support",
          "visual-assistance",
          "home-repairs",
          "troubleshooting",
          "step-by-step",
          "remote-guidance",
          "maintenance",
          "appliance-repair"
        ]
      }
    },
    {
      "id": "IKkVWKdumHw",
      "title": "re:Invent 2025 - Chalk Talk - Origin management for multi-region applications with Amazon CloudFront",
      "channel": "AWS Events",
      "published_at": "2026-01-21T17:49:36.000Z",
      "url": "https://www.youtube.com/watch?v=IKkVWKdumHw",
      "thumbnail": "https://i.ytimg.com/vi/IKkVWKdumHw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this session explains origin management patterns using Amazon CloudFront to build secure, resilient content delivery systems. It covers automatic failover with CloudFront and Route 53, granular origin routing with CloudFront Functions, origin security options (S3 with Origin Access Control and VPC private origins), hybrid integration via AWS Direct Connect, and using Origin Shield to optimize cache performance and reduce origin load.",
        "bullets": [
          "Automatic failover patterns using CloudFront plus Route 53",
          "Granular origin routing implemented with CloudFront Functions",
          "Securing origins: S3 with Origin Access Control (OAC) and VPC private origins",
          "Hybrid integration of on-premises infrastructure using AWS Direct Connect",
          "Performance optimization and origin load reduction with Origin Shield"
        ],
        "takeaways": [
          "Improved availability: automatic failover patterns help maintain service continuity across regions",
          "Greater control: CloudFront Functions enable fine-grained routing decisions at the edge",
          "Stronger origin security: OAC and VPC private origins reduce direct exposure of backend systems",
          "Hybrid readiness: Direct Connect supports integrating existing data centers with CloudFront",
          "Lower origin load and better cache efficiency via Origin Shield, reducing infrastructure strain"
        ],
        "tags": [
          "CloudFront",
          "Origin Management",
          "Route53",
          "CloudFront Functions",
          "Origin Shield",
          "S3 OAC",
          "VPC Private Origins",
          "Direct Connect",
          "Hybrid Architecture",
          "Content Delivery"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer - Launching January 22!",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield launches worldwide on January 22 and features NVIDIA DLSS 4 with Multi Frame Generation. The trailer was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 Multi Frame Generation 4X mode.",
        "bullets": [
          "Arknights: Endfield is a 3D real-time strategy RPG; players act as the Endministrator exploring Talos-II.",
          "Worldwide release date: January 22.",
          "Trailer highlights NVIDIA DLSS 4 with Multi Frame Generation (link to NVIDIA announcement provided).",
          "Captured on GeForce RTX 5080 at 4K Ultra with DLSS 4 Multi Frame Generation 4X mode.",
          "Description includes official Arknights: Endfield website and social channel links."
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is being showcased in commercial game capture—ensure infrastructure can support NVIDIA's latest inference/graphics features.",
          "Reference to GeForce RTX 5080 for 4K capture indicates demand for high-performance GPUs in content capture and QA workflows.",
          "4K Ultra capture with DLSS MFG 4X mode suggests planning for increased GPU performance and compatibility in production environments.",
          "Deployment may require updated NVIDIA drivers and SDKs to support DLSS 4 features—factor software updates into maintenance schedules."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "RTX5080",
          "4K",
          "NVIDIAGeForce",
          "RTSRPG",
          "ReleaseJan22",
          "GameCapture"
        ]
      }
    },
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The video shows how Rate Insurance boosts agent efficiency with Agentforce and Gemini. The description also includes a link to learn more about the Google Cloud and Salesforce partnership.",
        "bullets": [
          "Shows Rate Insurance boosting agent efficiency using Agentforce and Gemini.",
          "Includes a link to the Google Cloud–Salesforce partnership resource.",
          "Invites viewers to watch the video demonstration.",
          "No transcript is available in the provided content."
        ],
        "takeaways": [
          "Review the Google Cloud–Salesforce partnership link for details on cloud–CRM collaboration referenced in the video.",
          "Consider whether Agentforce and Gemini align with your organization’s agent workflows and cloud integration requirements.",
          "Use the video as a concise customer example when evaluating agent-facing cloud/AI solutions."
        ],
        "tags": [
          "Rate Insurance",
          "Agentforce",
          "Gemini",
          "Google Cloud",
          "Salesforce",
          "agent efficiency",
          "cloud-partnership",
          "insurance"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Charly Stoever, 35, is a financial coach who has spent the last 18 months living out of two suitcases and living rent-free in Portland by pet sitting full time. She earns about $60,000 a year and is profiled in CNBC Make It's Millennial Money series.",
        "bullets": [
          "Charly Stoever, 35, is a financial coach featured by CNBC Make It.",
          "She lives rent-free in Portland, Oregon by pet sitting full time.",
          "Has been living out of two suitcases for the past 18 months.",
          "Brings in approximately $60,000 per year from this lifestyle.",
          "Profile appears in CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "Workforce flexibility matters: employees increasingly prioritize mobility and low fixed living costs—consider how flexible schedules or remote roles could broaden talent pools.",
          "Nontraditional compensation/benefits: offering short-term housing support, stipends, or remote-work options can be attractive alternatives to higher salaries when recruiting niche technical staff.",
          "Operational access and security: if hiring more itinerant or remote personnel, ensure robust remote monitoring, standardized onboarding, and secure access policies for critical facilities.",
          "Retention and recruiting messaging: highlight flexibility and lifestyle-friendly perks in recruitment to appeal to candidates who value mobility and cost-saving living arrangements."
        ],
        "tags": [
          "CNBCMakeIt",
          "MillennialMoney",
          "pet sitting",
          "rent-free",
          "financial coach",
          "digital nomad",
          "Portland",
          "side income",
          "minimalism"
        ]
      }
    },
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Dr. Anna Chacon, 39, is a Miami-based dermatologist who runs her own private practice and reportedly earns $900,000 a year (per the video title). Her stated net worth is about $6 million, made up of $3.2 million in investments, a $1.9 million home, and a $1.1 million office building.",
        "bullets": [
          "Dr. Anna Chacon, age 39, dermatologist in Miami, FL.",
          "Operates a private dermatology practice.",
          "Video title states annual earnings of $900,000.",
          "Total net worth reported at approximately $6 million.",
          "Net worth breakdown: $3.2M investments, $1.9M home, $1.1M office building."
        ],
        "takeaways": [
          "Private medical practices can be associated with ownership of office real estate—these locations may require reliable power, connectivity, and physical security.",
          "High-income healthcare professionals who maintain on-site offices may have elevated expectations for uptime and data protection for electronic medical records.",
          "Concentrations of wealth and investment in a single professional client type suggest potential demand for premium, reliable services tailored to small medical office needs.",
          "When evaluating customer segments, consider that independent medical offices represent a mix of real estate, IT, and regulatory needs relevant to grid and data center planning."
        ],
        "tags": [
          "dermatologist",
          "private practice",
          "Miami",
          "net worth",
          "investments",
          "real estate",
          "office building",
          "high income",
          "CNBC Make It",
          "personal finance"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This giant bubble of carbon dioxide is described as a battery capable of storing 20 megawatts of energy. The description says it can help buffer fluctuations in renewable generation and support a global shift to clean energy.",
        "bullets": [
          "Giant CO2 \"bubble\" battery reported to store 20 megawatts of energy.",
          "Designed to address fluctuations in renewable energy supply.",
          "Framed as a technology to support the transition to clean energy worldwide.",
          "Coverage associated with IEEE Spectrum and related tech/innovation themes."
        ],
        "takeaways": [
          "A 20 MW storage capacity suggests potential for large-scale grid or site-level load balancing.",
          "Could help manage renewable intermittency and improve reliability for grids and data centers.",
          "Decision-makers should assess integration and compatibility with existing infrastructure and decarbonization plans.",
          "Track published technical details and deployment updates (e.g., IEEE Spectrum) before considering adoption."
        ],
        "tags": [
          "ieee",
          "ieeespectrum",
          "tech",
          "innovation",
          "energy",
          "battery",
          "CO2",
          "cleanenergy",
          "renewables",
          "storage"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this KPMG ON AIR podcast episode with Monika Palmowska and Jakub Roszkiewicz explores how AI is already changing transfer pricing—covering profitability monitoring, comparative analyses and automation of documentation—while addressing risks like data security and RODO. The hosts argue AI will strengthen rather than replace tax advisors, outline implementation building blocks (ERP integration, Digital Gateway, process reorganization) and suggest practical first steps for adoption.",
        "bullets": [
          "Zastosowania AI: monitorowanie rentowności, benchmarki porównawcze, automatyzacja dokumentacji cen transferowych.",
          "AI jako wsparcie doradców podatkowych — nie zastąpi, ale zwiększy efektywność i rozwój kompetencji młodszych pracowników.",
          "Główne ryzyka: dane, bezpieczeństwo, RODO oraz zjawisko „halucynacji” modeli AI.",
          "Digital Gateway wskazany jako bezpieczne środowisko do pracy z AI; konieczność integracji z ERP i inteligentnych benchmarków.",
          "Wdrożenie: zacząć od uporządkowania procesów, wyznaczenia pierwszych kroków i budowy filarów transformacji."
        ],
        "takeaways": [
          "Zabezpiecz środowisko AI (np. Digital Gateway) przed uruchomieniem obciążeń związanych z danymi transferowymi.",
          "Priorytetem jest zgodność z RODO i zarządzanie ryzykiem danych przy korzystaniu z modeli AI.",
          "Planuj integrację AI z ERP i narzędziami benchmarkowymi, by uzyskać wartościowe, automatyczne analizy.",
          "Uporządkuj procesy i rozwijaj kompetencje zespołu — AI będzie wspierać doradców, nie ich zastępować."
        ],
        "tags": [
          "podatki",
          "AI",
          "ceny transferowe",
          "transfer pricing",
          "automatyzacja",
          "RODO",
          "Digital Gateway",
          "ERP",
          "bezpieczeństwo",
          "benchmarki"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video encourages users to stack small wins with Microsoft Copilot to keep momentum when tackling workouts, projects, or personal goals. It frames Copilot as a tool for sustaining progress and building consistency.",
        "bullets": [
          "Positions Copilot as a tool to keep momentum.",
          "Applies to workouts, projects, and personal goals.",
          "Emphasizes stacking small wins to sustain progress.",
          "Focuses on building consistency and ongoing progress."
        ],
        "takeaways": [
          "So what: Copilot’s emphasis on sustaining momentum suggests it could help teams keep long-running operational or upgrade projects moving forward.",
          "So what: Breaking work into small, incremental wins can aid change management and maintain staff engagement during infrastructure initiatives.",
          "So what: Tools that reinforce consistency may reduce the need for constant oversight of routine tasks and checkpoints.",
          "So what: Supporting incremental progress can contribute to steadier timelines and improved reliability for grid/data center projects."
        ],
        "tags": [
          "Microsoft Copilot",
          "productivity",
          "small wins",
          "momentum",
          "goals",
          "projects",
          "workouts",
          "AI assistant"
        ]
      }
    }
  ]
}