{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-31T15:46:05.931Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "6dvtsIIrN3Q",
      "title": "Would you go to an in-person dating app event?",
      "channel": "CNBC Make It",
      "published_at": "2026-01-31T15:00:23.000Z",
      "url": "https://www.youtube.com/watch?v=6dvtsIIrN3Q",
      "thumbnail": "https://i.ytimg.com/vi/6dvtsIIrN3Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Gen Z — the online generation — is increasingly struggling with loneliness, and dating app Hinge is stepping in to help. Hinge announced a $1 million fund for social groups in New York, Los Angeles and London to put on free or affordable social events for young people as a global expansion of its One More Hour social impact initiative.",
        "bullets": [
          "Gen Z increasingly faces loneliness, per the description.",
          "Hinge launched a $1 million fund to support social groups.",
          "Target cities: New York, Los Angeles and London.",
          "Funds will support free or affordable social events for young people.",
          "This is a global expansion of Hinge’s One More Hour initiative."
        ],
        "takeaways": [
          "Corporate-funded in-person events in major cities could create localized short-term increases in demand for reliable power and connectivity at event venues.",
          "Event-related AV, charging and networking needs are likely concentrated in NYC, LA and London—useful for urban capacity planning.",
          "Consider coordinating with venue partners for temporary load and connectivity support to prevent service disruptions during pop-up events.",
          "Track consumer-driven event initiatives as a signal for near-term, localized infrastructure demand in key metropolitan areas."
        ],
        "tags": [
          "Gen Z",
          "loneliness",
          "Hinge",
          "dating apps",
          "One More Hour",
          "social events",
          "New York",
          "Los Angeles",
          "London",
          "social impact"
        ]
      }
    },
    {
      "id": "ZSzEg7bYlAI",
      "title": "Caroline Harvey on the Cam",
      "channel": "Team USA",
      "published_at": "2026-01-31T13:22:24.000Z",
      "url": "https://www.youtube.com/watch?v=ZSzEg7bYlAI",
      "thumbnail": "https://i.ytimg.com/vi/ZSzEg7bYlAI/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this Team USA video is titled \"Caroline Harvey on the Cam\" and carries the playful caption \"This is so Caroline Harvey coded 😂\" with the hashtag #WinterOlympics. No transcript is available, so specific visual or verbal details of the clip are not provided.",
        "bullets": [
          "No transcript is available for this video.",
          "Published by Team USA under the title \"Caroline Harvey on the Cam.\"",
          "Caption reads: \"This is so Caroline Harvey coded 😂\", suggesting a humorous tone.",
          "Included hashtag: #WinterOlympics.",
          "Features on-camera content focused on athlete Caroline Harvey (no further details given)."
        ],
        "takeaways": [
          "Expect traffic surges around major sporting events like the Winter Olympics; ensure elastic scaling and CDN capacity to handle spikes.",
          "Optimize for low-latency delivery and adequate peering/POP presence to support short-form social video consumption.",
          "Use edge caching and adaptive bitrate streaming to reduce origin load and maintain viewer experience for high-demand clips.",
          "Maintain robust DDoS mitigation, failover, and monitoring around high-profile posts to protect availability.",
          "Ensure power redundancy and operational monitoring for any on-prem encoding/ingest systems used by content producers."
        ],
        "tags": [
          "Caroline Harvey",
          "Team USA",
          "WinterOlympics",
          "athlete",
          "on-camera",
          "social video",
          "behind-the-scenes",
          "humor",
          "short clip"
        ]
      }
    },
    {
      "id": "6B29VDvPPzc",
      "title": "Build Knowledge Graph-powered AI Agents For Your Use Case | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-31T06:10:50.000Z",
      "url": "https://www.youtube.com/watch?v=6B29VDvPPzc",
      "thumbnail": "https://i.ytimg.com/vi/6B29VDvPPzc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this session shows how to automatically build a knowledge graph from raw documents and connect it to an AI agent so the agent can understand your company's data. The presenters demonstrate an end-to-end build that requires no graph expertise.",
        "bullets": [
          "Knowledge graphs are presented as the solution to AI agents not understanding company-specific information.",
          "Session demonstrates automatic construction of a knowledge graph from raw documents.",
          "The knowledge graph is connected to an AI agent so it can query and understand your business.",
          "No graph theory or query expertise required to follow the end-to-end build.",
          "Includes a link to a related episode comparing VectorDB vs GraphDB for generative AI agents."
        ],
        "takeaways": [
          "Knowledge graphs can make AI agents useful for enterprise-specific queries and workflows.",
          "Automated graph-building reduces the need to hire or train specialist graph engineers.",
          "Consider piloting an end-to-end knowledge-graph-to-agent workflow to evaluate fit for your organization.",
          "Watch the demo to judge integration simplicity and potential business impact before broader adoption."
        ],
        "tags": [
          "knowledge-graph",
          "AI-agents",
          "databases-for-AI",
          "enterprise-knowledge",
          "document-ingestion",
          "no-graph-expertise",
          "end-to-end-demo",
          "AWS-Events",
          "vectorDB",
          "graphDB"
        ]
      }
    },
    {
      "id": "z-X9MYi1Rr0",
      "title": "Leveraging tax credits and incentives for sustainability projects",
      "channel": "PwC US",
      "published_at": "2026-01-30T13:27:25.000Z",
      "url": "https://www.youtube.com/watch?v=z-X9MYi1Rr0",
      "thumbnail": "https://i.ytimg.com/vi/z-X9MYi1Rr0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Randa Barsoum of PwC US explains that energy tax credits are just one piece of the sustainability-incentives picture and highlights other opportunities such as state and local abatements, location-based incentives, and R&D tax credits tied to innovation. The core message: viewing sustainability investments through a broader tax lens can unlock meaningful tax value.",
        "bullets": [
          "Energy incentives are common but not the only tax value for sustainability projects.",
          "State and local abatements can provide additional financial support.",
          "Location-based incentives may influence siting and investment decisions.",
          "R&D tax credits can apply to innovation efforts (e.g., reimagining packaging or processes).",
          "Broad tax planning around sustainability investments can unlock meaningful tax value."
        ],
        "takeaways": [
          "Don’t rely solely on federal energy credits — evaluate state and local abatements when planning site selection and capital investments.",
          "Assess location-based incentives as part of your facility-siting and expansion strategy.",
          "Consider R&D tax credits for process or systems innovation that improve efficiency or sustainability.",
          "Integrate tax teams early in sustainability project planning to identify and capture the full range of available incentives."
        ],
        "tags": [
          "sustainability",
          "tax credits",
          "incentives",
          "R&D tax credit",
          "state and local abatements",
          "location-based incentives",
          "PwC",
          "tax strategy",
          "energy incentives"
        ]
      }
    },
    {
      "id": "oQtkaHzUYlY",
      "title": "Copilot helps Christa find her inner star 🌟",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-29T18:33:49.000Z",
      "url": "https://www.youtube.com/watch?v=oQtkaHzUYlY",
      "thumbnail": "https://i.ytimg.com/vi/oQtkaHzUYlY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video uses a star-filled sky metaphor to show Copilot helping Christa \"find the star within.\" It invites viewers to download and try Copilot via the link in the bio.",
        "bullets": [
          "Uses a star-filled sky metaphor.",
          "Positions Copilot as helping Christa discover her \"inner star.\"",
          "Clear call-to-action: download and try Copilot (link in bio).",
          "Short, inspirational tone with an emoji-led visual cue."
        ],
        "takeaways": [
          "Use concise, uplifting narratives to position AI tools as empowering — this can resonate with diverse audiences.",
          "Always include a prominent, easy CTA (e.g., link in bio) to convert interest into trials.",
          "Short-form, metaphor-driven content can be an effective way to communicate value quickly.",
          "Keep messaging human and simple to lower friction for adoption and trial."
        ],
        "tags": [
          "Copilot",
          "Microsoft",
          "Christa",
          "AI assistant",
          "inspiration",
          "stars",
          "download",
          "promo",
          "short video"
        ]
      }
    },
    {
      "id": "BYtYm-xyKR8",
      "title": "Bringing In $251K A Year With 3 Jobs In The Bay Area",
      "channel": "CNBC Make It",
      "published_at": "2026-01-29T17:47:46.000Z",
      "url": "https://www.youtube.com/watch?v=BYtYm-xyKR8",
      "thumbnail": "https://i.ytimg.com/vi/BYtYm-xyKR8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Naseema McElroy, 44, is a labor and delivery nurse in Brentwood, California who also runs a personal finance brand called Financially Intentional. After accumulating nearly $1 million in debt in 2015, she documented her debt-payoff journey, became debt-free by 2017, and the video notes she brings in $251K a year across three Bay Area jobs.",
        "bullets": [
          "Naseema McElroy, 44, is a labor and delivery nurse and founder of Financially Intentional.",
          "Based in Brentwood, California; the title states she earns $251K/year from three jobs in the Bay Area.",
          "Accumulated nearly $1 million in debt in 2015 and documented her debt-payoff journey.",
          "Became debt-free by 2017 after starting her business to share financial progress.",
          "This profile is part of CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "Personal finance creators produce regular digital content (documenting journeys), which relies on reliable content hosting and delivery infrastructure.",
          "Multi-job, high-earning professionals in the Bay Area represent a user base that may demand resilient connectivity and consistent service availability.",
          "Content-driven small businesses benefit from predictable, low-latency platforms for video and social distribution—important factors when sizing capacity and SLAs.",
          "Local creator and professional markets can drive steady usage patterns; plan for sustained demand rather than only peak events."
        ],
        "tags": [
          "Naseema McElroy",
          "Financially Intentional",
          "labor and delivery nurse",
          "debt payoff",
          "Brentwood CA",
          "Bay Area",
          "3 jobs",
          "251K/year",
          "CNBC Make It",
          "Millennial Money"
        ]
      }
    },
    {
      "id": "t6y2cVNjCAw",
      "title": "GeForce Garage - Summer of RTX Community Build",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-29T14:01:25.000Z",
      "url": "https://www.youtube.com/watch?v=t6y2cVNjCAw",
      "thumbnail": "https://i.ytimg.com/vi/t6y2cVNjCAw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… NVIDIA’s GeForce Garage video highlights the winning entry of the Summer of RTX r/buildapc Community Build contest: a small-form-factor system built by u/JeffersonPutnam featuring a GeForce RTX 5090 Founders Edition. The build uses a Fractal Design Era 2 chassis with a Ryzen 7 9800X3D, MSI MPG B850I Edge motherboard, 32GB DDR5-6000, Corsair SF1000 PSU and Corsair Nautilus 240 RS AIO.",
        "bullets": [
          "Winner: u/JeffersonPutnam’s SFF GeForce RTX 5090 build for the Summer of RTX community contest.",
          "Key components listed: RTX 5090 Founders Edition, Fractal Design Era 2 chassis, Ryzen 7 9800X3D, MSI MPG B850I Edge.",
          "Memory and power: 32GB Teamgroup T-Create DDR5-6000 and Corsair SF1000 SFX power supply.",
          "Cooling: Corsair Nautilus 240 RS AIO used in the compact build.",
          "Video hosted by GeForce (Dwight) with parts list available on PCPartPicker."
        ],
        "takeaways": [
          "RTX 5090 Founders Edition is being showcased in consumer builds—organizations evaluating RTX50-series hardware should note its adoption in small-form-factor systems.",
          "Power requirements: the use of a Corsair SF1000 SFX PSU highlights the need for high-output compact power solutions when deploying high-end GPUs in space-constrained enclosures.",
          "Cooling considerations: inclusion of a 240mm AIO in an SFF chassis underscores the importance of adequate liquid cooling or airflow planning for dense or compact deployments.",
          "Form-factor constraints: the Fractal Design Era 2 chassis example illustrates potential integration and layout challenges when fitting flagship GPUs into small enclosures.",
          "Ecosystem interest: community-driven showcases like this indicate active consumer engagement with the RTX50 series and associated component compatibility testing."
        ],
        "tags": [
          "GeForceGarage",
          "SummerOfRTX",
          "RTX5090",
          "FoundersEdition",
          "SFF",
          "FractalEra2",
          "Ryzen7_9800X3D",
          "Corsair_SF1000"
        ]
      }
    },
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy AI solutions, unlocking entirely new revenue streams. They leveraged GenAI and Google Cloud's infrastructure to streamline operations, boost developer productivity, and compress their digital transformation timeline.",
        "bullets": [
          "TTEC worked with Google Cloud Consulting to accelerate AI prototyping and deployment.",
          "GenAI and Google Cloud infrastructure were used to streamline operations.",
          "Developer productivity was improved through the platform and tooling.",
          "The partnership compressed TTEC’s digital transformation timeline.",
          "Efforts unlocked new revenue streams and expanded business ambitions."
        ],
        "takeaways": [
          "Robust cloud infrastructure that supports GenAI can accelerate AI deployment and shorten time-to-value.",
          "Engaging cloud consulting services can compress digital transformation timelines.",
          "Boosting developer productivity via cloud platforms speeds delivery of AI-driven capabilities.",
          "AI-driven initiatives deployed on scalable cloud infrastructure can enable new revenue opportunities."
        ],
        "tags": [
          "googlecloud",
          "ttec",
          "genai",
          "aideployment",
          "operationalefficiency",
          "customerexperience",
          "googlecloudplatform",
          "generativeai"
        ]
      }
    }
  ]
}