{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-28T07:47:28.603Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "gv6zK265OUE",
      "title": "Build your first GraphRAG Powered Agent! (No Graph Expert Required) | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-27T20:55:49.000Z",
      "url": "https://www.youtube.com/watch?v=gv6zK265OUE",
      "thumbnail": "https://i.ytimg.com/vi/gv6zK265OUE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This session demonstrates how to build a knowledge graph in an afternoon using the same AI tools teams already use, featuring a live demo with real documents. It frames the approach as practical and fast—no six-month project required.",
        "bullets": [
          "Knowledge in docs, PDFs, and wikis is often inaccessible to AI models.",
          "Knowledge graphs can unlock that trapped information for reasoning.",
          "Many teams avoid building graphs because they seem like massive undertakings.",
          "The session shows a hands-on build in an afternoon using existing AI tooling.",
          "Includes a live demo with real documents and emphasizes no long project timeline."
        ],
        "takeaways": [
          "Faster knowledge-graph builds can reduce project timelines and speed time-to-value for AI initiatives.",
          "Using existing AI tools lowers the integration and adoption barrier for your team.",
          "Turning operational documents into queryable knowledge can make AI-driven insights more useful for decision-making.",
          "A practical, demo-driven approach supports low-risk pilots before larger rollouts."
        ],
        "tags": [
          "knowledge-graph",
          "AI",
          "documents",
          "PDFs",
          "wikis",
          "live-demo",
          "knowledge-management",
          "databases-for-AI",
          "AWS-Events"
        ]
      }
    },
    {
      "id": "yUpQ9pWA9WE",
      "title": "Watch Live: Fed Chair Jerome Powell Holds News Conference | WSJ",
      "channel": "WSJ News",
      "published_at": "2026-01-27T20:49:24.000Z",
      "url": "https://www.youtube.com/watch?v=yUpQ9pWA9WE",
      "thumbnail": "https://i.ytimg.com/vi/yUpQ9pWA9WE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Federal Reserve Chair Jerome Powell speaks to reporters following the Federal Reserve's two-day policy-setting meeting. The description includes tags identifying the subject as Jerome Powell, the Fed, and WSJ.",
        "bullets": [
          "Jerome Powell addresses reporters after the Fed's two-day policy-setting meeting.",
          "The description identifies the video with hashtags: #JeromePowell, #Fed, #WSJ.",
          "Event context is a post-meeting press appearance by the Fed Chair.",
          "No transcript is provided in the available content."
        ],
        "takeaways": [
          "Watch or review the Fed Chair's post-meeting remarks to obtain the official policy stance for planning purposes.",
          "Obtain the official transcript or recording for documentation and internal distribution to finance and planning teams.",
          "Flag the Fed's statements for follow-up with treasury/finance teams to evaluate any implications for financing or investment timing.",
          "Coordinate with procurement and operations teams to ensure timely review of any policy guidance that could affect budgeting or cost forecasts."
        ],
        "tags": [
          "JeromePowell",
          "Fed",
          "WSJ",
          "policy-meeting",
          "press-conference",
          "central-bank",
          "finance",
          "economy"
        ]
      }
    },
    {
      "id": "MuQmKCWjSYI",
      "title": "Deutsche Bank accelerates Cloud journeys with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-27T17:39:29.000Z",
      "url": "https://www.youtube.com/watch?v=MuQmKCWjSYI",
      "thumbnail": "https://i.ytimg.com/vi/MuQmKCWjSYI/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Google Cloud Consulting worked with Deutsche Bank to design novel learning experiences that helped thousands of engineers become fluent in cloud engineering. The program used Generative AI to create personalized, interactive training that blends on‑demand convenience with instructor‑led effectiveness, with Google Cloud Consulting Learning Services providing the creative innovation and technical expertise to build the Cloud Engineering Program and accelerate the bank's cloud journey.",
        "bullets": [
          "Consulting designed novel learning experiences for thousands of engineers.",
          "Generative AI was used to create personalized, interactive training.",
          "Training combines on‑demand learning convenience with instructor‑led effectiveness.",
          "Google Cloud Consulting Learning Services provided creative innovation and technical expertise.",
          "The effort built Deutsche Bank's Cloud Engineering Program to accelerate its cloud journey."
        ],
        "takeaways": [
          "Investing in tailored, large‑scale training can accelerate enterprise cloud transitions.",
          "Generative AI enables scalable personalization of technical training for faster skill uptake.",
          "Hybrid on‑demand plus instructor‑led models balance convenience with instructional effectiveness.",
          "Partnering with specialist consulting teams brings the creative and technical know‑how to build programs at scale.",
          "Scaling engineer fluency through structured programs helps close cloud skill gaps that impede migration."
        ],
        "tags": [
          "Deutsche Bank",
          "Google Cloud Consulting",
          "Generative AI",
          "Cloud Engineering",
          "Learning Services",
          "Training",
          "Workforce Development",
          "Personalized Learning",
          "Hybrid Learning",
          "Cloud Migration"
        ]
      }
    },
    {
      "id": "5CyVBSbHmbA",
      "title": "Year-end toolkit: Strengthening audit committee collaboration",
      "channel": "PwC US",
      "published_at": "2026-01-27T17:20:31.000Z",
      "url": "https://www.youtube.com/watch?v=5CyVBSbHmbA",
      "thumbnail": "https://i.ytimg.com/vi/5CyVBSbHmbA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This episode of PwC’s Year-end toolkit addresses how finance management can strengthen collaboration with audit committees during the year-end accounting and reporting process. It highlights streamlining reporting and oversight of emerging areas such as AI, enterprise risk management, transformation initiatives, cyber risk, and proxy disclosures.",
        "bullets": [
          "Focus on improving management/audit committee communication and collaboration (1:18).",
          "Identifies key year-end accounting and reporting issues finance teams should be ready to address (10:10).",
          "Covers oversight of AI including associated risks, opportunities, and controls (15:02).",
          "Discusses enhancing enterprise risk oversight and navigating evolving cyber risk in the age of AI (21:33, 27:35).",
          "Addresses elevating proxy disclosures and links to additional PwC resources and past episodes (36:05)."
        ],
        "takeaways": [
          "Engage audit committees early on AI initiatives so oversight and controls are clearly communicated.",
          "Prepare finance teams to address specific year-end accounting and reporting questions the audit committee will raise.",
          "Elevate enterprise risk and cyber risk discussions with governance to reflect AI-related changes to the risk landscape.",
          "Ensure transformation initiatives and proxy disclosure considerations are integrated into year-end reporting conversations."
        ],
        "tags": [
          "PwC",
          "audit-committee",
          "year-end",
          "finance",
          "AI",
          "cyber-risk",
          "enterprise-risk",
          "governance",
          "proxy-disclosures",
          "reporting"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Jo discovers the power of Copilot Groups and demonstrates that route planning can be made easy. The short video promotes Microsoft Copilot features aimed at simplifying route-planning tasks.",
        "bullets": [
          "No transcript available; summary based on video description only",
          "Focuses on Copilot Groups as a route-planning aid",
          "Highlights ease of use for planning routes",
          "Positions Copilot as a productivity tool",
          "Features Jo as the demonstrator"
        ],
        "takeaways": [
          "If Copilot Groups can simplify route planning, decision-makers should consider assessing its fit for operational planning workflows",
          "Potential to reduce planning complexity for logistics and maintenance scheduling",
          "May support better coordination across teams by grouping tasks or routes",
          "Worth evaluating interoperability with existing grid/datacenter systems and tools"
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "copilot-groups",
          "route-planning",
          "productivity",
          "workflow",
          "Jo"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI w audycie to już codzienność; narzędzia wspierają powtarzalne czynności, analizę dużych zbiorów danych i podejmowanie trafniejszych decyzji. W podcaście ekspertki z KPMG omawiają konkretne rozwiązania (AI Transaction Scoring Tool, Clara AI, platforma KPMG Clara), przejście od próbkowania do analizy pełnych populacji oraz wyzwania związane z kompetencjami, bezpieczeństwem danych i regulacjami.",
        "bullets": [
          "AI wspiera audyt w automatyzacji powtarzalnych zadań i analizie pełnych populacji danych.",
          "Wymienione narzędzia: AI Transaction Scoring Tool, Clara AI (asystent konwersacyjny i agenci), oraz platforma KPMG Clara.",
          "Clara for Clients poprawia komunikację z klientem i umożliwia zarządzanie badaniem w czasie rzeczywistym.",
          "Technologie przesuwają rolę audytora — rośnie potrzeba nowych kompetencji i adaptacji zespołów.",
          "Kluczowe wyzwania: bezpieczeństwo danych, środowisko regulacyjne oraz potencjalne ryzyka związane z AI."
        ],
        "takeaways": [
          "Zapewnij dostęp do kompletnych, skonsolidowanych zbiorów danych — audyt coraz częściej analizuje pełne populacje zamiast próbkowania.",
          "Umożliw integrację w czasie rzeczywistym z platformami audytowymi (np. KPMG Clara) dla sprawniejszej współpracy i raportowania.",
          "Wzmocnij zabezpieczenia danych i mechanizmy zgodności z regulacjami, bo bezpieczeństwo i regulacje są kluczowymi wyzwaniami.",
          "Planuj rozwój kompetencji i szkolenia dotyczące AI oraz analizy dużych zbiorów danych w zespołach współpracujących z audytorami.",
          "Oceń i zarządzaj ryzykami związanymi z wdrożeniem AI (governance, kontrola wyników, odpowiedzialność)."
        ],
        "tags": [
          "audyt",
          "sztuczna-inteligencja",
          "KPMG",
          "KPMG-Clara",
          "automatyzacja",
          "analiza-danych",
          "bezpieczeństwo-danych",
          "regulacje",
          "innowacje"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Arknights: Endfield has officially launched and includes NVIDIA DLSS 4 with Multi Frame Generation. The game is a 3D real-time strategy RPG where players act as the Endministrator exploring Talos-II; the trailer was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 MFG 4X Mode.",
        "bullets": [
          "Arknights: Endfield officially launched and features NVIDIA DLSS 4 with Multi Frame Generation.",
          "Game genre: 3D real-time strategy RPG; player role is the Endministrator of Endfield Industries exploring Talos-II.",
          "Trailer capture: GeForce RTX 5080, 4K Ultra settings, DLSS 4 Multi Frame Generation 4X Mode.",
          "Official links provided for DLSS 4 details, the game site, and multiple Arknights: Endfield social channels.",
          "Video published by NVIDIA GeForce with related hashtags #ArknightsEndfield #RTXOn #DLSS4."
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is being used in a released title; infrastructure teams should account for support of DLSS 4-enabled toolchains and drivers.",
          "The showcase used a GeForce RTX 5080 at 4K Ultra settings, so procurement and lab fleets for development, QA, or demos may need RTX 50-series class hardware for parity.",
          "4K captures with AI-driven frame generation may increase GPU compute and I/O demands; plan capacity for higher-resolution rendering workloads and storage/throughput accordingly."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "RTX5080",
          "NVIDIA",
          "4K",
          "GeForce",
          "Gaming",
          "RTS"
        ]
      }
    }
  ]
}