{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-20T14:59:46.777Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video profiles Dr. Anna Chacon, a 39-year-old dermatologist in Miami, FL who runs her own private practice. Her reported net worth is about $6 million, comprised of $3.2 million in investments, a $1.9 million home, and a $1.1 million office building.",
        "bullets": [
          "Dr. Anna Chacon, 39, dermatologist based in Miami, FL.",
          "Runs her own private dermatology practice.",
          "Estimated net worth: ~$6 million.",
          "$3.2 million held in investments.",
          "$1.9M home and $1.1M office building noted as assets."
        ],
        "takeaways": [
          "Ownership of an office building indicates medical practices can represent stable commercial power demand.",
          "Private practices in urban markets like Miami may be customers for reliable on-site power and backup solutions.",
          "High-net-worth professionals often hold mixed asset portfolios (investments + real estate) that affect local commercial load profiles.",
          "Targeting small commercial property owners (e.g., medical offices) can inform resilient power and service offerings."
        ],
        "tags": [
          "dermatologist",
          "private practice",
          "Miami",
          "net worth",
          "investments",
          "real estate",
          "office building",
          "personal finance"
        ]
      }
    },
    {
      "id": "6L86-OnOXV0",
      "title": "How I Built A $1M/Year Business - And Helped My Parents Retire",
      "channel": "CNBC Make It",
      "published_at": "2026-01-17T15:00:09.000Z",
      "url": "https://www.youtube.com/watch?v=6L86-OnOXV0",
      "thumbnail": "https://i.ytimg.com/vi/6L86-OnOXV0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, when he was 15 Tuan Le vowed to help his parents retire after his family emigrated from Vietnam to Toronto in 2015. Ten years later his social video production company, ShortsCut, brings in over $1 million USD a year and he now covers his parents' rent and living expenses so they no longer have to work full time.",
        "bullets": [
          "Founder: Tuan Le; family emigrated from Vietnam to Toronto in 2015.",
          "Company: ShortsCut — a social video production business.",
          "Revenue: ShortsCut generates over $1 million USD annually.",
          "Personal result: Tuan pays his parents' rent and living expenses; they no longer work full time.",
          "Video produced by CNBC Make It; published Jan 17, 2026."
        ],
        "takeaways": [
          "A social video production firm can scale to >$1M/year — consider media companies as potential high-revenue clients.",
          "Content-focused businesses like ShortsCut likely drive demand for scalable storage, delivery, and processing — factor media workflows into capacity planning.",
          "Stories of sustained revenue and personal financial impact suggest targeting long-term service agreements and media-oriented solutions for growth-oriented creators."
        ],
        "tags": [
          "Tuan Le",
          "ShortsCut",
          "social video production",
          "entrepreneurship",
          "1M USD",
          "parents retire",
          "CNBC Make It",
          "Toronto",
          "Vietnam"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this giant bubble of carbon dioxide can store 20 megawatts of energy. The description frames the technology as a battery solution to address renewable energy fluctuations and to help power the global shift to clean energy.",
        "bullets": [
          "Giant carbon dioxide “bubble” battery stores 20 megawatts of energy.",
          "Presented as a solution for fluctuating renewable energy supply.",
          "Positioned to support the global transition to clean energy.",
          "Framed with tech and innovation focus in the description."
        ],
        "takeaways": [
          "A 20 MW storage unit could, if deployed, contribute to balancing variable renewable generation at grid scale.",
          "Grid operators should monitor this approach as a potential option for mitigating intermittency from renewables.",
          "Data-center planners may want to track developments if the technology proves viable for onsite or nearby energy-resilience use.",
          "The technology aligns with decarbonization goals and merits follow-up as part of broader clean-energy storage strategies."
        ],
        "tags": [
          "ieee",
          "ieeespectrum",
          "tech",
          "innovation",
          "future",
          "energy",
          "battery",
          "carbon-dioxide"
        ]
      }
    },
    {
      "id": "OINppmPan0o",
      "title": "Figure Skating | Making Team USA presented by Xfinity with Apolo Ohno",
      "channel": "Team USA",
      "published_at": "2026-01-16T19:30:36.000Z",
      "url": "https://www.youtube.com/watch?v=OINppmPan0o",
      "thumbnail": "https://i.ytimg.com/vi/OINppmPan0o/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, figure skating duo Vadym Kolesnik and Emilia Zingas sit down with Apolo Ohno on this week's episode of Making Team USA presented by Xfinity ahead of the Winter Olympics. The segment highlights their partnership as \"built on trust.\"",
        "bullets": [
          "Interview features Vadym Kolesnik and Emilia Zingas with Apolo Ohno.",
          "Episode is part of Making Team USA presented by Xfinity.",
          "Context: conversation takes place ahead of the Winter Olympics.",
          "Key theme called out: \"Built on trust.\"",
          "Video promoted with Team USA social links and #MTUSA hashtag."
        ],
        "takeaways": [
          "The video's emphasis on trust underscores the importance of reliable partnerships—relevant when choosing vendors or collaborating across teams.",
          "Preparing ahead of a major event (the Winter Olympics) parallels the need for advance planning before peak demand or major deployments.",
          "Public-facing communication and storytelling (episodes, social promotion) can build stakeholder confidence in readiness and capability.",
          "Sponsorship/partnership visibility (presented by Xfinity) highlights how external partners can support resources and visibility."
        ],
        "tags": [
          "Figure Skating",
          "Vadym Kolesnik",
          "Emilia Zingas",
          "Apolo Ohno",
          "Making Team USA",
          "Xfinity",
          "Winter Olympics",
          "MTUSA"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI is already reshaping transfer pricing work—enabling profitability monitoring, comparative analyses and automation of documentation. KPMG experts Monika Palmowska and Jakub Roszkiewicz outline practical applications, implementation steps (including ERP integration and secure environments like Digital Gateway), and highlight risks around data security and GDPR while stressing that AI augments rather than replaces advisers.",
        "bullets": [
          "AI supports monitoring rentowności, benchmarky porównawcze i automatyzację dokumentacji cen transferowych.",
          "Eksperci omawiają, dlaczego temat AI jest aktualny i przykłady zastosowań w praktyce TP.",
          "AI ma wspierać doradców i rozwój kompetencji młodszych pracowników, nie zastępować ich.",
          "Ryzyka obejmują kwestie danych, bezpieczeństwa, RODO i zjawisko „halucynacji” AI.",
          "Bezpieczne środowiska (np. Digital Gateway), integracja z ERP i uporządkowanie procesów to kluczowe filary wdrożenia."
        ],
        "takeaways": [
          "Zabezpieczenie danych i zgodność z RODO muszą być priorytetem przy wdrażaniu AI w środowiskach krytycznych.",
          "Integracja AI z ERP i systemami operacyjnymi ułatwi tworzenie inteligentnych benchmarków i monitorowanie rentowności.",
          "Automatyzacja dokumentacji może zmniejszyć obciążenie administracyjne i przyspieszyć procesy zgodności podatkowej.",
          "Przed wdrożeniem warto uporządkować i sformalizować procesy — to fundament bezpiecznej transformacji AI."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "podatki",
          "automatyzacja",
          "bezpieczeństwo danych",
          "RODO",
          "ERP",
          "Digital Gateway"
        ]
      }
    },
    {
      "id": "dGfcT63U7Mo",
      "title": "The 2026 U.S. Olympic Figure Skating Team 🇺🇸",
      "channel": "Team USA",
      "published_at": "2026-01-15T20:43:24.000Z",
      "url": "https://www.youtube.com/watch?v=dGfcT63U7Mo",
      "thumbnail": "https://i.ytimg.com/vi/dGfcT63U7Mo/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this Team USA video announces the U.S. Olympic Figure Skating lineup for the 2026 Winter Olympics. The description is brief and enthusiastic but provides no transcript or roster details.",
        "bullets": [
          "Title: The 2026 U.S. Olympic Figure Skating Team",
          "Channel: Team USA",
          "Published: 2026-01-15T20:43:24.000Z",
          "Transcript: not available",
          "Description text: \"This U.S. Olympic Figure Skating lineup. 🔥\""
        ],
        "takeaways": [
          "Official Team USA announcement content can drive short-term spikes in viewership and CDN requests around publication and Olympic competition windows.",
          "Ensure streaming and delivery capacity is provisioned for sports-announcement content tied to the Winter Olympics timeline.",
          "Monitor real-time analytics after release to scale cache and origin resources quickly if engagement surges.",
          "Log and retain delivery metrics for post-event analysis to inform capacity planning for future Olympic-related releases."
        ],
        "tags": [
          "US Figure Skating",
          "Team USA",
          "2026 Winter Olympics",
          "Olympics lineup",
          "figure skating",
          "sports announcement",
          "Winter Olympics 2026"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Whether you’re tackling workouts, projects, or personal goals, keep momentum going with Copilot. The video promotes using Microsoft Copilot to stack small wins and sustain progress.",
        "bullets": [
          "Positions Copilot as a tool for maintaining momentum.",
          "Targets use cases like workouts, projects, and personal goals.",
          "Emphasizes stacking small wins to drive progress.",
          "Published by the Microsoft Copilot channel on 2026-01-15."
        ],
        "takeaways": [
          "Apply the \"stack small wins\" mindset to operations: prioritize incremental improvements to maintain steady progress.",
          "Consider tools that help teams sustain momentum on routine tasks and projects.",
          "Use automation and assistance to break large initiatives into manageable, trackable steps.",
          "Framing goals as a series of small wins can improve adoption and continuity of improvement efforts."
        ],
        "tags": [
          "Microsoft Copilot",
          "Copilot",
          "productivity",
          "small wins",
          "momentum",
          "workouts",
          "projects",
          "personal goals",
          "2026",
          "Microsoft"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The video highlights how the Dell PowerEdge R770AP server, powered by Intel® Xeon® 6 processors, delivers the precision and speed needed for high-frequency trading, performing hundreds of trades in seconds to help maximize gains and minimize losses. It positions Intel Xeon 6 CPUs as defining the future of finance and directs viewers to Intel Business resources.",
        "bullets": [
          "Focus on high-frequency trading where every second matters",
          "Showcases Dell PowerEdge R770AP server",
          "Powered by Intel® Xeon® 6 processors",
          "Claims precision and speed enable hundreds of trades in seconds",
          "Positions Intel Xeon 6 as shaping the future of finance"
        ],
        "takeaways": [
          "Prioritize low-latency, high-performance servers for HFT workloads",
          "Evaluate Dell PowerEdge R770AP with Intel Xeon 6 when specifying trading infrastructure",
          "Size systems for the throughput needed to handle hundreds of trades per second",
          "Use Intel Business resources for guidance on deployment and optimization"
        ],
        "tags": [
          "high-frequency trading",
          "HFT",
          "Intel Xeon 6",
          "Dell PowerEdge R770AP",
          "low-latency",
          "finance",
          "data center",
          "servers",
          "Intel Business"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video says the creative spark was out and Copilot brought it back to life. It invites viewers to download Copilot and try it for themselves via the link in bio.",
        "bullets": [
          "The creative spark was out.",
          "Copilot brought the creative spark back to life.",
          "Viewers are invited to download Copilot.",
          "Try Copilot via the link in bio."
        ],
        "takeaways": [
          "If creative output is a constraint for teams, consider testing Copilot to see if it aids ideation.",
          "Use the link in bio to obtain Copilot quickly and run a short pilot with relevant teams.",
          "Measure whether Copilot’s boost to creativity produces practical value before broader adoption.",
          "If a pilot is successful, plan for controlled rollout and team onboarding."
        ],
        "tags": [
          "Copilot",
          "Download Copilot",
          "Creativity",
          "Creative spark",
          "Link in bio",
          "Try it",
          "Idea generation",
          "Productivity"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This clip features the open-world martial arts RPG Where Winds Meet running with DLSS 4's Multi Frame Generation and RTX enabled. The video is credited to @DigitalDreamsyt.",
        "bullets": [
          "Open-world martial arts RPG: Where Winds Meet",
          "Showcases DLSS 4 with Multi Frame Generation",
          "#RTXOn enabled visuals",
          "Short promotional/tech demo clip",
          "Footage credited to @DigitalDreamsyt"
        ],
        "takeaways": [
          "The demo emphasizes DLSS 4 with Multi Frame Generation and RTX — consider compatibility with NVIDIA RTX and DLSS features when planning hardware for similar demos.",
          "Use visual tech demos like this to assess GPU capabilities for advanced upscaling and frame-generation features.",
          "Coordinate with content creators (credit: @DigitalDreamsyt) for licensing or reuse of footage in showcases."
        ],
        "tags": [
          "Where Winds Meet",
          "DLSS 4",
          "Multi Frame Generation",
          "RTXOn",
          "Open-world",
          "Martial arts RPG",
          "NVIDIA GeForce",
          "DigitalDreamsyt",
          "Gaming",
          "Graphics"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this YouTube video is titled \"Taha Khalifa (Intel) | Intel Business\" and is published on the Intel Business channel. No transcript is available; the channel describes itself as a source of IT resources, guidance, and expert insights covering topics from data centers to devices and includes links to subscribe and connect.",
        "bullets": [
          "Video title: Taha Khalifa (Intel) | Intel Business",
          "No transcript is available for this video",
          "Intel Business provides IT resources, guidance, and expert insights for data centers to devices",
          "Subscribe link provided: https://intel.ly/43XZh6J",
          "Connect links: Intel Business website and social channels (X, LinkedIn, Facebook)"
        ],
        "takeaways": [
          "Use the Intel Business channel and website as a resource hub when planning or managing data center projects",
          "Subscribe and follow Intel Business on social channels to receive ongoing guidance and expert insights",
          "Leverage the provided links to access Intel Business materials and support for device- and data center–related IT decisions"
        ],
        "tags": [
          "Intel",
          "Intel Business",
          "Taha Khalifa",
          "data centers",
          "IT resources",
          "devices",
          "tech insights",
          "subscribe",
          "IT guidance"
        ]
      }
    }
  ]
}