{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-19T19:39:14.818Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Dr. Anna Chacon, 39, is a Miami-based dermatologist who runs her own private practice. Her reported net worth is about $6 million, made up of $3.2 million in investments, a $1.9 million home, and a $1.1 million office building.",
        "bullets": [
          "Dr. Anna Chacon, age 39, dermatologist in Miami, FL",
          "Operates a private dermatology practice",
          "Estimated net worth: approximately $6 million",
          "Net worth breakdown: $3.2M investments, $1.9M home, $1.1M office building",
          "Owns the office building used for her practice"
        ],
        "takeaways": [
          "Note the ownership of an office building for a medical practice—owner-occupied commercial properties can affect local power and infrastructure needs.",
          "Investment and property ownership by medical practitioners suggests they may be decision-makers or stakeholders in facility-level infrastructure choices.",
          "When assessing customers, include small-to-medium healthcare practices that own their premises as potential targets for reliable power, backup, and secure data services."
        ],
        "tags": [
          "dermatologist",
          "private practice",
          "Miami",
          "net worth",
          "investments",
          "real estate",
          "office building",
          "personal finance",
          "CNBC Make It",
          "Dr. Anna Chacon"
        ]
      }
    },
    {
      "id": "6L86-OnOXV0",
      "title": "How I Built A $1M/Year Business - And Helped My Parents Retire",
      "channel": "CNBC Make It",
      "published_at": "2026-01-17T15:00:09.000Z",
      "url": "https://www.youtube.com/watch?v=6L86-OnOXV0",
      "thumbnail": "https://i.ytimg.com/vi/6L86-OnOXV0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Tuan Le emigrated from Vietnam to Toronto in 2015 at age 15 and vowed to help his parents retire. Ten years later his social video production company, ShortsCut, brings in over $1 million USD a year in sales, and he now pays his parents' rent and living expenses so they no longer have to work full time.",
        "bullets": [
          "Tuan Le emigrated from Vietnam to Toronto in 2015 at age 15 and vowed to help his parents retire.",
          "He founded ShortsCut, a social video production company.",
          "ShortsCut generates over $1M USD in annual sales.",
          "Tuan now covers his parents' rent and living expenses so they no longer work full time.",
          "The video was produced by CNBC Make It."
        ],
        "takeaways": [
          "Social video production can scale to seven-figure annual revenue, indicating a sizable market of content businesses to monitor.",
          "Growing digital media companies represent potential steady customers for service providers and capacity planners.",
          "Decision-makers should consider outreach and product offerings tailored to small-to-medium creative firms that scale rapidly.",
          "Success stories from immigrant founders highlight diverse sources of demand and partnership opportunities in the creative sector."
        ],
        "tags": [
          "Tuan Le",
          "ShortsCut",
          "social video production",
          "entrepreneurship",
          "CNBC Make It",
          "immigrant founder",
          "million dollar business",
          "parents retire",
          "Toronto",
          "2025"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this giant bubble of carbon dioxide can store 20 megawatts of energy. The description frames the CO2-based battery as a means to buffer fluctuations in renewable generation and to help power a global shift to clean energy.",
        "bullets": [
          "Uses a giant carbon dioxide 'bubble' as the energy storage medium",
          "Stores 20 megawatts of energy (per the description)",
          "Presented as a solution for fluctuating renewable power",
          "Positioned to support the global transition to clean energy",
          "Published/tagged under innovation and energy tech by IEEE Spectrum"
        ],
        "takeaways": [
          "Offers a potential large-capacity storage option (20 MW) for grid-level balancing of variable renewables",
          "Could be relevant to data center and grid planners needing additional reserve or load-shifting capacity",
          "Aligns with decarbonization strategies by enabling greater integration of renewable generation",
          "Decision-makers should track commercialization and integration timelines for planning purposes"
        ],
        "tags": [
          "ieee",
          "tech",
          "ieeespectrum",
          "innovation",
          "future",
          "futuristic",
          "energy",
          "battery"
        ]
      }
    },
    {
      "id": "OINppmPan0o",
      "title": "Figure Skating | Making Team USA presented by Xfinity with Apolo Ohno",
      "channel": "Team USA",
      "published_at": "2026-01-16T19:30:36.000Z",
      "url": "https://www.youtube.com/watch?v=OINppmPan0o",
      "thumbnail": "https://i.ytimg.com/vi/OINppmPan0o/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this episode of Making Team USA presented by Xfinity features figure skating duo Vadym Kolesnik and Emilia Zingas sitting down with Apolo Ohno ahead of the Winter Olympics. The short promotional clip emphasizes trust and directs viewers to Team USA’s YouTube channel and other social platforms.",
        "bullets": [
          "Interview with Vadym Kolesnik and Emilia Zingas alongside Apolo Ohno.",
          "Framed as Olympic-preview content ahead of the Winter Olympics.",
          "Theme/tagline noted as 'Built on trust'.",
          "Published by Team USA on YouTube (video date: 2026-01-16).",
          "Description includes links to Team USA website and social channels (Facebook, Twitter, Instagram, TikTok)."
        ],
        "takeaways": [
          "This is Olympic-related promotional media tied to a specific event window (pre-Winter Olympics), which can concentrate viewer interest.",
          "Distribution is multi-platform: YouTube plus Team USA’s website and major social channels (links provided in description).",
          "Ensure cross-platform delivery infrastructure and CDN capacity to support promotional content and clips associated with Olympic coverage.",
          "Maintain high availability and monitoring for event-driven media releases to protect user experience across listed channels."
        ],
        "tags": [
          "Figure Skating",
          "Vadym Kolesnik",
          "Emilia Zingas",
          "Apolo Ohno",
          "Winter Olympics",
          "Making Team USA",
          "Xfinity",
          "Team USA",
          "Interview",
          "Olympics 2026"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… W podcaście KPMG ON AIR eksperci z Zespołu ds. Cen Transferowych omawiają, jak AI już dziś zmienia podejście do cen transferowych — od monitorowania rentowności i analiz porównawczych po automatyzację dokumentacji oraz integrację z ERP i inteligentne benchmarki. Podkreślają, że AI nie zastąpi doradców, lecz wzmocni ich pracę, a wdrożenie powinno zaczynać się od uporządkowania procesów i uwzględniać ryzyka związane z danymi, RODO i halucynacjami oraz korzystać z bezpiecznych środowisk (np. Digital Gateway).",
        "bullets": [
          "AI wspiera monitorowanie rentowności, analizy porównawcze i automatyzację dokumentacji cen transferowych.",
          "Sztuczna inteligencja ma rolę wspierającą doradców podatkowych, nie zastępując ich.",
          "Wdrażanie AI warto zaczynać od uporządkowania procesów i zdefiniowania person.",
          "Należy uwzględnić ryzyka: ochrona danych, bezpieczeństwo i zjawisko halucynacji AI.",
          "Rekomendowane: bezpieczne środowiska (Digital Gateway), integracja z ERP i rozwój kompetencji pracowników."
        ],
        "takeaways": [
          "Priorytet: zapewnić zgodność z RODO i ochronę danych przy wdrażaniu AI do procesów podatkowych.",
          "Udostępnienie bezpiecznego środowiska (np. Digital Gateway) minimalizuje ryzyka związane z pracą AI.",
          "Zapewnij integrację AI z ERP i gotowość danych, aby uzyskać wartościowe benchmarki i monitorowanie.",
          "Uporządkuj procesy i zaplanuj szkolenia pracowników przed skalowaniem rozwiązań AI."
        ],
        "tags": [
          "podatki",
          "AI",
          "ceny transferowe",
          "RODO",
          "bezpieczeństwo danych",
          "automatyzacja",
          "ERP",
          "benchmarking",
          "Digital Gateway"
        ]
      }
    },
    {
      "id": "dGfcT63U7Mo",
      "title": "The 2026 U.S. Olympic Figure Skating Team 🇺🇸",
      "channel": "Team USA",
      "published_at": "2026-01-15T20:43:24.000Z",
      "url": "https://www.youtube.com/watch?v=dGfcT63U7Mo",
      "thumbnail": "https://i.ytimg.com/vi/dGfcT63U7Mo/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video presents the U.S. Olympic figure skating lineup for the 2026 Winter Olympics. The description conveys excitement with a fire emoji and the #WinterOlympics hashtag but includes no additional details.",
        "bullets": [
          "Video is about the U.S. Olympic figure skating lineup.",
          "Tone of the description is enthusiastic (🔥 emoji).",
          "Includes the hashtag #WinterOlympics.",
          "No athlete names, schedule, or event details are provided."
        ],
        "takeaways": [
          "The description contains no operational or timing data relevant to infrastructure planning.",
          "Unable to assess potential impacts on broadcasting, streaming, or network load from this description alone.",
          "Decision-makers will need viewership projections, broadcast/streaming schedules, and platform distribution details to evaluate capacity needs.",
          "No additional metadata in the description indicates peak times or expected audience size."
        ],
        "tags": [
          "U.S. Olympic Team",
          "Figure Skating",
          "Winter Olympics",
          "Team USA",
          "2026",
          "Olympics",
          "Lineup",
          "WinterSports"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Copilot helps you keep momentum whether you’re tackling workouts, projects, or personal goals. It emphasizes stacking small wins to sustain progress across different areas of life.",
        "bullets": [
          "Targets momentum for workouts, projects, and personal goals",
          "Emphasizes stacking small wins to maintain progress",
          "Applies across different types of tasks and goals",
          "Aims to help users stay consistently forward-moving"
        ],
        "takeaways": [
          "Maintaining momentum with small, incremental wins can help long-term projects stay on track",
          "Decision-makers can apply the same 'small wins' approach to operational or strategic initiatives to preserve progress",
          "A consistent, win-focused process supports sustained advancement of goals over time"
        ],
        "tags": [
          "Microsoft Copilot",
          "productivity",
          "momentum",
          "small wins",
          "workouts",
          "projects",
          "personal goals",
          "goal setting",
          "habit building"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The video highlights the Dell PowerEdge R770AP server powered by Intel® Xeon® 6 processors and how its precision and speed support high-frequency trading. It emphasizes executing hundreds of trades in seconds to help maximize gains and minimize losses and positions Intel Xeon 6 CPUs as defining the future of finance.",
        "bullets": [
          "Dell PowerEdge R770AP server is powered by Intel® Xeon® 6 processors.",
          "Targeted at high-frequency trading where every second counts.",
          "Designed to execute hundreds of trades in seconds.",
          "Aims to maximize gains and minimize losses through precision and speed.",
          "Positions Intel Xeon 6 CPUs as shaping the future of finance."
        ],
        "takeaways": [
          "For HFT workloads, prioritize server platforms that emphasize low latency and high precision, such as the Dell R770AP with Intel Xeon 6.",
          "Infrastructure must support very high transaction rates (hundreds of trades per second) to meet trading demands.",
          "Processor and server performance can materially affect trading outcomes by reducing execution time and risk of loss.",
          "Evaluate vendor claims about performance impact on finance when planning data center and trading-floor deployments."
        ],
        "tags": [
          "high-frequency trading",
          "HFT",
          "Intel Xeon 6",
          "Dell PowerEdge R770AP",
          "low latency",
          "trading servers",
          "finance",
          "data center",
          "high-performance computing",
          "financial technology"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the short promo says Copilot revived a user's creative spark and invites viewers to download Copilot via the link in the bio. It presents Copilot as a tool to restore creative inspiration and encourages a trial.",
        "bullets": [
          "States Copilot brought a lost creative spark back to life",
          "Direct call to action: download Copilot via link in bio",
          "Short, promotional message with an invitation to try the product",
          "No transcript available — description is the sole source"
        ],
        "takeaways": [
          "Claims of restored creativity suggest Copilot could be worth a quick trial for teams needing ideation support; try it via the provided link to evaluate fit",
          "Easy ‘link in bio’ access implies low friction for pilots or demonstrations before broader adoption",
          "Promotional nature means decision-makers should verify the claim against internal use cases and security/compliance requirements",
          "Use a short pilot to measure any productivity or creative-impact claims before committing to wider deployment"
        ],
        "tags": [
          "Copilot",
          "creativity",
          "creative-spark",
          "download",
          "link-in-bio",
          "promo",
          "try-it",
          "creative-tools"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video spotlights the open-world martial arts RPG Where Winds Meet running with NVIDIA DLSS 4 and Multi Frame Generation with RTX On. The clip is credited to @DigitalDreamsyt and emphasizes visual/performative tech features.",
        "bullets": [
          "Showcases Where Winds Meet, an open-world martial arts RPG",
          "Highlights NVIDIA DLSS 4 with Multi Frame Generation",
          "RTX On visuals emphasized",
          "Footage credited to @DigitalDreamsyt",
          "Promotional tech-focused showcase"
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation signals growing use of AI-powered upscaling that can increase GPU inference demand in cloud/gaming deployments",
          "RTX On implies ray-tracing workloads that favor GPUs with dedicated ray-tracing and tensor/AI acceleration",
          "Real-time frame-generation/upscaling considerations may affect throughput, latency, and GPU provisioning for cloud gaming or remote-rendering services",
          "Collaboration with content creators (credit to @DigitalDreamsyt) can be useful for performance validation and marketing of infrastructure capabilities"
        ],
        "tags": [
          "WhereWindsMeet",
          "open-world",
          "martial-arts",
          "RPG",
          "DLSS4",
          "MultiFrameGeneration",
          "RTXOn",
          "NVIDIA",
          "DigitalDreamsyt"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video points viewers to Intel Business as a central resource for IT information, covering topics from data centers to devices. It encourages subscribing and provides links to the Intel Business website and social channels for resources, guidance, and expert insights.",
        "bullets": [
          "Encourages subscribing to the Intel Business YouTube channel",
          "Positions Intel Business as an IT resource covering data centers to devices",
          "Promises resources, guidance, and expert insights for IT projects",
          "Provides a direct website link to the Intel Business IT center",
          "Lists social channels: X, LinkedIn, and Facebook for connection"
        ],
        "takeaways": [
          "Intel Business is presented as a single source for guidance relevant to data center and device decision-makers",
          "Decision-makers can use the provided website link to access Intel’s IT resources and project guidance",
          "Following the listed social channels and subscribing will help teams stay updated on Intel Business insights and content"
        ],
        "tags": [
          "Intel",
          "Intel Business",
          "IT",
          "data centers",
          "devices",
          "IT resources",
          "guidance",
          "expert insights",
          "subscribe"
        ]
      }
    },
    {
      "id": "kSocjh8PZnQ",
      "title": "Rynek dóbr luksusowych w obliczu transformacji | Andrzej Marczak, Tomasz Wiśniewski",
      "channel": "KPMG Poland",
      "published_at": "2026-01-13T10:23:31.000Z",
      "url": "https://www.youtube.com/watch?v=kSocjh8PZnQ",
      "thumbnail": "https://i.ytimg.com/vi/kSocjh8PZnQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this KPMG On Air podcast examines current trends reshaping the luxury goods market in Poland and globally — from experiential luxury and personalization to ESG, \"affordable luxury\" and Gen Z preferences. Experts Andrzej Marczak and Tomasz Wiśniewski discuss Poland’s growing but fragmented market, the role of art and luxury tourism, and future drivers such as AI, craftsmanship and responsible luxury.",
        "bullets": [
          "Shift toward experiential luxury, personalization and exclusive customer experiences",
          "Growing importance of ESG and responsible-luxury practices (e.g., eco-leathers, certifications)",
          "\"Affordable luxury\" and aspirational consumers expanding market reach; top 2% drive ~40% of sales",
          "Polish market: expanding yet dispersed, with opportunities in hotels, spas, tourism and art",
          "Future focus areas highlighted: AI, artisanal craftsmanship and human-centric value"
        ],
        "takeaways": [
          "Growth in personalization and experience-driven services implies increased demand for digital infrastructure — plan for additional compute, storage and bandwidth.",
          "AI as a future driver for luxury suggests rising need for GPU/accelerated compute and low-latency processing — evaluate capacity and cooling strategies.",
          "ESG emphasis means luxury clients may prefer data centers with renewable energy, sustainability certifications and transparent reporting — consider green power options and certification paths.",
          "Poland’s growing luxury market points to potential localized demand — assess regional capacity, connectivity and compliance needs for Central European deployments."
        ],
        "tags": [
          "luksus",
          "ESG",
          "AI",
          "personalizacja",
          "Polska",
          "turystyka",
          "sztuka",
          "KPMG",
          "rynek",
          "luxury-trends"
        ]
      }
    }
  ]
}