{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-20T05:53:31.039Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Dr. Anna Chacon, 39, is a Miami-based dermatologist who runs her own private practice and reportedly earns $900,000 a year. Her stated net worth is about $6 million, comprised of $3.2 million in investments, a $1.9 million home, and a $1.1 million office building.",
        "bullets": [
          "Age: 39; location: Miami, FL.",
          "Profession: Dermatologist with a private practice.",
          "Reported annual earnings: $900,000 (from video title).",
          "Net worth: about $6 million total.",
          "Net worth breakdown: $3.2M investments, $1.9M home, $1.1M office building."
        ],
        "takeaways": [
          "Private medical practices that own office buildings represent localized commercial energy demand and potential customers for reliable power services.",
          "High-income professionals living and working in the same market (Miami) can indicate overlapping residential and small-commercial load that utilities and grid planners should account for.",
          "Owners with valuable properties and investment portfolios may value uptime and backup power solutions for both home and office locations.",
          "Data center and infrastructure planners should consider proximity to professional service hubs when assessing demand for low-latency or on-site commercial connectivity."
        ],
        "tags": [
          "dermatologist",
          "private practice",
          "Miami",
          "high income",
          "net worth",
          "investments",
          "real estate",
          "office building",
          "CNBC Make It",
          "Dr Anna Chacon"
        ]
      }
    },
    {
      "id": "6L86-OnOXV0",
      "title": "How I Built A $1M/Year Business - And Helped My Parents Retire",
      "channel": "CNBC Make It",
      "published_at": "2026-01-17T15:00:09.000Z",
      "url": "https://www.youtube.com/watch?v=6L86-OnOXV0",
      "thumbnail": "https://i.ytimg.com/vi/6L86-OnOXV0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Tuan Le emigrated from Vietnam to Toronto in 2015 and vowed at age 15 to help his parents retire. Ten years later his social video production company, ShortsCut, is making over $1 million USD a year and he now pays his parents' rent and living expenses so they no longer work full time.",
        "bullets": [
          "Tuan Le and his family emigrated from Vietnam to Toronto, Canada in 2015; he vowed at 15 to help his parents retire.",
          "His company, ShortsCut, produces social videos and generates over $1M USD annually.",
          "He uses company income to pay his parents' rent and living expenses so they no longer work full time.",
          "Video credits include Producer/Editor: Zach Green; Reporter: Kamaron McNair; Camera: Scott Drucker.",
          "Published by CNBC Make It on 2026-01-17."
        ],
        "takeaways": [
          "A social video production business reaching >$1M/year signals strong market demand for short-form content—consider capacity for content hosting and delivery.",
          "Growing video companies may require scalable storage and distribution solutions to support production and audience reach.",
          "Stable revenue from creative firms can justify investments or partnerships for tailored infrastructure and service offerings."
        ],
        "tags": [
          "Tuan Le",
          "ShortsCut",
          "social video production",
          "CNBC Make It",
          "entrepreneurship",
          "immigration",
          "Toronto",
          "parents retire",
          "1M/year"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This giant bubble of carbon dioxide can store 20 megawatts of energy and is presented as a new battery approach to buffer fluctuating renewable generation. The description frames these CO2 batteries as a technology to help drive the global shift to clean energy.",
        "bullets": [
          "Giant carbon-dioxide bubble used as an energy storage battery.",
          "Reported storage capacity of 20 megawatts.",
          "Aims to address fluctuations in renewable energy output.",
          "Presented as a tool to accelerate the shift to clean energy worldwide.",
          "Video framed with tags: #ieee #tech #innovation #energy"
        ],
        "takeaways": [
          "A 20 MW CO2-based storage option could offer grid-scale buffering for variable renewables.",
          "Decision-makers should note this tech is positioned for supporting clean-energy transitions.",
          "Assess compatibility of CO2-bubble storage with existing grid or data-center backup strategies."
        ],
        "tags": [
          "CO2",
          "carbon-dioxide",
          "energy-storage",
          "battery",
          "renewable-energy",
          "grid-storage",
          "clean-energy",
          "IEEE",
          "innovation",
          "tech"
        ]
      }
    },
    {
      "id": "OINppmPan0o",
      "title": "Figure Skating | Making Team USA presented by Xfinity with Apolo Ohno",
      "channel": "Team USA",
      "published_at": "2026-01-16T19:30:36.000Z",
      "url": "https://www.youtube.com/watch?v=OINppmPan0o",
      "thumbnail": "https://i.ytimg.com/vi/OINppmPan0o/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, figure skating duo Vadym Kolesnik and Emilia Zingas sit down with Apolo Ohno on this episode of Making Team USA presented by Xfinity. The conversation, framed around the theme “Built on trust,” takes place ahead of the Winter Olympics.",
        "bullets": [
          "Interview episode of Making Team USA presented by Xfinity.",
          "Features pair skaters Vadym Kolesnik and Emilia Zingas.",
          "Hosted by Olympian Apolo Ohno.",
          "Theme emphasized: “Built on trust.”",
          "Airs ahead of the Winter Olympics and links to Team USA social channels."
        ],
        "takeaways": [
          "Trust and clear team roles are critical — ensure operational teams and vendors have well-defined responsibilities and mutual accountability.",
          "Prepare for high-stakes events with rehearsals and readiness checks similar to athletes’ pre-competition routines to reduce deployment risk.",
          "Highlight human factors in communications — visible leadership and transparent updates improve coordination during incidents.",
          "Design systems with redundancy and documented failover processes to support interdependent teams under pressure."
        ],
        "tags": [
          "figure-skating",
          "Vadym Kolesnik",
          "Emilia Zingas",
          "Apolo Ohno",
          "Making Team USA",
          "Xfinity",
          "WinterOlympics",
          "trust",
          "TeamUSA",
          "interview"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Podcast omawia, jak AI już zmienia podejście do cen transferowych — od monitorowania rentowności i analiz porównawczych po automatyzację dokumentacji — oraz jakie są praktyczne kroki wdrożeniowe. Eksperci Monika Palmowska i Jakub Roszkiewicz podkreślają, że AI wzmocni pracę doradców (nie zastąpi ich), zwracają uwagę na ryzyka związane z danymi, bezpieczeństwem i „halucynacjami”, oraz omawiają rozwiązania takie jak Digital Gateway, integrację z ERP i potrzebę uporządkowania procesów.",
        "bullets": [
          "Przykładowe zastosowania: monitorowanie rentowności, inteligentne benchmarki, automatyzacja dokumentacji cen transferowych",
          "AI ma wspierać doradców podatkowych i przyspieszać rozwój kompetencji młodszych pracowników",
          "Ryzyka: dane, bezpieczeństwo, problemy z wiarygodnością wyników (halucynacje) i wymogi RODO",
          "Digital Gateway jako przykład bezpiecznego środowiska pracy z AI",
          "Wdrożenie: integracja z ERP, uporządkowanie procesów i start od pilotażowych kroków/person"
        ],
        "takeaways": [
          "Przy wdrożeniu AI priorytetem musi być bezpieczne środowisko pracy z danymi (np. rozwiązania typu Digital Gateway)",
          "Zadbaj o zgodność z RODO oraz mechanizmy weryfikacji wyników, by ograniczyć ryzyko „halucynacji”",
          "Przygotuj ERP i systemy operacyjne do integracji z narzędziami AI i inteligentnymi benchmarkami",
          "Rozpocznij od uporządkowania procesów i pilotaży (persony, pierwsze kroki) — to fundament skalowalnej transformacji"
        ],
        "tags": [
          "podatki",
          "AI",
          "ceny transferowe",
          "transfer pricing",
          "automatyzacja",
          "RODO",
          "bezpieczeństwo danych",
          "ERP",
          "benchmarki",
          "KPMG"
        ]
      }
    },
    {
      "id": "dGfcT63U7Mo",
      "title": "The 2026 U.S. Olympic Figure Skating Team 🇺🇸",
      "channel": "Team USA",
      "published_at": "2026-01-15T20:43:24.000Z",
      "url": "https://www.youtube.com/watch?v=dGfcT63U7Mo",
      "thumbnail": "https://i.ytimg.com/vi/dGfcT63U7Mo/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This Team USA video announces the U.S. Olympic figure skating lineup for the 2026 Winter Olympics. No transcript is provided and the description contains only a brief line and a #WinterOlympics hashtag.",
        "bullets": [
          "Video title: The 2026 U.S. Olympic Figure Skating Team 🇺🇸",
          "Channel: Team USA; Published: 2026-01-15",
          "Description: “This U.S. Olympic Figure Skating lineup. 🔥”",
          "No transcript is available for the video",
          "No athlete names or lineup details appear in the description"
        ],
        "takeaways": [
          "Content is a sports announcement and does not indicate direct infrastructure or grid impacts",
          "Absence of a transcript limits accessibility, searchability, and automated indexing",
          "Metadata is minimal—rely on publisher, title, and publish date for cataloging unless full video is processed",
          "If automated classification or captioning is required, systems must process the video itself or generate a transcript"
        ],
        "tags": [
          "figure skating",
          "Team USA",
          "Winter Olympics",
          "2026",
          "Olympics",
          "U.S. Olympic team",
          "skating lineup",
          "sports announcement"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Microsoft Copilot is presented as a tool to help users keep momentum when tackling workouts, projects, or personal goals. The message emphasizes maintaining steady progress with Copilot’s assistance.",
        "bullets": [
          "Positioned to help keep momentum across workouts, projects, and personal goals",
          "Frames Copilot as a supportive tool for ongoing progress",
          "Applies to both fitness and project-oriented activities",
          "Encourages steady, continuous effort rather than one-off bursts"
        ],
        "takeaways": [
          "If teams adopt Copilot to sustain momentum on initiatives, decision-makers should evaluate pilot programs to measure productivity impact.",
          "Plan for basic training and guidance so staff can use Copilot to maintain progress without disrupting workflows.",
          "Track adoption and progress-related metrics to determine whether Copilot contributes to steadier project completion.",
          "Consider governance and access controls if Copilot becomes part of regular operational or project workflows."
        ],
        "tags": [
          "Microsoft Copilot",
          "productivity",
          "momentum",
          "workouts",
          "projects",
          "personal goals",
          "motivation",
          "assistant",
          "personal-development"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights how the Dell PowerEdge R770AP server, powered by Intel® Xeon® 6 processors, provides the precision and speed required for high-frequency trading. It notes these systems help maximize gains and minimize losses by executing hundreds of trades in seconds and frames Intel Xeon 6 CPUs as defining the future of finance.",
        "bullets": [
          "Focus on high-frequency trading where every second matters.",
          "Dell PowerEdge R770AP server is featured as the platform used.",
          "Powered by Intel® Xeon® 6 processors for high performance.",
          "Claims of maximized gains and minimized losses via fast execution.",
          "Executes hundreds of trades in seconds."
        ],
        "takeaways": [
          "Prioritize low-latency, high-throughput servers for trading workloads.",
          "Evaluate Dell PowerEdge R770AP configured with Intel Xeon 6 for HFT use cases.",
          "Ensure infrastructure supports rapid transaction rates to protect P&L in trading environments.",
          "Consider CPU performance (Intel Xeon 6) as a key factor when selecting hardware for finance applications."
        ],
        "tags": [
          "high-frequency trading",
          "Intel Xeon 6",
          "Dell PowerEdge R770AP",
          "low latency",
          "finance",
          "servers",
          "data center",
          "trading",
          "performance"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video frames Copilot as a tool that revived a lost creative spark and encourages viewers to download it via the link in the bio. It is a brief promotional message with no transcript or technical details provided.",
        "bullets": [
          "Promotional message: Copilot 'brought [the creative spark] back to life.'",
          "Clear call-to-action to download Copilot via the link in bio.",
          "No transcript available; only a short description accompanies the video.",
          "Emphasis is on creativity rather than technical features."
        ],
        "takeaways": [
          "Microsoft is promoting Copilot as a creativity/productivity tool—expect potential interest and download requests from staff.",
          "IT and procurement teams should be ready to handle inquiries about installation, licensing, and provisioning tied to marketing-driven adoption.",
          "The description provides no security, data governance, or infrastructure details—decision-makers need to consult official product documentation before deployment."
        ],
        "tags": [
          "Copilot",
          "Microsoft",
          "creativity",
          "download",
          "AI",
          "promotion",
          "call-to-action",
          "productivity",
          "ad"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video showcases the open-world martial arts RPG Where Winds Meet running with DLSS 4 and Multi Frame Generation, highlighting #RTXOn visuals. Footage is credited to @DigitalDreamsyt.",
        "bullets": [
          "Open-world martial arts RPG: Where Winds Meet",
          "Demonstrates DLSS 4 with Multi Frame Generation",
          "Promotes visuals with #RTXOn",
          "Footage credited to @DigitalDreamsyt"
        ],
        "takeaways": [
          "The demo highlights use of DLSS 4 and Multi Frame Generation, signaling reliance on NVIDIA’s advanced GPU features.",
          "Featuring #RTXOn suggests content that leverages RTX-capable hardware for enhanced visuals.",
          "Creator credit indicates community/creator-produced footage is being used to showcase hardware features and experiences."
        ],
        "tags": [
          "Where Winds Meet",
          "DLSS 4",
          "Multi Frame Generation",
          "RTXOn",
          "open-world",
          "martial arts RPG",
          "NVIDIA",
          "DigitalDreamsyt",
          "gaming"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video is published on the Intel Business channel and titled “Taha Khalifa (Intel) | Intel Business.” The channel positions itself as a source of IT resources, guidance, and expert insights covering topics from data centers to devices and provides links to its website and social channels.",
        "bullets": [
          "Video is hosted on the Intel Business YouTube channel and titled for Taha Khalifa (Intel).",
          "Channel promises IT resources, guidance, and expert insights for projects across data centers and devices.",
          "Description includes subscription link and links to Intel Business website and social accounts (X, LinkedIn, Facebook).",
          "Primary call to action is to visit the Intel Business website for more IT-center resources.",
          "Transcript is not available in the provided content."
        ],
        "takeaways": [
          "Use the Intel Business channel and website as a centralized source for vendor-backed IT guidance when planning or upgrading data center infrastructure.",
          "Rely on the channel’s stated expert insights to inform device-to-data-center integration and deployment decisions.",
          "Follow the listed social channels and website to stay updated on Intel’s IT resources and potential technical guidance relevant to grid/data center operations."
        ],
        "tags": [
          "Intel",
          "IntelBusiness",
          "IT",
          "datacenter",
          "devices",
          "ITresources",
          "TahaKhalifa",
          "techinsights",
          "itcenter"
        ]
      }
    },
    {
      "id": "kSocjh8PZnQ",
      "title": "Rynek dóbr luksusowych w obliczu transformacji | Andrzej Marczak, Tomasz Wiśniewski",
      "channel": "KPMG Poland",
      "published_at": "2026-01-13T10:23:31.000Z",
      "url": "https://www.youtube.com/watch?v=kSocjh8PZnQ",
      "thumbnail": "https://i.ytimg.com/vi/kSocjh8PZnQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The KPMG ON AIR episode reviews trends reshaping the luxury goods market—greater focus on experiences over ownership, rising ESG expectations, the growth of \"affordable luxury,\" and strong personalization—while noting that Poland's luxury market is still growing despite global declines. Experts Andrzej Marczak and Tomasz Wiśniewski highlight Gen Z preferences, luxury in hospitality and film, the role of young artists, premium tourism, and future drivers like AI, craftsmanship, and the human dimension.",
        "bullets": [
          "Global trends: \"luxury fatigue\" and concentration—top 2% of clients account for ~40% of the market.",
          "Shift toward experiences, personalization, and exclusive customer journeys; Gen Z values experiences over ownership.",
          "ESG and responsible luxury gaining importance (eco-leather, certifications).",
          "Poland: growing but fragmented market; rising domestic art scene and luxury tourism (Baltic, hotels, spas).",
          "Future drivers: AI, craftsmanship, human-centric experiences, plus expansion of \"affordable luxury\" and aspirational consumers."
        ],
        "takeaways": [
          "Allocate scalable compute (including GPU/AI capacity) to support AI-driven personalization and future analytics needs highlighted in the episode.",
          "Ensure low-latency, secure data processing and real-time analytics capability to enable personalized, experience-led services for luxury clients.",
          "Prioritize energy-efficient designs and access to renewable power to align with growing ESG expectations and potential certification demands.",
          "Consider localized/edge infrastructure to support premium hospitality and tourism hotspots for improved performance and guest experience."
        ],
        "tags": [
          "luxury",
          "ESG",
          "Poland",
          "personalization",
          "AI",
          "luxury-tourism",
          "Gen Z",
          "affordable-luxury",
          "art-market",
          "KPMG"
        ]
      }
    }
  ]
}