{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-29T08:01:35.006Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "feL4GUiP7Ws",
      "title": "Building Prior Authorization Systems for Healthcare Payors with Amazon Bedrock",
      "channel": "AWS Events",
      "published_at": "2026-01-29T05:43:38.000Z",
      "url": "https://www.youtube.com/watch?v=feL4GUiP7Ws",
      "thumbnail": "https://i.ytimg.com/vi/feL4GUiP7Ws/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This technical session shows how to use Amazon Bedrock foundation models to build an intelligent prior authorization system that meets CMS regulatory requirements while improving operational efficiency. AWS Engineers and the AWS Generative AI Innovation Center present an architecture that combines advanced NLP with healthcare workflows to automate LCD processing, analyze medical documentation, and produce explainable prior authorization recommendations.",
        "bullets": [
          "Uses Amazon Bedrock foundation models to power prior authorization workflows",
          "Combines advanced natural language processing with healthcare-specific workflows",
          "Automates processing of Local Coverage Determinations (LCDs)",
          "Analyzes complex medical documentation to generate explainable recommendations",
          "Designed to help payors meet CMS-0057-F timelines while maintaining compliance and accuracy"
        ],
        "takeaways": [
          "Plan for foundation-model integration (via Amazon Bedrock) when modernizing payor authorization systems",
          "Prioritize architectures that support explainability and auditability to satisfy CMS compliance needs",
          "Ensure workflows can ingest and process LCDs and complex medical documents for timely decisions",
          "Consider partnering with AWS/GIAC resources for design and implementation guidance to accelerate deployment"
        ],
        "tags": [
          "Amazon Bedrock",
          "prior authorization",
          "CMS-0057-F",
          "Local Coverage Determinations",
          "NLP",
          "healthcare payors",
          "explainability",
          "compliance",
          "generative AI",
          "operational efficiency"
        ]
      }
    },
    {
      "id": "7CbJoeEFyZg",
      "title": "Transforming Healthcare Document Processing Workflows with Generative AI",
      "channel": "AWS Events",
      "published_at": "2026-01-28T21:33:21.000Z",
      "url": "https://www.youtube.com/watch?v=7CbJoeEFyZg",
      "thumbnail": "https://i.ytimg.com/vi/7CbJoeEFyZg/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this session demonstrates AWS's GenAI Intelligent Document Processing (GenAIIDP) for healthcare, showing how Amazon Textract and Bedrock can turn manual, days-long document workflows into automated processes that run in minutes. It features live demos and architecture deep-dives on automated classification, data extraction, criteria validation, HIPAA compliance, scalable pipeline implementation, integration patterns, and ROI best practices.",
        "bullets": [
          "Showcases GenAIIDP combining Amazon Textract and Bedrock to automate complex medical document processing.",
          "Transforms manual, days-long workflows into minute-scale automated processes.",
          "Covers automated classification, data extraction, and criteria validation while maintaining HIPAA compliance.",
          "Includes live demonstrations and detailed architecture deep-dives for scalable document pipelines.",
          "Provides integration patterns with existing systems and best practices for ROI optimization."
        ],
        "takeaways": [
          "Faster document processing can substantially reduce operational bottlenecks and throughput delays.",
          "Maintaining HIPAA compliance is an explicit design consideration for deploying GenAIIDP in healthcare.",
          "Scalable pipeline architectures and integration patterns are critical for adopting automated document workflows across systems.",
          "Investments in automation can improve ROI by shortening processing time and reducing manual effort."
        ],
        "tags": [
          "AWS",
          "GenAIIDP",
          "Amazon Textract",
          "Bedrock",
          "healthcare",
          "HIPAA",
          "document processing",
          "automation",
          "architecture",
          "ROI"
        ]
      }
    },
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy GenAI solutions that unlocked new revenue streams. They leveraged Google Cloud's robust infrastructure to streamline operations, boost developer productivity, compress their digital transformation timeline, and expand the company's ambitions.",
        "bullets": [
          "TTEC worked with Google Cloud Consulting to accelerate AI prototyping and deployment.",
          "GenAI and Google Cloud infrastructure were central to the initiative.",
          "The project unlocked entirely new revenue streams for TTEC.",
          "Operations were streamlined and developer productivity improved.",
          "Consulting compressed the digital transformation timeline and expanded business ambitions."
        ],
        "takeaways": [
          "Prioritize infrastructure capable of supporting GenAI workloads to accelerate time-to-value.",
          "Partnering with cloud consultancies can compress transformation timelines and de-risk deployments.",
          "Invest in developer-focused tooling and platforms to boost productivity and speed AI rollout.",
          "AI-enabled services can open new revenue streams—plan capacity and connectivity accordingly."
        ],
        "tags": [
          "googlecloud",
          "ttec",
          "genai",
          "aideployment",
          "operationalefficiency",
          "customerexperience",
          "googlecloudplatform",
          "generativeai"
        ]
      }
    },
    {
      "id": "5CyVBSbHmbA",
      "title": "Year-end toolkit: Strengthening audit committee collaboration",
      "channel": "PwC US",
      "published_at": "2026-01-27T17:20:31.000Z",
      "url": "https://www.youtube.com/watch?v=5CyVBSbHmbA",
      "thumbnail": "https://i.ytimg.com/vi/5CyVBSbHmbA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This PwC Year-end toolkit episode addresses how finance teams can strengthen collaboration with audit committees and streamline year-end accounting and reporting. It highlights communication strategies and preparedness for emerging oversight topics including AI, enterprise risk management, cyber risk in the age of AI, and proxy disclosures.",
        "bullets": [
          "Guidance on strengthening management/audit committee communication and collaboration (1:18).",
          "Overview of key year-end accounting and reporting issues finance teams should prepare to address (10:10).",
          "Discussion of AI oversight: risks, opportunities, and required controls (15:02).",
          "Approaches to enhancing enterprise risk oversight and navigating evolving cyber risk amid AI (21:33, 27:35).",
          "Recommendations for elevating proxy disclosures and links to related PwC resources and replay (36:05)."
        ],
        "takeaways": [
          "Engage proactively with the audit committee on year-end reporting and transformation initiatives to ensure governance alignment.",
          "Be prepared to discuss AI usage, associated risks, and the controls in place—expect this to be a governance focus.",
          "Strengthen enterprise risk oversight frameworks so oversight bodies can address AI-related and broader risk trends.",
          "Prioritize cyber risk management in the context of AI developments and ensure disclosures reflect material governance and risk topics."
        ],
        "tags": [
          "audit-committee",
          "year-end",
          "financial-reporting",
          "AI-oversight",
          "enterprise-risk-management",
          "cyber-risk",
          "proxy-disclosures",
          "governance",
          "PwC"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Jo discovers how Copilot Groups simplifies route planning. The short video highlights the power of Copilot Groups to make route planning easier.",
        "bullets": [
          "Showcases Copilot Groups helping with route planning",
          "Features Jo as the user discovering the capability",
          "Emphasizes simplicity and ease of planning",
          "Mentions Copilot and Microsoft Copilot branding",
          "Includes hashtags: #copilot #microsoftcopilot #ai"
        ],
        "takeaways": [
          "Simpler route planning can reduce travel time and logistics complexity for field teams",
          "Copilot Groups may improve coordination between planners and technicians during outages or maintenance",
          "Faster planning can contribute to quicker incident response and shorter maintenance windows",
          "Adopting AI collaboration tools like Copilot Groups could drive operational efficiency in grid and data center logistics"
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "route-planning",
          "copilot-groups",
          "logistics",
          "field-operations",
          "maintenance",
          "dispatch",
          "productivity"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI w audycie to codzienność — narzędzia AI wspierają zespoły audytowe w powtarzalnych czynnościach, analizie dużych zbiorów danych i podejmowaniu decyzji. Rozmówczynie opisują konkretne rozwiązania (AI Transaction Scoring Tool, Clara AI, platforma KPMG Clara), przejście od próbkowania do analiz pełnych populacji oraz wyzwania związane z kompetencjami audytorów, bezpieczeństwem danych i regulacjami.",
        "bullets": [
          "AI automatyzuje powtarzalne zadania i umożliwia analizę pełnych populacji (AI Transaction Scoring Tool).",
          "Clara AI działa jako konwersacyjny asystent i zestaw wyspecjalizowanych agentów, a platforma KPMG Clara zarządza badaniem w czasie rzeczywistym.",
          "Clara for Clients usprawnia komunikację z klientem i wymianę informacji.",
          "Technologie wspierają dokumentację i analizę ujawnień oraz zmieniają rolę audytora, wymagając nowych kompetencji.",
          "Wdrożeniu AI towarzyszą wyzwania: adaptacja zespołów, bezpieczeństwo danych, środowisko regulacyjne i potencjalne zagrożenia."
        ],
        "takeaways": [
          "Przygotuj dobrze uporządkowane i dostępne dane — pełnopopulacyjne analizy oznaczają, że audyt może objąć więcej transakcji i zasobów.",
          "Zadbaj o bezpieczne, zgodne z regulacjami kanały wymiany danych, jeśli planujesz integrację z narzędziami audytowymi opartymi na AI.",
          "Oczekuj szybszej, bardziej interaktywnej współpracy podczas audytu — platformy do zarządzania badaniem w czasie rzeczywistym wymagają operacyjnej gotowości po stronie klienta.",
          "Inwestuj w kompetencje cyfrowe i governance — zarówno zespoły wewnętrzne, jak i zewnętrzni audytorzy będą potrzebować umiejętności pracy z AI oraz zarządzania związanymi z tym ryzykami."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMG",
          "KPMG Clara",
          "Clara AI",
          "audit automation",
          "full-population analysis",
          "data security",
          "audit innovation"
        ]
      }
    }
  ]
}