{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-22T22:47:35.287Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI w audycie jest już codziennością: narzędzia wspierają zespoły audytowe przy powtarzalnych czynnościach, analizie dużych zbiorów danych i podejmowaniu decyzji. W podcaście ekspertki KPMG omawiają konkretne zastosowania (AI Transaction Scoring, Clara AI, platforma KPMG Clara), korzyści dla klientów, migrację od próbkowania do analiz pełnych populacji oraz wyzwania związane z bezpieczeństwem danych i regulacjami.",
        "bullets": [
          "Narzędzia AI usprawniają zadania powtarzalne i analizę pełnych populacji transakcji.",
          "Clara AI działa jako konwersacyjny asystent oraz zestaw wyspecjalizowanych agentów.",
          "KPMG Clara umożliwia zarządzanie audytem w czasie rzeczywistym i nowoczesną komunikację z klientem.",
          "Technologie przesuwają rolę audytora oraz wymagają nowych kompetencji i adaptacji zespołów.",
          "Wdrażanie AI wiąże się z wyzwaniami: bezpieczeństwo danych, środowisko regulacyjne i potencjalne ryzyka."
        ],
        "takeaways": [
          "Zadbaj o jakość i dostępność danych — pełnopopulacyjne analizy AI wymagają kompletnych, uporządkowanych zbiorów.",
          "Upewnij się, że platformy audytowe spełniają wymogi bezpieczeństwa i zgodności regulacyjnej przed integracją z infrastrukturą.",
          "Przygotuj organizację na szybszą, bieżącą wymianę informacji z audytorem — real‑time management zmienia model komunikacji.",
          "Inwestuj w kompetencje zespołu (data literacy, obsługa narzędzi AI), bo technologia przesuwa rolę kontrolną audytorów."
        ],
        "tags": [
          "AI",
          "audyt",
          "KPMG",
          "KPMG Clara",
          "Clara AI",
          "analiza danych",
          "bezpieczeństwo danych",
          "automatyzacja",
          "transaction scoring"
        ]
      }
    },
    {
      "id": "6hu7hYLiu08",
      "title": "Get Step-By-Step Fixes with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-21T20:14:00.000Z",
      "url": "https://www.youtube.com/watch?v=6hu7hYLiu08",
      "thumbnail": "https://i.ytimg.com/vi/6hu7hYLiu08/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Copilot provides real-time visual support for home projects and repairs, offering clear, step-by-step instructions. It can \"see what you see\" to guide users through fixes for issues like leaky pipes and overflowing washing machines.",
        "bullets": [
          "Real-time visual assistance—Copilot interprets user view to provide guidance.",
          "Step-by-step instructions for common household repairs.",
          "Examples include plumbing leaks and washing machine overflows.",
          "Focused on clear, actionable guidance for DIY or assisted fixes.",
          "Aims to support faster, more confident repair workflows."
        ],
        "takeaways": [
          "Visual, real-time guidance can enable remote troubleshooting for field technicians and reduce on-site specialist visits.",
          "Step-by-step instructions support consistent maintenance procedures, potentially shortening repair times and reducing human error.",
          "AI-assisted guidance can be used to train less-experienced staff quickly and standardize response protocols.",
          "Deploying similar tools in grid/data center contexts could improve first-time-fix rates and reduce operational downtime."
        ],
        "tags": [
          "Copilot",
          "real-time support",
          "visual assistance",
          "step-by-step",
          "home repairs",
          "remote troubleshooting",
          "maintenance",
          "AI guidance",
          "field service",
          "training"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Arknights: Endfield has officially launched and the trailer highlights NVIDIA DLSS 4 with Multi Frame Generation. The footage was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 Multi Frame Generation 4X mode.",
        "bullets": [
          "Arknights: Endfield is a newly launched 3D real-time strategy RPG where you play the Endministrator exploring Talos-II.",
          "Trailer emphasizes NVIDIA DLSS 4 with Multi Frame Generation; NVIDIA link included.",
          "Captured on GeForce RTX 5080 at 4K Ultra settings with DLSS 4 MFGen in 4X mode.",
          "Links provided for the game site and multiple Arknights social channels.",
          "NVIDIA GeForce channel and community portal links included for subscriptions and follow-up."
        ],
        "takeaways": [
          "The trailer showcases DLSS 4 MFGen in a commercial game—evaluate DLSS 4 support when specifying GPUs for high‑resolution real‑time rendering or capture tasks.",
          "Capture was performed on an RTX 5080 at 4K Ultra, serving as a reference point for the class of GPU needed for similar workloads.",
          "Assess software and driver compatibility (DLSS SDK, MFGen) alongside hardware procurement decisions for content capture or cloud streaming deployments.",
          "Confirm licensing, integration effort, and throughput implications of multi‑frame generation tech before rolling it into production/cloud environments."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "NVIDIA",
          "RTX5080",
          "4K",
          "GeForce",
          "gaming"
        ]
      }
    },
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video shows how Rate Insurance boosts agent efficiency using Agentforce and Gemini. It also provides a link to learn more about the Google Cloud and Salesforce partnership.",
        "bullets": [
          "Shows Rate Insurance improving agent efficiency with Agentforce and Gemini.",
          "References the Google Cloud and Salesforce partnership (link provided).",
          "Promotes a use-case demonstrating Agentforce and Gemini in action.",
          "Directs viewers to the partnership resource for more information."
        ],
        "takeaways": [
          "Use the provided Google Cloud–Salesforce partnership link as a starting point to assess technical and integration details for Agentforce and Gemini.",
          "If supporting deployments like this, review cloud integration, capacity, and compatibility requirements referenced by the partners.",
          "Engage vendor and SaaS partner resources (e.g., Salesforce/Google Cloud) when planning infrastructure to support agent-focused AI/platform solutions."
        ],
        "tags": [
          "Google Cloud",
          "Salesforce",
          "Rate Insurance",
          "Agentforce",
          "Gemini",
          "agent efficiency",
          "cloud partnership",
          "cloud AI",
          "customer service",
          "case study"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Charly Stoever, a 35-year-old financial coach, lives rent-free in Portland, Oregon by pet sitting full time and has spent the last 18 months living out of two suitcases while earning $60,000 a year. The segment is part of CNBC Make It's Millennial Money series.",
        "bullets": [
          "Charly Stoever, 35, is a financial coach.",
          "Lives rent-free in Portland, Oregon by pet sitting full time.",
          "Has lived out of two suitcases for the past 18 months.",
          "Brings in $60,000 a year.",
          "Segment is from CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "The description focuses on personal finance and lifestyle and does not address grid, data center, or infrastructure topics.",
          "No details are provided about technology, connectivity, or energy usage that would inform grid/data-center decisions.",
          "For grid/data-center decision-makers, this piece offers human-interest financial context rather than operational or technical guidance."
        ],
        "tags": [
          "Charly Stoever",
          "pet sitting",
          "rent-free",
          "financial coach",
          "Portland, Oregon",
          "travel",
          "living-out-of-two-suitcases",
          "CNBC Make It",
          "Millennial Money",
          "$60,000"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This technology uses a giant bubble of carbon dioxide to store energy and can deliver 20 megawatts for eight hours. The device is presented as a way to smooth renewable variability and support the global shift to clean energy.",
        "bullets": [
          "Giant carbon dioxide bubble used as an energy storage medium",
          "Delivers 20 megawatts of power",
          "Provides eight hours of energy storage",
          "Designed to address fluctuations in renewable generation",
          "Positioned to support the global transition to clean energy"
        ],
        "takeaways": [
          "8-hour duration at 20 MW suggests suitability for multi-hour load shifting and extended backup needs.",
          "Can help firm variable renewable generation, improving grid and microgrid reliability.",
          "Relevant option for data centers evaluating multi-hour backup or resilience strategies.",
          "Capacity per unit should be matched against facility demand profiles to determine number of units required."
        ],
        "tags": [
          "CO2-battery",
          "carbon dioxide",
          "energy storage",
          "long-duration storage",
          "renewables",
          "grid",
          "data-centers",
          "battery",
          "innovation",
          "ieee"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI już teraz wpływa na podejście do cen transferowych — wspiera monitorowanie rentowności, analizy porównawcze oraz automatyzację dokumentacji, a eksperci KPMG omawiają też integrację z ERP i bezpieczne środowiska pracy. W podcaście poruszono także ograniczenia i ryzyka (RODO, halucynacje, bezpieczeństwo) oraz podkreślono, że AI wzmacnia doradców i wymaga uporządkowania procesów i rozwoju kompetencji.",
        "bullets": [
          "Zastosowania AI: monitorowanie rentowności, benchmarki i automatyzacja dokumentacji cen transferowych.",
          "AI jako wsparcie dla doradców — nie zastąpi, ale zwiększy efektywność i rozwój młodszych pracowników.",
          "Główne ryzyka: dane, bezpieczeństwo, RODO oraz problem halucynacji modeli AI.",
          "Digital Gateway przedstawiony jako bezpieczne środowisko do pracy z AI.",
          "Wdrożenie: integracja z ERP, inteligentne benchmarki i uporządkowanie procesów jako pierwszy krok."
        ],
        "takeaways": [
          "Zapewnij bezpieczne środowisko przetwarzania AI (np. izolowane rozwiązania typu Digital Gateway) by spełnić wymogi RODO i bezpieczeństwa danych.",
          "Planuj infrastrukturę pod integrację AI z ERP i narzędziami benchmarkingowymi (API, sieć, moc obliczeniowa, dostęp do danych).",
          "Wdroż procesy zarządzania danymi i kontroli dostępu oraz monitorowania modeli, aby ograniczyć ryzyka związane z halucynacjami i naruszeniami danych.",
          "Wspieraj automatyzację dokumentacji i monitoringu rentowności, a także szkolenia personelu — technologia wzmacnia kompetencje, ale wymaga organizacyjnych podstaw."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "podatki",
          "automatyzacja",
          "RODO",
          "bezpieczeństwo",
          "ERP",
          "Digital Gateway",
          "KPMG",
          "bencharki"
        ]
      }
    }
  ]
}