{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-20T13:20:05.902Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Dr. Anna Chacon, 39, is a Miami-based dermatologist who runs her own private practice. Her net worth is about $6 million, made up of $3.2 million in investments, a $1.9 million home, and a $1.1 million office building.",
        "bullets": [
          "Dr. Anna Chacon, age 39, lives in Miami, FL.",
          "She is a dermatologist with a private practice.",
          "Estimated net worth: ~$6 million.",
          "Net worth breakdown: $3.2M investments, $1.9M home, $1.1M office building."
        ],
        "takeaways": [
          "Consider small owner-occupied commercial properties (like physician-owned office buildings) as potential commercial customers for reliable power and resilience offerings.",
          "Private medical practices housed in owned offices represent local, steady commercial loads—useful for customer segmentation and service-level planning.",
          "High-net-worth individuals who hold investments and real estate may be targets for premium energy management or backup-power solutions for their properties.",
          "When assessing demand in markets such as Miami, include professional services and owner-occupied office assets in load forecasting and site-selection analyses."
        ],
        "tags": [
          "dermatologist",
          "private practice",
          "Miami",
          "net worth",
          "investments",
          "real estate",
          "office building",
          "homeownership",
          "personal finance",
          "wealth"
        ]
      }
    },
    {
      "id": "6L86-OnOXV0",
      "title": "How I Built A $1M/Year Business - And Helped My Parents Retire",
      "channel": "CNBC Make It",
      "published_at": "2026-01-17T15:00:09.000Z",
      "url": "https://www.youtube.com/watch?v=6L86-OnOXV0",
      "thumbnail": "https://i.ytimg.com/vi/6L86-OnOXV0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Tuan Le emigrated from Vietnam to Toronto in 2015 and vowed at 15 to help his parents retire. Ten years later his social video production company, ShortsCut, brings in over $1 million USD annually, and he now pays his parents' rent and living expenses.",
        "bullets": [
          "Family emigrated from Vietnam to Toronto in 2015; Tuan vowed at 15 to help his parents retire.",
          "Tuan founded ShortsCut, a social video production company.",
          "ShortsCut generates over $1 million USD per year in sales.",
          "He now covers his parents' rent and living expenses so they no longer work full time.",
          "Video produced by CNBC Make It; Produced & Edited by Zach Green."
        ],
        "takeaways": [
          "A social video production company reaching over $1M/year shows digital media firms can be commercially significant customers for infrastructure providers.",
          "Rapid business growth in content production suggests watching creator-focused businesses as potential demand drivers for capacity and services.",
          "Coverage by outlets like CNBC Make It can raise visibility of successful digital agencies, potentially increasing regional demand for related digital infrastructure.",
          "Entrepreneurial success tied to content production underscores the importance of reliable, scalable support for media workflows as these businesses expand."
        ],
        "tags": [
          "ShortsCut",
          "Tuan Le",
          "entrepreneurship",
          "social video",
          "million-dollar business",
          "immigrant story",
          "family support",
          "Toronto",
          "content production",
          "CNBC Make It"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, a giant bubble of carbon dioxide can store 20 megawatts of energy. The description frames these CO2 batteries as a way to address renewable energy fluctuations and to support the global transition to clean energy.",
        "bullets": [
          "A giant bubble of carbon dioxide is used as an energy storage medium with 20 MW capacity.",
          "Intended to help manage fluctuations from renewable energy sources.",
          "Presented as a technology that can power the shift to clean energy globally.",
          "Reported by IEEE Spectrum in the video description."
        ],
        "takeaways": [
          "20 MW storage capacity may be relevant for capacity planning—assess whether that scale matches your grid or data center needs.",
          "This technology is positioned to address renewable intermittency, so consider it among options for improving supply reliability.",
          "Include CO2-based storage in long-term decarbonization and resilience evaluations alongside other storage technologies."
        ],
        "tags": [
          "carbon-dioxide",
          "CO2",
          "energy-storage",
          "battery",
          "renewables",
          "clean-energy",
          "grid",
          "innovation",
          "ieee-spectrum",
          "tech"
        ]
      }
    },
    {
      "id": "OINppmPan0o",
      "title": "Figure Skating | Making Team USA presented by Xfinity with Apolo Ohno",
      "channel": "Team USA",
      "published_at": "2026-01-16T19:30:36.000Z",
      "url": "https://www.youtube.com/watch?v=OINppmPan0o",
      "thumbnail": "https://i.ytimg.com/vi/OINppmPan0o/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, figure skating duo Vadym Kolesnik and Emilia Zingas sit down with Apolo Ohno on this episode of Making Team USA presented by Xfinity as they prepare for the Winter Olympics. The episode is framed around the theme “Built on trust.”",
        "bullets": [
          "Interview features Vadym Kolesnik and Emilia Zingas with host Apolo Ohno.",
          "Episode is part of Making Team USA, presented by Xfinity.",
          "Conversation takes place ahead of the Winter Olympics.",
          "Central theme highlighted: “Built on trust.”",
          "Video description includes Team USA subscription and social links."
        ],
        "takeaways": [
          "Emphasizing trust between partners is key for high-performance teams and partnerships.",
          "Preparation for major, high-stakes events reinforces the need for focused readiness and coordination.",
          "Storytelling and athlete-focused content can be used internally to strengthen team culture and alignment."
        ],
        "tags": [
          "figure skating",
          "Vadym Kolesnik",
          "Emilia Zingas",
          "Apolo Ohno",
          "Winter Olympics",
          "Making Team USA",
          "Xfinity",
          "Team USA",
          "athlete interview",
          "trust"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… KPMG ON AIR hosts Monika Palmowska and Jakub Roszkiewicz discussing how AI is already changing transfer pricing work — from profitability monitoring and benchmarking to automation of documentation — and why it matters now. They cover that AI should augment, not replace, tax advisors; outline implementation steps (including ERP integration and process organization); and highlight risks such as data security, RODO and hallucinations, plus solutions like a secure Digital Gateway.",
        "bullets": [
          "AI applications: monitoring rentowności, porównawcze analizy, automatyzacja dokumentacji cen transferowych.",
          "AI jako wsparcie doradców podatkowych — nie zastępuje, ale wzmacnia pracę i rozwój młodszych pracowników.",
          "Główne ryzyka: dane, bezpieczeństwo, RODO oraz problem halucynacji AI.",
          "Rozwiązania i integracja: Digital Gateway jako bezpieczne środowisko, integracja z ERP i inteligentne benchmarki.",
          "Wdrożenie: zacząć od uporządkowania procesów i określenia pierwszych kroków transformacji."
        ],
        "takeaways": [
          "Zadbaj o zgodność z RODO i silne zabezpieczenia danych przed wdrożeniem AI do procesów podatkowych i cen transferowych.",
          "Udostępnij lub wdroż bezpieczne, izolowane środowiska pracy z AI (np. Digital Gateway) dla wrażliwych danych finansowych.",
          "Zapewnij integracyjne punkty z ERP — to klucz do wykorzystania AI w inteligentnych benchmarkach i monitorowaniu rentowności.",
          "Wspieraj porządkowanie procesów przed techniczną implementacją AI, aby zwiększyć skuteczność i kontrolę nad automatyzacją."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "podatki",
          "automatyzacja",
          "ERP",
          "bezpieczeństwo danych",
          "RODO",
          "Digital Gateway",
          "KPMG",
          "podcast"
        ]
      }
    },
    {
      "id": "dGfcT63U7Mo",
      "title": "The 2026 U.S. Olympic Figure Skating Team 🇺🇸",
      "channel": "Team USA",
      "published_at": "2026-01-15T20:43:24.000Z",
      "url": "https://www.youtube.com/watch?v=dGfcT63U7Mo",
      "thumbnail": "https://i.ytimg.com/vi/dGfcT63U7Mo/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The video presents the U.S. Olympic figure skating lineup with an enthusiastic tone (fire emoji). The description includes the hashtag #WinterOlympics.",
        "bullets": [
          "Announces the U.S. Olympic figure skating lineup.",
          "Tone is enthusiastic, highlighted by a fire emoji.",
          "Includes the hashtag #WinterOlympics.",
          "No transcript is available for the video."
        ],
        "takeaways": [
          "Classify and tag this asset as Winter Olympics–related content (use #WinterOlympics) for event-based cataloging.",
          "Preserve the description text and emojis in metadata to retain context and tone.",
          "Add a transcript/captions to improve accessibility, searchability, and indexing since none is present.",
          "Treat this as an event-specific promotional asset when planning retention and discovery priorities."
        ],
        "tags": [
          "U.S.",
          "Olympic",
          "FigureSkating",
          "Lineup",
          "WinterOlympics",
          "WinterSports",
          "Skating",
          "Olympics",
          "Sports"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video urges viewers to keep momentum by stacking small wins with Microsoft Copilot when working on workouts, projects, or personal goals. It presents Copilot as a way to sustain progress and build consistency.",
        "bullets": [
          "Focus on stacking small wins to maintain momentum.",
          "Applies to workouts, projects, and personal goals.",
          "Positions Microsoft Copilot as a tool to help sustain progress.",
          "Emphasizes consistency and ongoing progress.",
          "Short, motivational message about gradual improvement."
        ],
        "takeaways": [
          "Small, incremental progress can help large operational projects avoid setbacks by maintaining steady momentum.",
          "Framing Copilot as a tool for routine, incremental tasks may improve staff engagement with AI-assisted workflows.",
          "Sustained, consistent actions—supported by tools like Copilot—can accelerate achievement of longer-term goals.",
          "Encouraging small wins can be a practical change-management tactic to drive gradual improvements in data center or grid operations."
        ],
        "tags": [
          "Microsoft Copilot",
          "small wins",
          "momentum",
          "productivity",
          "workouts",
          "projects",
          "personal goals",
          "goal-setting",
          "motivation",
          "consistency"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video highlights how the Dell PowerEdge R770AP server powered by Intel® Xeon® 6 processors delivers the precision and speed required for high-frequency trading. It emphasizes performing hundreds of trades in seconds to help maximize gains and minimize losses and positions Intel Xeon 6 CPUs as defining the future of finance.",
        "bullets": [
          "Focuses on high-frequency trading (HFT) use case.",
          "Showcases Dell PowerEdge R770AP with Intel® Xeon® 6 processors.",
          "Highlights precision and speed for executing hundreds of trades in seconds.",
          "Claims benefits: maximize gains and minimize losses.",
          "Positions Intel Xeon 6 CPUs as shaping the future of finance."
        ],
        "takeaways": [
          "Consider high-performance server/CPU choices (e.g., Dell PowerEdge R770AP with Intel Xeon 6) for low-latency trading workloads.",
          "Prioritize compute platforms that deliver precision and speed to support hundreds of transactions per second.",
          "Evaluate infrastructure investments that can directly impact trading performance and financial outcomes."
        ],
        "tags": [
          "high-frequency trading",
          "HFT",
          "Intel Xeon 6",
          "Dell PowerEdge R770AP",
          "low latency",
          "finance",
          "data center",
          "high-performance computing",
          "trading infrastructure",
          "servers"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video presents Copilot as a tool that revived a lost creative spark and invites viewers to download and try it via the link in the bio. No transcript is available; the description focuses on the emotional benefit and a clear call to action.",
        "bullets": [
          "No transcript available; messaging comes solely from the description.",
          "Core message: Copilot restored creativity.",
          "Clear call to action to download and try Copilot via the link in bio.",
          "Emphasis on emotional/creative benefit rather than features or specifics."
        ],
        "takeaways": [
          "If creative ideation influences your grid or data center planning teams, consider evaluating Copilot to see if it aids brainstorming or design sessions.",
          "Use the link in the video description to run a quick pilot with a small team before wider rollout.",
          "Treat the message as an invitation to test Copilot’s impact on team creativity and document results to inform adoption decisions."
        ],
        "tags": [
          "Copilot",
          "Microsoft Copilot",
          "creativity",
          "AI",
          "productivity",
          "download",
          "try now",
          "ad",
          "creative tools"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video showcases the open-world martial arts RPG Where Winds Meet running with DLSS 4 and Multi Frame Generation. It promotes RTX-enabled visuals (#RTXOn) and credits footage to @DigitalDreamsyt.",
        "bullets": [
          "Features Where Winds Meet, an open-world martial arts RPG",
          "Highlights DLSS 4 with Multi Frame Generation",
          "Promotes RTX-enabled visuals (#RTXOn)",
          "Footage credited to @DigitalDreamsyt"
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is being showcased — plan for testing and support of DLSS 4–compatible GPUs and drivers.",
          "RTX-on visuals suggest demand for GPU-accelerated rendering capacity for accurate demos and visual fidelity testing.",
          "Open-world game content may require sustained GPU performance for capture, benchmarking, and cloud streaming workflows.",
          "High-quality creator footage implies needs for encoding/transcoding and storage resources in media pipelines."
        ],
        "tags": [
          "Where Winds Meet",
          "DLSS 4",
          "Multi Frame Generation",
          "RTXOn",
          "open-world",
          "martial arts RPG",
          "NVIDIA GeForce",
          "DigitalDreamsyt",
          "game graphics"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this Intel Business video features Taha Khalifa and is hosted on the Intel Business YouTube channel. The channel provides IT information, resources, guidance, and expert insights covering topics from data centers to devices, and encourages viewers to subscribe and follow Intel Business across its website and social channels.",
        "bullets": [
          "Video title: Taha Khalifa (Intel) | Intel Business.",
          "Channel focus: IT info and resources spanning data centers to devices.",
          "Purpose: guidance and expert insights to support IT projects.",
          "Calls to action: subscribe and follow on website and social platforms.",
          "Contact points listed: Intel Business website and social links."
        ],
        "takeaways": [
          "Intel Business positions itself as a centralized resource for data center and IT project guidance.",
          "Decision-makers can use the Intel Business website and channel to find expert insights relevant to infrastructure planning.",
          "Following the channel and social feeds provides an ongoing stream of Intel-aligned IT resources and updates."
        ],
        "tags": [
          "Intel Business",
          "Taha Khalifa",
          "data centers",
          "IT resources",
          "enterprise IT",
          "Intel",
          "IT guidance",
          "technology",
          "ITcenter"
        ]
      }
    }
  ]
}