{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-23T22:41:16.701Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The Microsoft Copilot video (Zip Up, Clip In, Copilot On) shows Jo discovering the power of Copilot Groups and presents route planning made easy. No transcript is available, and the description uses #copilot #microsoftcopilot #ai.",
        "bullets": [
          "Title: Zip Up, Clip In, Copilot On",
          "Channel: Microsoft Copilot",
          "Published: 2026-01-23T22:36:46.000Z",
          "Core message: Route planning made easy — Jo discovers Copilot Groups",
          "Transcript: not available"
        ],
        "takeaways": [
          "If your operations include route planning or field visits, the video suggests Copilot Groups may be relevant to explore.",
          "Consider reviewing Copilot Groups to see if they can simplify coordination of teams and routes.",
          "Use the video as a prompt to evaluate Copilot Groups in pilot tests before wider adoption.",
          "Watch the content to determine fit for your specific maintenance, field-ops, or logistics workflows."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "route-planning",
          "copilot-groups",
          "productivity",
          "field-ops",
          "logistics"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI w audycie to już codzienność w KPMG — narzędzia AI automatyzują powtarzalne zadania, analizują pełne populacje danych i wspierają podejmowanie trafnych decyzji. Podcast omawia konkretne rozwiązania (AI Transaction Scoring Tool, Clara AI, platforma KPMG Clara), wpływ technologii na rolę audytora oraz wyzwania związane z bezpieczeństwem danych i regulacjami.",
        "bullets": [
          "AI wspiera analizę dużych zbiorów danych i pozwala przejść od próbkowania do analizy pełnych populacji.",
          "AI Transaction Scoring Tool umożliwia automatyczną ocenę transakcji na poziomie całej populacji.",
          "Clara AI działa jako konwersacyjny asystent i zestaw wyspecjalizowanych agentów wspierających audyt.",
          "Platforma KPMG Clara zapewnia zarządzanie badaniem w czasie rzeczywistym; Clara for Clients usprawnia komunikację z klientem.",
          "Omówione są też wyzwania: adaptacja audytorów, bezpieczeństwo danych, środowisko regulacyjne i potencjalne zagrożenia AI."
        ],
        "takeaways": [
          "Pełna analiza populacji zwiększa dokładność i wykrywalność anomalii — warto oczekiwać bardziej kompletnych i szybszych raportów audytowych.",
          "Real‑time management (KPMG Clara) może skrócić cykle audytu i przyspieszyć decyzje operacyjne związane z infrastrukturą.",
          "Narzędzia konwersacyjne i klient‑centric (Clara for Clients) upraszczają przepływ informacji między audytorem a organizacją — ułatwia to współpracę przy audytach centrów danych.",
          "Integracja AI wymaga priorytetu na bezpieczeństwo danych i zgodność regulacyjną — konieczne są jasne zasady dostępu i przetwarzania danych.",
          "Organizacje powinny planować wsparcie kompetencyjne i procesowe dla zespołów audytu, by wykorzystać korzyści AI bez pogorszenia kontroli wewnętrznej."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMG",
          "KPMG Clara",
          "Clara AI",
          "pełna populacja",
          "bezpieczeństwo danych",
          "innowacje w audycie"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield has officially launched and the trailer highlights NVIDIA DLSS 4 with Multi Frame Generation. The game is a 3D real-time strategy RPG in which players act as the Endministrator exploring Talos-II, and the footage was captured on a GeForce RTX 5080 at 4K Ultra Settings using DLSS 4 Multi Frame Generation 4X Mode.",
        "bullets": [
          "Arknights: Endfield officially launched; trailer emphasizes NVIDIA DLSS 4 with Multi Frame Generation.",
          "Genre: 3D real-time strategy RPG; player role: Endministrator exploring Talos-II.",
          "Trailer capture details: GeForce RTX 5080, 4K Ultra Settings, DLSS 4 Multi Frame Generation 4X Mode.",
          "Description links to official game site and NVIDIA DLSS 4 announcement.",
          "Social channels listed for Arknights: Endfield and NVIDIA GeForce."
        ],
        "takeaways": [
          "Commercial adoption of DLSS 4 with Multi Frame Generation indicates demand for GPUs that support DLSS 4 features in content production and delivery.",
          "4K Ultra capture on an RTX 5080 highlights increased use of high-end GPUs for promotional content—plan capacity for similar high-resolution workloads.",
          "Trailers using DLSS 4 MFG suggest potential changes in rendering and streaming compute patterns; consider GPU models that support MFG for cloud gaming or encoding pipelines.",
          "Multiple platform distribution links imply multi-channel delivery needs—ensure infrastructure supports GPU-accelerated encoding and distribution."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "RTX5080",
          "NVIDIA",
          "4K",
          "MultiFrameGeneration",
          "GeForce",
          "gaming",
          "trailer"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this giant bubble of carbon dioxide functions as a battery that can store about 20 megawatts of power for roughly 8 hours. The video positions this CO2 storage approach as a way to manage fluctuating renewable generation and to support the global shift to clean energy.",
        "bullets": [
          "Device is a giant bubble of carbon dioxide used as a battery.",
          "Stores 20 megawatts of power for approximately 8 hours.",
          "Aims to address variability in renewable energy supply.",
          "Presented as a tool to help accelerate the transition to clean energy.",
          "Published by IEEE Spectrum."
        ],
        "takeaways": [
          "Provides multi‑hour (8‑hour) storage capacity that can bridge periods of low renewable output.",
          "20 MW scale indicates potential relevance for utility-scale storage or large-site backup planning.",
          "Can support decarbonization strategies by storing excess renewable generation for later use."
        ],
        "tags": [
          "CO2-battery",
          "carbon-dioxide",
          "energy-storage",
          "grid-storage",
          "renewable-energy",
          "battery",
          "20MW",
          "8-hour-storage",
          "innovation",
          "IEEE-Spectrum"
        ]
      }
    }
  ]
}