{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-22T09:56:15.582Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "IKkVWKdumHw",
      "title": "re:Invent 2025 - Chalk Talk - Origin management for multi-region applications with Amazon CloudFront",
      "channel": "AWS Events",
      "published_at": "2026-01-22T08:10:48.000Z",
      "url": "https://www.youtube.com/watch?v=IKkVWKdumHw",
      "thumbnail": "https://i.ytimg.com/vi/IKkVWKdumHw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This session covers comprehensive origin management with Amazon CloudFront for building secure, resilient multi-region content delivery systems, including automatic failover with CloudFront and Route53 and granular origin routing using CloudFront Functions. It also addresses securing origins with S3 Origin Access Control and VPC private origins, integrating on-premises infrastructure via AWS Direct Connect, and deploying Origin Shield to optimize cache performance and reduce origin load.",
        "bullets": [
          "Automatic failover using CloudFront and Route53 for higher availability",
          "Granular origin routing implemented with CloudFront Functions",
          "Secure origins via S3 Origin Access Control (OAC) and VPC private origins",
          "Hybrid integration through AWS Direct Connect for on-prem connectivity",
          "Origin Shield to optimize caching and reduce origin load"
        ],
        "takeaways": [
          "Implement automatic failover to increase content availability across regions",
          "Use CloudFront Functions for fine-grained traffic routing and control",
          "Adopt S3 OAC and VPC private origins to strengthen origin security",
          "Consider AWS Direct Connect to integrate and extend on-prem infrastructure",
          "Deploy Origin Shield to lower origin load and improve cache efficiency"
        ],
        "tags": [
          "cloudfront",
          "origin-management",
          "multi-region",
          "failover",
          "cloudfront-functions",
          "origin-shield",
          "s3-oac",
          "vpc-private-origins",
          "aws-direct-connect",
          "hybrid-architecture"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… KPMG Poland hosts explain że AI jest już częścią codziennego procesu audytu, automatyzując powtarzalne czynności, analizując pełne populacje danych i wspierając podejmowanie trafnych decyzji za pomocą narzędzi takich jak AI Transaction Scoring i Clara AI. Omówione są też platforma KPMG Clara, przejście z próbkowania na analizę pełnych populacji, zmiany roli audytora, wyzwania wdrożeniowe, bezpieczeństwo danych, aspekty regulacyjne oraz potencjalne zagrożenia i przyszłość AI w audycie.",
        "bullets": [
          "AI Transaction Scoring i analiza pełnych populacji zastępują tradycyjne próbkowanie.",
          "Clara AI oferuje konwersacyjnego asystenta i wyspecjalizowanych agentów wspierających audytorów.",
          "KPMG Clara umożliwia zarządzanie badaniem w czasie rzeczywistym; Clara for Clients usprawnia komunikację z klientem.",
          "AI wspiera dokumentację i analizę ujawnień, ale wdrożenie wymaga adaptacji kompetencji audytorów.",
          "Omówiono też bezpieczeństwo danych, środowisko regulacyjne oraz potencjalne zagrożenia związane z AI."
        ],
        "takeaways": [
          "Przygotuj kompletne, łatwo dostępne zbiory danych – audyty będą coraz częściej bazować na analizie pełnych populacji.",
          "Wzmocnij bezpieczeństwo danych i zgodność z regulacjami, ponieważ narzędzia AI zwiększają znaczenie ochrony wrażliwych informacji.",
          "Usprawnij przesyłanie i integrację danych w czasie rzeczywistym oraz kanały komunikacji z audytorami (portale/udostępnianie danych).",
          "Inwestuj w szkolenia personelu i procesy dokumentacyjne, by efektywnie współpracować z narzędziami AI podczas audytu."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMG",
          "Clara",
          "analiza danych",
          "bezpieczeństwo danych",
          "innowacje",
          "compliance"
        ]
      }
    },
    {
      "id": "t33Fh1JZVgA",
      "title": "AI at Speed: From Investment to Performance",
      "channel": "PwC US",
      "published_at": "2026-01-21T22:48:29.000Z",
      "url": "https://www.youtube.com/watch?v=t33Fh1JZVgA",
      "thumbnail": "https://i.ytimg.com/vi/t33Fh1JZVgA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… At the 2026 World Economic Forum in Davos, PwC US Senior Partner and CEO Paul Griggs joins CNBC’s Emma Crosby to discuss organizations shifting from AI exploration to execution, assessing initiatives through investment discipline, performance, and measurable value. They emphasize moving early, placing capital with intent, and designing resilient operating models that maintain performance while AI delivers measurable outcomes and supports transformation.",
        "bullets": [
          "Discussion held at Davos 2026 between PwC US CEO Paul Griggs and CNBC’s Emma Crosby.",
          "Focus on moving from AI exploration to execution with investment discipline.",
          "Emphasis on measurable performance and measurable value from AI initiatives.",
          "Leading organizations are placing capital intentionally and moving early.",
          "Operating models should be resilient without sacrificing performance as AI scales."
        ],
        "takeaways": [
          "Prioritize intentional capital allocation for AI projects to ensure measurable ROI.",
          "Design operating models that balance resilience with performance requirements.",
          "Measure AI outcomes continuously to justify investment and guide scale decisions.",
          "Move early on strategic AI capabilities to capture measurable benefits and enable future transformation."
        ],
        "tags": [
          "AI",
          "investment",
          "performance",
          "measurable outcomes",
          "PwC",
          "Davos2026",
          "operating models",
          "digital transformation",
          "CNBC"
        ]
      }
    },
    {
      "id": "6hu7hYLiu08",
      "title": "Get Step-By-Step Fixes with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-21T20:14:00.000Z",
      "url": "https://www.youtube.com/watch?v=6hu7hYLiu08",
      "thumbnail": "https://i.ytimg.com/vi/6hu7hYLiu08/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Copilot provides real-time, visual support for home projects and repairs. It can \"see what you see\" and deliver clear, step-by-step instructions for issues ranging from leaky pipes to overflowing washing machines.",
        "bullets": [
          "Real-time visual assistance for home repairs.",
          "Copilot can view the user’s situation and context.",
          "Provides step-by-step instructions for troubleshooting and fixes.",
          "Targets common household issues (e.g., leaky pipes, overflowing washers)."
        ],
        "takeaways": [
          "Real-time visual guidance suggests potential to speed on-site diagnosis for infrastructure issues by enabling remote step-by-step assistance.",
          "Seeing what field staff see could reduce the need for specialist dispatch, enabling experienced technicians to guide less-specialized personnel remotely.",
          "Standardized, step-by-step instructions may improve consistency and first-time-fix rates in maintenance workflows.",
          "Such capabilities could be applied to training and onboarding field teams, supporting safer and more efficient routine repairs."
        ],
        "tags": [
          "Copilot",
          "real-time support",
          "visual guidance",
          "step-by-step",
          "home repairs",
          "remote assistance",
          "troubleshooting",
          "maintenance",
          "DIY",
          "Microsoft"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer - Launching January 22!",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Arknights: Endfield is set for a worldwide release on January 22 as a 3D real-time strategy RPG where players act as the Endministrator exploring Talos-II. The launch trailer highlights NVIDIA DLSS 4 with Multi Frame Generation and was captured on a GeForce RTX 5080 at 4K Ultra settings (DLSS 4 Multi Frame Generation 4X Mode).",
        "bullets": [
          "Worldwide release date: January 22.",
          "Game type: 3D real-time strategy RPG (play as the Endministrator on Talos-II).",
          "Trailer emphasizes NVIDIA DLSS 4 with Multi Frame Generation.",
          "Captured on GeForce RTX 5080 at 4K Ultra settings (DLSS 4 MFG 4X Mode).",
          "Official links provided for DLSS 4 announcement and the game's site and social channels."
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is featured—verify hardware and driver support for DLSS 4 if you plan to test or host this title.",
          "Trailer capture used an RTX 5080 at 4K Ultra—consider including RTX 50-series GPUs in QA/benchmarking fleets for 4K capture validation.",
          "Launch date (Jan 22) may require coordinated resources for testing, streaming, or promotional workloads around release.",
          "Reference links (NVIDIA DLSS 4 announcement and official game site) are provided for technical details and integration guidance."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "RTX5080",
          "4K",
          "NVIDIA",
          "GeForce",
          "RTS",
          "Launch",
          "MultiFrameGeneration"
        ]
      }
    },
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The video shows Rate Insurance boosting agent efficiency using Agentforce and Gemini and includes a link to learn more about the Google Cloud and Salesforce partnership.",
        "bullets": [
          "Showcases Rate Insurance using Agentforce and Gemini to boost agent efficiency.",
          "Provides a link to learn more about the Google Cloud and Salesforce partnership.",
          "Focus is on agent efficiency improvements and a vendor partnership use case."
        ],
        "takeaways": [
          "If you support insurance or agent workflows, this use case suggests evaluating Agentforce and Gemini for similar efficiency goals.",
          "Review the linked Google Cloud and Salesforce partnership details to assess integration and hosting implications for your environment.",
          "Treat the video as a customer example—validate compatibility and operational requirements against your existing cloud and CRM stack."
        ],
        "tags": [
          "Rate Insurance",
          "Agentforce",
          "Gemini",
          "Google Cloud",
          "Salesforce",
          "agent efficiency",
          "partnership",
          "insurance",
          "cloud",
          "CRM"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Charly Stoever, a 35-year-old financial coach, has spent the last 18 months living out of two suitcases and living rent-free in Portland, Oregon by pet sitting full time. She brings in $60,000 a year, and the profile is part of CNBC Make It's Millennial Money series.",
        "bullets": [
          "Charly Stoever, 35, is a financial coach.",
          "Lives rent-free in Portland by pet sitting full time.",
          "Has spent 18 months living out of two suitcases.",
          "Earns $60,000 per year from this lifestyle.",
          "Video is a CNBC Make It Millennial Money profile (production credits listed)."
        ],
        "takeaways": [
          "Alternative gig-based income (pet sitting) can fully cover living costs—useful when assessing workforce financial resilience and mobility.",
          "Sustained, mobile lifestyles (living out of two suitcases) may change patterns of local service and utility use—consider for demand forecasting.",
          "Rent-free or highly flexible housing arrangements could influence employee location choices and affect local energy/load distributions."
        ],
        "tags": [
          "pet sitting",
          "rent-free",
          "financial coach",
          "portable lifestyle",
          "minimalism",
          "Portland",
          "CNBC Make It",
          "millennial money",
          "side hustle",
          "remote work"
        ]
      }
    },
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Dr. Anna Chacon is a 39-year-old dermatologist in Miami, FL who runs her own private practice. Her net worth is reported at about $6 million, made up of $3.2 million in investments, a $1.9 million home, and a $1.1 million office building.",
        "bullets": [
          "Dr. Anna Chacon, age 39, lives in Miami, FL.",
          "She is a dermatologist operating a private practice.",
          "Reported net worth: about $6 million.",
          "$3.2 million of that is investments.",
          "Real estate holdings include a $1.9M home and a $1.1M office building."
        ],
        "takeaways": [
          "Private-practice medical professionals can be owners of both residential and commercial property—potentially relevant customers for localized power and connectivity services.",
          "A significant portion of wealth held in investments suggests these professionals may prioritize long-term infrastructure reliability and service stability.",
          "Office buildings owned by practitioners may require commercial-grade power and data solutions separate from their residences.",
          "Targeting small business owners in healthcare could open opportunities for tailored service agreements combining residential and commercial infrastructure needs."
        ],
        "tags": [
          "dermatologist",
          "private practice",
          "Miami",
          "net worth",
          "investments",
          "real estate",
          "office building",
          "physician wealth",
          "personal finance",
          "medical office"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… A giant bubble of carbon dioxide is described as a battery capable of storing 20 megawatts of energy. The description frames this technology as a way to address renewable energy fluctuations and help power the global shift to clean energy.",
        "bullets": [
          "Uses a large carbon dioxide \"bubble\" as an energy storage medium",
          "Can store 20 megawatts of energy",
          "Designed to address fluctuations in renewable energy supply",
          "Presented as a means to support the global transition to clean energy"
        ],
        "takeaways": [
          "A 20 MW storage option could provide meaningful capacity for balancing variable renewable generation on a grid scale",
          "Grid and data center planners should track this technology as a potential option for mitigating renewable intermittency",
          "Assessments will be needed on scalability, integration, and operational characteristics as more technical details become available"
        ],
        "tags": [
          "ieee",
          "tech",
          "ieeespectrum",
          "innovation",
          "future",
          "futuristic",
          "energy",
          "battery"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI już teraz zmienia podejście do cen transferowych, wspierając monitorowanie rentowności, analizy porównawcze oraz automatyzację dokumentacji. Monika Palmowska i Jakub Roszkiewicz omawiają praktyczne zastosowania, związane ryzyka (dane, bezpieczeństwo, RODO, halucynacje), integrację z ERP oraz kroki wdrożeniowe i porządkowanie procesów jako fundament transformacji.",
        "bullets": [
          "Zastosowania AI: monitorowanie rentowności, inteligentne benchmarki i automatyzacja dokumentacji cen transferowych.",
          "AI ma wspierać i wzmacniać rolę doradców podatkowych, nie zastępować ich.",
          "Kluczowe ryzyka: jakość danych, bezpieczeństwo, zgodność z RODO i problem halucynacji modeli.",
          "Digital Gateway wskazany jako przykład bezpiecznego środowiska do pracy z AI.",
          "Wdrożenie wymaga integracji z ERP oraz uprzedniego uporządkowania procesów jako pierwszych kroków."
        ],
        "takeaways": [
          "Zadbaj o silne zarządzanie danymi i bezpieczeństwo — kwestie RODO i wycieków danych są podkreślone jako krytyczne.",
          "Zapewnij izolowane i kontrolowane środowisko do przetwarzania AI (np. Digital Gateway) dla zgodności i bezpieczeństwa operacji.",
          "Plan integracji AI z ERP, by umożliwić automatyczne monitorowanie rentowności i inteligentne benchmarki.",
          "Przed wdrożeniem uporządkuj procesy wewnętrzne; specjaliści nadal potrzebni do interpretacji wyników AI."
        ],
        "tags": [
          "podatki",
          "AI",
          "ceny-transferowe",
          "transfer-pricing",
          "KPMG",
          "automatyzacja",
          "ERP",
          "bezpieczeństwo-danych",
          "RODO",
          "benchmarki"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video encourages using Microsoft Copilot to stack small wins and keep momentum when tackling workouts, projects, or personal goals. It positions Copilot as a tool to help sustain consistent progress across different kinds of tasks.",
        "bullets": [
          "Encourages stacking small wins to sustain momentum",
          "Mentions workouts, projects, and personal goals as use cases",
          "Positions Microsoft Copilot as a companion for keeping progress going",
          "Focuses on consistency and ongoing momentum"
        ],
        "takeaways": [
          "Copilot is described as a tool to keep momentum on projects — applicable to data center projects and migrations",
          "The 'small wins' approach can be used to drive incremental progress on complex initiatives",
          "Emphasizing consistency and momentum aligns with sustaining long-term operational objectives"
        ],
        "tags": [
          "Microsoft Copilot",
          "Copilot",
          "stack small wins",
          "momentum",
          "workouts",
          "projects",
          "personal goals",
          "productivity",
          "motivation"
        ]
      }
    }
  ]
}