{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-30T19:10:17.238Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "z-X9MYi1Rr0",
      "title": "Leveraging tax credits and incentives for sustainability projects",
      "channel": "PwC US",
      "published_at": "2026-01-30T13:27:25.000Z",
      "url": "https://www.youtube.com/watch?v=z-X9MYi1Rr0",
      "thumbnail": "https://i.ytimg.com/vi/z-X9MYi1Rr0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Randa Barsoum, Tax Partner at PwC US, outlines tax credits and incentives for sustainability that go beyond energy-focused programs. She highlights state and local abatements, location-based incentives, and R&D tax credits tied to innovation (for example, reimagining packaging or processes), and emphasizes that viewing sustainability investments through a broader lens can unlock meaningful tax value.",
        "bullets": [
          "Energy incentives are common but only part of the tax picture for sustainability.",
          "State and local abatements can provide additional tax relief for sustainability projects.",
          "Location-based incentives may influence project siting and economics.",
          "R&D tax credits can apply to innovation efforts, such as reimagining packaging or processes.",
          "Broad tax-focused view of sustainability investments can unlock meaningful tax value."
        ],
        "takeaways": [
          "When evaluating site decisions, factor in location-based incentives as part of total project economics.",
          "Seek state and local abatements to lower upfront or ongoing costs for sustainability projects.",
          "Track and document innovation in processes or designs to capture potential R&D tax credits.",
          "Don’t assume only energy credits apply—assess the full range of tax incentives when sizing sustainability investments."
        ],
        "tags": [
          "pwc",
          "tax-credits",
          "sustainability",
          "energy-incentives",
          "state-local-abatements",
          "location-based-incentives",
          "r&d-credits",
          "corporate-tax",
          "sustainability-investments",
          "operational-resilience"
        ]
      }
    },
    {
      "id": "PxnMl4M2pww",
      "title": "Why data is critical to sustainable supply chains",
      "channel": "PwC US",
      "published_at": "2026-01-30T13:24:27.000Z",
      "url": "https://www.youtube.com/watch?v=PxnMl4M2pww",
      "thumbnail": "https://i.ytimg.com/vi/PxnMl4M2pww/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, David Linich of PwC US explains that reliable, high-quality data enables organizations to scenario plan, protect margins, and deliver sustainable, high-quality products at the right place and time amid constant supply-chain disruption. With conditions changing week by week, he emphasizes that data-driven decision-making is critical to building resilient, modern supply chains.",
        "bullets": [
          "Data is essential to manage disruptions like shifting tariffs and margin pressure.",
          "Reliable, high-quality data enables effective scenario planning.",
          "Data helps protect margins while supporting sustainable, timely product delivery.",
          "Rapidly changing conditions (week by week) make data-driven decisions critical.",
          "PwC offers ongoing insights on sustainability, strategy, and operational resilience."
        ],
        "takeaways": [
          "Ensure access to reliable, high-quality supply-chain data to support scenario planning and rapid decisions.",
          "Use data-driven analysis to anticipate and mitigate tariff shifts and margin pressures.",
          "Leverage data to verify sustainable sourcing and timely delivery of critical supplies.",
          "Implement processes that deliver up-to-date data week-to-week to strengthen operational resilience."
        ],
        "tags": [
          "PwC",
          "data",
          "supply chain",
          "sustainability",
          "resilience",
          "scenario planning",
          "margins",
          "operational resilience",
          "high-quality data",
          "decision-making"
        ]
      }
    },
    {
      "id": "gv6zK265OUE",
      "title": "Build your first GraphRAG Powered Agent! (No Graph Expert Required) | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-30T06:40:49.000Z",
      "url": "https://www.youtube.com/watch?v=gv6zK265OUE",
      "thumbnail": "https://i.ytimg.com/vi/gv6zK265OUE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This session shows how to unlock knowledge trapped in documents, PDFs, and wikis by building a knowledge graph. It demonstrates a practical GraphRAG-powered agent you can build in an afternoon using familiar AI tools, with a live demo and a sample notebook to get started.",
        "bullets": [
          "Knowledge in docs, PDFs, and wikis is often inaccessible to models.",
          "Knowledge graphs can unlock that trapped information for reasoning.",
          "Many teams avoid building graphs because it seems like a massive undertaking, but it isn’t.",
          "The talk includes a live demo using real documents and shows how to build a GraphRAG agent in an afternoon with existing AI tools.",
          "A sample notebook is provided to accelerate hands-on implementation."
        ],
        "takeaways": [
          "Quick pilot potential: the approach can be built in an afternoon, shortening time-to-proof-of-concept.",
          "Minimal tool churn: uses the same AI tools teams already have, reducing integration friction.",
          "Practicality: live demo with real documents implies a hands-on, applicable workflow rather than theory.",
          "Ready-to-use resources: the provided sample notebook can speed adoption and internal experimentation."
        ],
        "tags": [
          "GraphRAG",
          "knowledge-graph",
          "RAG",
          "AI",
          "Databases for AI",
          "AWS",
          "Neptune",
          "sample-notebook",
          "live-demo",
          "documents"
        ]
      }
    },
    {
      "id": "oQtkaHzUYlY",
      "title": "Copilot helps Christa find her inner star 🌟",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-29T18:33:49.000Z",
      "url": "https://www.youtube.com/watch?v=oQtkaHzUYlY",
      "thumbnail": "https://i.ytimg.com/vi/oQtkaHzUYlY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the short video uses a sky full of stars metaphor to show Copilot helping Christa \"find the star within.\" The clip invites viewers to download and try Copilot via the link in the bio.",
        "bullets": [
          "No transcript available; description provides the only content.",
          "Theme: empowerment — Copilot helps Christa \"find the star within.\"",
          "Visual motif referenced: a sky full of stars.",
          "Clear call-to-action: download and try Copilot (link in bio)."
        ],
        "takeaways": [
          "Use simple, inspirational messaging to position tools as empowering for users and employees.",
          "Include a clear, easy-to-find call-to-action (e.g., 'link in bio') to drive trial conversions.",
          "Short, evocative visuals and metaphors can be effective for awareness and trial sign-ups.",
          "For adoption initiatives, emphasize personal value and make onboarding/download steps obvious."
        ],
        "tags": [
          "Copilot",
          "Christa",
          "star",
          "sky",
          "inspiration",
          "download",
          "link-in-bio",
          "personal-growth"
        ]
      }
    },
    {
      "id": "BYtYm-xyKR8",
      "title": "Bringing In $251K A Year With 3 Jobs In The Bay Area",
      "channel": "CNBC Make It",
      "published_at": "2026-01-29T17:47:46.000Z",
      "url": "https://www.youtube.com/watch?v=BYtYm-xyKR8",
      "thumbnail": "https://i.ytimg.com/vi/BYtYm-xyKR8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, CNBC Make It profiles Naseema McElroy, a 44-year-old labor and delivery nurse in Brentwood, California who also runs the personal finance brand Financially Intentional and earns $251K a year across three jobs. The piece recounts that she accumulated nearly $1 million in debt by 2015, documented her debt-payoff journey, and became debt-free by 2017.",
        "bullets": [
          "Naseema McElroy, 44, is a labor and delivery nurse and founder of Financially Intentional in Brentwood, CA.",
          "Title notes she brings in $251K annually across three jobs in the Bay Area.",
          "Accumulated nearly $1 million in debt by 2015 and then learned to manage her finances.",
          "Started Financially Intentional to document her debt-payoff journey.",
          "By 2017 she had become debt-free; this is part of CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "The video is a personal finance profile and does not contain technical, energy, or infrastructure data relevant to grid or data center planning.",
          "Content focuses on individual income, debt payoff timeline, and entrepreneurship rather than facility or operational metrics.",
          "Produced and distributed by CNBC Make It (consumer-facing content), offering no details on hosting, streaming infrastructure, or energy usage.",
          "No financial or operational metrics in the description apply directly to data center capacity, energy forecasting, or grid decisions."
        ],
        "tags": [
          "Naseema McElroy",
          "Financially Intentional",
          "debt payoff",
          "personal finance",
          "labor and delivery nurse",
          "Bay Area",
          "Brentwood",
          "CNBC Make It",
          "Millennial Money"
        ]
      }
    },
    {
      "id": "t6y2cVNjCAw",
      "title": "GeForce Garage - Summer of RTX Community Build",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-29T14:01:25.000Z",
      "url": "https://www.youtube.com/watch?v=t6y2cVNjCAw",
      "thumbnail": "https://i.ytimg.com/vi/t6y2cVNjCAw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video announces the winner of the Summer of RTX r/buildapc Community Build Contest — u/JeffersonPutnam — and shows their small-form-factor GeForce RTX 5090 system. GeForce host Dwight walks through the build with a PCPartPicker parts list and component details including the Fractal Design Era 2 chassis, GeForce RTX 5090 Founders Edition, MSI MPG B850I Edge motherboard, Ryzen 7 9800X3D, 32GB DDR5-6000, Corsair SF1000, and Corsair Nautilus 240 RS.",
        "bullets": [
          "Winner: u/JeffersonPutnam — small-form-factor GeForce RTX 5090 build.",
          "Host: GeForce host Dwight (Twitter: @_MightyPotato).",
          "Full parts list available on PCPartPicker (linked in description).",
          "Key components: Fractal Design Era 2, RTX 5090 FE, MSI MPG B850I Edge, Ryzen 7 9800X3D, 32GB DDR5-6000, Corsair SF1000, Corsair Nautilus 240 RS.",
          "Video tied to the Summer of RTX r/buildapc Community Build Contest and GeForce social channels."
        ],
        "takeaways": [
          "High-end consumer GPUs like the GeForce RTX 5090 are being integrated into small-form-factor systems — account for elevated power and cooling needs in compact deployments.",
          "The build pairs an RTX 5090 with a 1,000W SFX PSU (Corsair SF1000), indicating SFF deployments may require high-capacity SFX power solutions.",
          "Use of a 240mm AIO (Corsair Nautilus 240 RS) alongside a high-performance CPU (Ryzen 7 9800X3D) highlights the importance of thermal management and component compatibility in dense builds.",
          "Community-provided PCPartPicker lists and contest-driven builds can serve as practical reference BOMs for evaluating part choices and integration steps."
        ],
        "tags": [
          "GeForceGarage",
          "RTX5090",
          "SFF",
          "miniITX",
          "Ryzen7",
          "FractalEra2",
          "CorsairSF1000",
          "communitybuild",
          "rbuildapc"
        ]
      }
    },
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy AI solutions that unlocked entirely new revenue streams. The company used GenAI and Google Cloud’s infrastructure to streamline operations, boost developer productivity, compress its digital transformation timeline, and expand what’s possible for the business.",
        "bullets": [
          "TTEC worked with Google Cloud Consulting to accelerate AI prototyping and deployment.",
          "Generative AI and Google Cloud infrastructure were leveraged to improve operations and developer productivity.",
          "The engagement enabled TTEC to unlock new revenue streams.",
          "Google Cloud Consulting helped compress TTEC’s digital transformation timeline.",
          "Company leadership framed the effort as expanding the organization’s ambitions and possibilities."
        ],
        "takeaways": [
          "Faster AI prototyping and deployment can create new revenue opportunities for service providers.",
          "Robust cloud infrastructure supports operational efficiency and higher developer productivity.",
          "Engaging cloud consulting partners can materially shorten digital transformation timelines.",
          "Adopting GenAI can expand a company’s service offerings and strategic ambitions."
        ],
        "tags": [
          "googlecloud",
          "ttec",
          "genai",
          "aideployment",
          "operationalefficiency",
          "customerexperience",
          "googlecloudplatform",
          "generativeai"
        ]
      }
    },
    {
      "id": "6B29VDvPPzc",
      "title": "Build Knowledge Graph-powered AI Agents For Your Use Case | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-26T17:41:05.000Z",
      "url": "https://www.youtube.com/watch?v=6B29VDvPPzc",
      "thumbnail": "https://i.ytimg.com/vi/6B29VDvPPzc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… this session shows how to automatically build a knowledge graph from raw documents and connect it to an AI agent so the agent can understand your company's data, with no graph expertise required. The presenters demonstrate an end-to-end build and point to a prior episode comparing VectorDB vs GraphDB for Gen AI agents.",
        "bullets": [
          "Automatic construction of a knowledge graph from raw documents.",
          "Connects the knowledge graph to an AI agent so it understands company-specific information.",
          "No graph theory or query expertise required.",
          "End-to-end, hands-on demo of the build process.",
          "References a previous episode comparing VectorDB and GraphDB for Gen AI agents."
        ],
        "takeaways": [
          "Enables internal AI agents to access and reason over company-specific documents by converting them into a knowledge graph.",
          "Automated ingestion from raw documents can accelerate deployment timelines without specialized graph expertise.",
          "A demonstrated end-to-end approach provides a practical template to evaluate integration with existing systems and workflows."
        ],
        "tags": [
          "knowledge-graph",
          "AI-agent",
          "graphdb",
          "vectordb",
          "gen-ai",
          "document-ingestion",
          "end-to-end-demo",
          "no-graph-expertise",
          "enterprise-knowledge",
          "AWS-Events"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video follows Jo discovering how Copilot Groups can make route planning easy. It emphasizes the power of Copilot Groups for simplifying route planning workflows.",
        "bullets": [
          "Focuses on route planning made easy",
          "Centers on Jo discovering Copilot Groups",
          "Highlights the 'power of Copilot Groups' as the key capability",
          "Short promotional/demo-style messaging",
          "#copilot #microsoftcopilot #ai included as keywords"
        ],
        "takeaways": [
          "Easier route planning could streamline field operations and technician dispatch workflows.",
          "Copilot Groups may help coordinate multi-stop visits and group assignments more efficiently.",
          "Potential to reduce travel time and operational costs through improved routing.",
          "Worth evaluating for integration with existing scheduling, dispatch, or maintenance systems."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "route-planning",
          "copilot-groups",
          "workflow",
          "productivity",
          "demo"
        ]
      }
    }
  ]
}