{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-19T20:45:58.522Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Dr. Anna Chacon, 39, is a Miami-based dermatologist who runs her own private practice. Her net worth is about $6 million, made up of $3.2 million in investments, a $1.9 million home, and a $1.1 million office building.",
        "bullets": [
          "Dr. Anna Chacon is a 39-year-old dermatologist in Miami, FL.",
          "She operates her own private dermatology practice.",
          "Total net worth reported at about $6 million.",
          "Net worth breakdown: $3.2M in investments, $1.9M home, $1.1M office building."
        ],
        "takeaways": [
          "Private medical practices can be owners of commercial real estate (office building ownership noted).",
          "Healthcare professionals may hold diversified asset portfolios combining investments and real estate.",
          "Regional context (Miami, FL) identifies an urban market where private practices also represent local commercial property stakeholders."
        ],
        "tags": [
          "dermatologist",
          "private practice",
          "Miami",
          "net worth",
          "investments",
          "real estate",
          "office building",
          "personal finance",
          "Dr. Anna Chacon"
        ]
      }
    },
    {
      "id": "6L86-OnOXV0",
      "title": "How I Built A $1M/Year Business - And Helped My Parents Retire",
      "channel": "CNBC Make It",
      "published_at": "2026-01-17T15:00:09.000Z",
      "url": "https://www.youtube.com/watch?v=6L86-OnOXV0",
      "thumbnail": "https://i.ytimg.com/vi/6L86-OnOXV0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Tuan Le emigrated from Vietnam to Toronto in 2015 and vowed at 15 to help his parents retire. Ten years later his social video production company, ShortsCut, generates over $1M USD a year, and he now pays his parents' rent and living expenses so they no longer have to work full time.",
        "bullets": [
          "Tuan Le emigrated from Vietnam to Toronto in 2015 and made a pledge at age 15 to help his parents retire.",
          "He founded ShortsCut, a social video production company.",
          "ShortsCut brings in over $1 million USD in annual sales.",
          "Le now covers his parents' rent and living expenses, enabling them to stop full-time work.",
          "Video produced/edited by Zach Green; reporter Kamaron McNair; additional footage includes Tuan Le and Getty Images."
        ],
        "takeaways": [
          "A high-revenue social video producer signals sustained demand for media storage and processing capacity—plan for scalable storage growth.",
          "Growing video businesses increase requirements for reliable backup and long-term archival of large media assets.",
          "Content creators scaling to seven-figure revenue highlight the importance of robust bandwidth and delivery (CDN) capacity.",
          "Offer flexible, usage-based compute and storage options to accommodate fast-scaling media production customers."
        ],
        "tags": [
          "ShortsCut",
          "Tuan Le",
          "social video",
          "video production",
          "entrepreneurship",
          "CNBC Make It",
          "immigrant success",
          "1M revenue"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This giant bubble of carbon dioxide can store 20 megawatts of energy. The description says these batteries are intended to help smooth fluctuating renewable generation and support the global shift to clean energy.",
        "bullets": [
          "Giant bubble of carbon dioxide stores 20 megawatts of energy.",
          "Designed to address fluctuations in renewable energy supply.",
          "Presented as a battery technology to support the transition to clean energy globally.",
          "Described in brief by IEEE Spectrum."
        ],
        "takeaways": [
          "A 20 MW CO2-based storage device could be used to balance variable renewable generation on the grid.",
          "Such storage technologies may support decarbonization efforts by helping integrate more renewables.",
          "Grid and data-center decision-makers should monitor this class of battery tech as a potential options for managing renewable intermittency and supporting clean-energy goals.",
          "Evaluation for integration should focus on how the technology aligns with operational needs for capacity and variability management."
        ],
        "tags": [
          "CO2",
          "carbon-dioxide",
          "energy-storage",
          "battery",
          "renewables",
          "grid",
          "clean-energy",
          "innovation"
        ]
      }
    },
    {
      "id": "OINppmPan0o",
      "title": "Figure Skating | Making Team USA presented by Xfinity with Apolo Ohno",
      "channel": "Team USA",
      "published_at": "2026-01-16T19:30:36.000Z",
      "url": "https://www.youtube.com/watch?v=OINppmPan0o",
      "thumbnail": "https://i.ytimg.com/vi/OINppmPan0o/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Figure skating duo Vadym Kolesnik and Emilia Zingas sit down with Apolo Ohno on this week's episode of Making Team USA presented by Xfinity ahead of the Winter Olympics. The episode highlights trust as a foundation of their partnership.",
        "bullets": [
          "Features ice dance/figure skating duo Vadym Kolesnik and Emilia Zingas.",
          "Interview conducted by Olympian Apolo Ohno.",
          "Part of the series Making Team USA presented by Xfinity.",
          "Context: conversation occurs ahead of the Winter Olympics.",
          "Description emphasizes 'built on trust' as a theme."
        ],
        "takeaways": [
          "The description is an athlete interview and contains no technical, energy, or infrastructure details relevant to grid or data center operations.",
          "No operational risks, requirements, or impacts for grid/data-center decision-makers are indicated in the available description; no immediate actions are suggested based solely on this content.",
          "If relevance to infrastructure or streaming operations is required, obtain further details (e.g., broadcast/streaming scale, venue power needs) not provided here."
        ],
        "tags": [
          "figure skating",
          "Vadym Kolesnik",
          "Emilia Zingas",
          "Apolo Ohno",
          "Making Team USA",
          "Xfinity",
          "Winter Olympics",
          "trust",
          "Team USA"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Podcast KPMG ON AIR z Moniką Palmowską i Jakubem Roszkiewiczem omawia zastosowania AI w obszarze cen transferowych — od monitorowania rentowności i analiz porównawczych po automatyzację dokumentacji oraz integrację z ERP. Eksperci podkreślają, że AI może wzmocnić pracę doradców, wskazują ryzyka związane z danymi, bezpieczeństwem i RODO (w tym halucynacje) oraz rekomendują uporządkowanie procesów i wykorzystanie bezpiecznych środowisk (Digital Gateway) jako fundament wdrożeń.",
        "bullets": [
          "AI wspiera monitoring rentowności, analizy porównawcze i automatyzację dokumentacji cen transferowych.",
          "Sztuczna inteligencja ma charakter wspierający — nie zastąpi doradców podatkowych.",
          "Główne ryzyka: jakość danych, bezpieczeństwo, RODO oraz zjawisko halucynacji AI.",
          "Digital Gateway wskazywany jako bezpieczne środowisko do pracy z AI.",
          "Kluczowe kroki wdrożeniowe: integracja z ERP, inteligentne benchmarki i uporządkowanie procesów."
        ],
        "takeaways": [
          "Priorytet dla infrastruktury: zapewnienie bezpieczeństwa danych i zgodności z RODO przed wdrożeniem AI.",
          "Dla środowisk IT/centrum danych: przygotować bezpieczne, kontrolowane środowiska (podobne do Digital Gateway) dla AI i modeli przetwarzających wrażliwe dane.",
          "Zadbaj o integrację z ERP i przepływy danych — infrastruktura musi wspierać szybkie, bezpieczne łączenie danych finansowych i operacyjnych.",
          "Rozpoczynaj projekty od uporządkowania procesów i jakości danych, co zmniejszy ryzyko błędów i halucynacji modeli AI."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "transfer pricing",
          "automatyzacja",
          "ERP",
          "bezpieczeństwo danych",
          "RODO",
          "monitorowanie rentowności",
          "Digital Gateway",
          "benchmarki"
        ]
      }
    },
    {
      "id": "dGfcT63U7Mo",
      "title": "The 2026 U.S. Olympic Figure Skating Team 🇺🇸",
      "channel": "Team USA",
      "published_at": "2026-01-15T20:43:24.000Z",
      "url": "https://www.youtube.com/watch?v=dGfcT63U7Mo",
      "thumbnail": "https://i.ytimg.com/vi/dGfcT63U7Mo/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This Team USA video presents the U.S. Olympic Figure Skating lineup for the 2026 Winter Olympics. No transcript is available for the video.",
        "bullets": [
          "Title: 'The 2026 U.S. Olympic Figure Skating Team' (Channel: Team USA)",
          "Published date: 2026-01-15",
          "Description: 'This U.S. Olympic Figure Skating lineup. 🔥' with #WinterOlympics",
          "No transcript provided in the metadata"
        ],
        "takeaways": [
          "Add or generate a transcript and closed captions to improve accessibility, search indexing, and content reuse; current transcript is missing.",
          "Enhance metadata (detailed description and tags) to boost discoverability and ad targeting for Olympic-related content.",
          "Plan CDN and streaming capacity around Olympic season peaks associated with #WinterOlympics to ensure smooth playback.",
          "Log and monitor publish-time traffic patterns to inform capacity planning for future Olympic announcements and lineup releases."
        ],
        "tags": [
          "TeamUSA",
          "FigureSkating",
          "WinterOlympics2026",
          "Olympics",
          "USFigureSkating",
          "OlympicLineup",
          "WinterSports",
          "FigureSkatingTeam"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The video encourages using Microsoft Copilot to build and maintain momentum by stacking small wins. It suggests applying this approach across workouts, projects, and personal goals to keep progress moving forward.",
        "bullets": [
          "Encourages stacking small wins to sustain momentum.",
          "Positions Microsoft Copilot as a helper for ongoing progress.",
          "Applies to workouts, projects, and personal goals.",
          "Focuses on keeping momentum rather than one-off achievements."
        ],
        "takeaways": [
          "Consider Copilot as a tool to help teams maintain momentum on projects.",
          "Use Copilot to support incremental progress on operational or planning tasks.",
          "Encourage staff to apply small, regular wins (with Copilot) for personal productivity and goal tracking."
        ],
        "tags": [
          "Microsoft Copilot",
          "momentum",
          "productivity",
          "small wins",
          "goals",
          "projects",
          "workouts",
          "personal productivity",
          "AI assistant"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights the importance of precision and speed in high-frequency trading and showcases the Dell PowerEdge R770AP server powered by Intel® Xeon® 6 processors. It says this configuration helps perform hundreds of trades in seconds to maximize gains and minimize losses, and positions Intel Xeon 6 CPUs as defining the future of finance.",
        "bullets": [
          "High-frequency trading depends on precision and speed.",
          "Dell PowerEdge R770AP server is featured for HFT workloads.",
          "Powered by Intel® Xeon® 6 processors.",
          "Claims ability to perform hundreds of trades in seconds to maximize gains and minimize losses.",
          "Intel positions Xeon 6 CPUs as defining the future of finance."
        ],
        "takeaways": [
          "For HFT use cases, the description emphasizes selecting servers and CPUs optimized for low-latency, high-throughput performance.",
          "Dell PowerEdge R770AP + Intel Xeon 6 is presented as a vendor solution to evaluate for trading workloads.",
          "CPU performance and system-level precision/speed are framed as key differentiators for financial applications.",
          "Decision-makers should prioritize platforms marketed for rapid transaction processing where sub-second execution impacts outcomes."
        ],
        "tags": [
          "high-frequency trading",
          "HFT",
          "Dell PowerEdge R770AP",
          "Intel Xeon 6",
          "low-latency",
          "finance",
          "servers",
          "data center",
          "Intel Business"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Copilot \"brought it back to life\" after the creative spark was out. The description invites viewers to download Copilot and try it for themselves via the link in bio.",
        "bullets": [
          "Description states Copilot revived a lost creative spark.",
          "Direct call to action: download Copilot and try it via the link in bio.",
          "No transcript is available for the video."
        ],
        "takeaways": [
          "Copilot is presented as a tool to rekindle creativity—consider a hands-on trial to see if it aids team ideation.",
          "Use the link-in-bio download to quickly pilot the tool with a small group before broader adoption.",
          "With no additional details provided, base initial evaluations on a direct trial rather than claims from the description alone."
        ],
        "tags": [
          "Copilot",
          "Microsoft Copilot",
          "creativity",
          "creative-spark",
          "download",
          "link-in-bio",
          "try-it",
          "video"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video showcases the open-world martial arts RPG Where Winds Meet running with NVIDIA's DLSS 4 featuring Multi Frame Generation and with RTX enabled. Footage is credited to @DigitalDreamsyt and presented under the NVIDIA GeForce channel.",
        "bullets": [
          "Open-world martial arts RPG: Where Winds Meet",
          "Showcases DLSS 4 with Multi Frame Generation",
          "RTX On — RTX-enabled rendering emphasized",
          "Video footage credited to @DigitalDreamsyt"
        ],
        "takeaways": [
          "Demonstrates DLSS 4 with Multi Frame Generation in a modern title—relevant when evaluating support for DLSS 4-enabled workloads.",
          "'RTX On' indicates the showcased experience relies on NVIDIA RTX features—consider GPUs that support RTX to reproduce similar visuals.",
          "Published by NVIDIA GeForce — signals vendor-driven adoption of these graphics features that may affect content and compatibility requirements."
        ],
        "tags": [
          "WhereWindsMeet",
          "DLSS4",
          "MultiFrameGeneration",
          "RTXOn",
          "OpenWorld",
          "MartialArtsRPG",
          "NVIDIAGeForce",
          "DigitalDreamsyt",
          "Gameplay",
          "Graphics"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This Intel Business YouTube video is titled \"Taha Khalifa (Intel) | Intel Business\" and directs viewers to the Intel Business channel and subscription link. The description states that Intel Business provides IT resources, guidance, and expert insights for projects spanning data centers to devices, and includes links to the website and social profiles.",
        "bullets": [
          "Video title: Taha Khalifa (Intel) | Intel Business",
          "Subscribe link to Intel Business on YouTube provided",
          "Intel Business described as a source for IT resources, guidance, and expert insights",
          "Website link: http://intel.ly/itcenter",
          "Social links included: X, LinkedIn, Facebook, plus channel URL"
        ],
        "takeaways": [
          "Intel Business positions itself as a centralized resource for IT decision-makers working on data center and device projects",
          "Decision-makers can use the provided website and social links to access Intel’s resources and expert insights",
          "Subscribing to the Intel Business channel is the recommended way to receive ongoing IT guidance and updates"
        ],
        "tags": [
          "Intel Business",
          "Taha Khalifa",
          "IT resources",
          "data centers",
          "devices",
          "subscribe",
          "Intel",
          "IT projects",
          "YouTube"
        ]
      }
    },
    {
      "id": "kSocjh8PZnQ",
      "title": "Rynek dóbr luksusowych w obliczu transformacji | Andrzej Marczak, Tomasz Wiśniewski",
      "channel": "KPMG Poland",
      "published_at": "2026-01-13T10:23:31.000Z",
      "url": "https://www.youtube.com/watch?v=kSocjh8PZnQ",
      "thumbnail": "https://i.ytimg.com/vi/kSocjh8PZnQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The podcast discusses current trends shaping the luxury goods market—greater emphasis on experiences over ownership, rising importance of ESG and responsible luxury, and the emergence of \"affordable luxury\" and aspirational consumers. KPMG experts also highlight Poland's growing but fragmented luxury market, the concentration of high-net-worth customers, and future drivers such as AI, craftsmanship and the human dimension.",
        "bullets": [
          "Global trends: \"luxury fatigue\" and a shift toward experiences and personalization.",
          "Highly concentrated spending: ~2% of the wealthiest clients account for ~40% of the market.",
          "ESG and responsible luxury gaining prominence (eco-leathers, certifications).",
          "Poland: market growing despite global declines, but remains fragmented; growth in luxury tourism and art.",
          "Future drivers include AI, craftsmanship, and maintaining a human dimension in luxury offerings."
        ],
        "takeaways": [
          "ESG emphasis suggests demand for energy-efficient, sustainability-certified infrastructure and reporting capabilities.",
          "Mention of AI and personalization indicates growing need for compute, storage and low-latency services to support data-driven experiences.",
          "Growth in Poland's luxury tourism and hospitality segments points to localized capacity and high-availability requirements.",
          "Concentration of high-net-worth clients underscores the importance of security, privacy compliance and premium service SLAs."
        ],
        "tags": [
          "luksus",
          "ESG",
          "affordable-luxury",
          "personalizacja",
          "Gen Z",
          "AI",
          "Polska",
          "turystyka-luksusowa",
          "rynek-sztuki"
        ]
      }
    }
  ]
}