{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-29T20:53:13.942Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "oQtkaHzUYlY",
      "title": "Copilot helps Christa find her inner star 🌟",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-29T18:33:49.000Z",
      "url": "https://www.youtube.com/watch?v=oQtkaHzUYlY",
      "thumbnail": "https://i.ytimg.com/vi/oQtkaHzUYlY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the sky is full of stars and Copilot helps Christa find the star within. The post invites viewers to download and try Copilot via the link in bio.",
        "bullets": [
          "Imagery: 'the sky is full of stars' and a star emoji 🌟",
          "Message: Copilot helps Christa find her 'inner star'",
          "Call-to-action to download and try Copilot",
          "Simple, uplifting tone focused on personal empowerment"
        ],
        "takeaways": [
          "Positions Copilot as a user-centric, empowerment-focused feature—consider user engagement potential when evaluating AI tools.",
          "Direct call-to-action (link in bio) implies easy access and onboarding—assess how distribution channels affect user adoption.",
          "Uplifting branding may influence uptake—align marketing and UX planning with technical deployment decisions."
        ],
        "tags": [
          "Copilot",
          "Christa",
          "inner-star",
          "inspiration",
          "download",
          "link-in-bio",
          "stars",
          "Microsoft"
        ]
      }
    },
    {
      "id": "2GZM7wOHFcg",
      "title": "Follow the carbon, find the money: Turning sustainability into financial value",
      "channel": "PwC US",
      "published_at": "2026-01-29T18:04:28.000Z",
      "url": "https://www.youtube.com/watch?v=2GZM7wOHFcg",
      "thumbnail": "https://i.ytimg.com/vi/2GZM7wOHFcg/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… In this short video, Rich Goode of PwC US argues that sustainability gains traction when carbon reduction is translated into financial impact, because financial value is more tangible than tons of carbon. He urges leaders to understand carbon accounting fundamentals and to communicate sustainability in business terms to drive alignment, investment, and results.",
        "bullets": [
          "Linking carbon reduction to financial impact helps engage business leadership.",
          "A ton of carbon is abstract; financial value is tangible and persuasive.",
          "Translate emissions outcomes into cost savings and business value.",
          "Understand the fundamentals of carbon accounting.",
          "Communicate sustainability in business terms to drive alignment, investment, and results."
        ],
        "takeaways": [
          "Frame emissions reductions as cost savings or business value to secure capital for grid/data center projects.",
          "Incorporate basic carbon accounting into project evaluations to quantify benefits.",
          "Present sustainability initiatives using financial metrics (cost, ROI) to win leadership buy-in.",
          "Clear, business-focused communication accelerates alignment and investment for operational changes."
        ],
        "tags": [
          "sustainability",
          "carbon accounting",
          "financial value",
          "emissions reduction",
          "leadership",
          "business case",
          "ESG",
          "operational resilience",
          "PwC",
          "strategy"
        ]
      }
    },
    {
      "id": "BYtYm-xyKR8",
      "title": "Bringing In $251K A Year With 3 Jobs In The Bay Area",
      "channel": "CNBC Make It",
      "published_at": "2026-01-29T17:47:46.000Z",
      "url": "https://www.youtube.com/watch?v=BYtYm-xyKR8",
      "thumbnail": "https://i.ytimg.com/vi/BYtYm-xyKR8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Naseema McElroy, a 44-year-old labor and delivery nurse in Brentwood, California, earns $251K a year working three jobs and runs a personal finance brand called Financially Intentional. She amassed nearly $1 million in debt in 2015, documented her debt-payoff journey through her business, and was debt-free by 2017.",
        "bullets": [
          "Naseema McElroy is a 44-year-old labor and delivery nurse and founder of Financially Intentional.",
          "Title states she brings in $251K per year by working three jobs.",
          "Accumulated nearly $1 million in debt in 2015.",
          "Documented her debt-payoff journey via her business and became debt-free by 2017.",
          "This video is part of CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "Skilled workers may rely on multiple income streams and side businesses to reach high annual earnings — consider workforce scheduling flexibility to retain talent.",
          "Employees building personal brands can generate additional revenue outside primary roles; policies that address external work and IP could be relevant.",
          "Documenting financial journeys can amplify reach and lead to business opportunities — employee entrepreneurship may affect recruitment and retention.",
          "Supporting employee financial education and debt-repayment resources could improve staff stability and focus, given the impact of large personal debt on workers."
        ],
        "tags": [
          "Naseema McElroy",
          "labor and delivery nurse",
          "personal finance",
          "debt payoff",
          "Financially Intentional",
          "Millennial Money",
          "CNBC Make It",
          "multiple jobs"
        ]
      }
    },
    {
      "id": "t6y2cVNjCAw",
      "title": "GeForce Garage - Summer of RTX Community Build",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-29T14:01:25.000Z",
      "url": "https://www.youtube.com/watch?v=t6y2cVNjCAw",
      "thumbnail": "https://i.ytimg.com/vi/t6y2cVNjCAw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… GeForce Garage announces the winner of the Summer of RTX r/buildapc Community Build contest: u/JeffersonPutnam, who built a small-form-factor GeForce RTX 5090 system. The description lists the full build and parts (Fractal Design Era 2, GeForce RTX 5090 Founders Edition, MSI MPG B850I Edge, Ryzen 7 9800X3D, 32GB DDR5-6000, Corsair SF1000, Corsair Nautilus 240 RS) and links to the PCPartPicker list and NVIDIA social channels.",
        "bullets": [
          "Winner: u/JeffersonPutnam — SFF build featuring GeForce RTX 5090.",
          "Complete parts list available on PCPartPicker (link provided).",
          "Key components: Fractal Design Era 2, RTX 5090 FE, MSI B850I Edge, Ryzen 7 9800X3D, 32GB DDR5-6000, Corsair SF1000, Corsair Nautilus 240 RS.",
          "GeForce host: Dwight (Twitter: @_MightyPotato).",
          "NVIDIA/GeForce social channels and community portal links included."
        ],
        "takeaways": [
          "Highlights community demand for flagship consumer GPUs (GeForce RTX 5090) in compact builds.",
          "SFF configuration paired with a high-wattage PSU (Corsair SF1000) underscores power-delivery and cooling considerations for dense deployments.",
          "Combination of high-end GPU and high-frequency DDR5 plus a 3D V-Cache CPU suggests workloads that benefit from strong CPU–GPU balance.",
          "Provided PCPartPicker BOM enables exact reproduction for testing, procurement, or benchmarking."
        ],
        "tags": [
          "GeForceGarage",
          "RTX",
          "GeForceRTX50",
          "RTX5090",
          "SFF",
          "buildapc",
          "FractalEra2",
          "NVIDIA",
          "PCBuild",
          "GamingPC"
        ]
      }
    },
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy AI solutions that unlocked new revenue streams. Sreeni Alakappan explains how GenAI and Google Cloud's infrastructure were used to streamline operations, boost developer productivity, compress the digital transformation timeline, and expand the company's ambitions.",
        "bullets": [
          "TTEC worked with Google Cloud Consulting to accelerate AI prototyping and deployment.",
          "GenAI and Google Cloud infrastructure were central to the effort.",
          "The initiative aimed to streamline operations and increase developer productivity.",
          "The collaboration compressed TTEC's digital transformation timeline and enabled new revenue opportunities."
        ],
        "takeaways": [
          "Investing in cloud-native GenAI platforms can shorten time-to-market for AI initiatives.",
          "Robust cloud infrastructure supports faster prototyping and deployment of AI solutions.",
          "Improved developer productivity translates to quicker rollout and iteration of services.",
          "Cloud consulting partnerships can help compress transformation timelines and unlock new revenue streams."
        ],
        "tags": [
          "googlecloud",
          "ttec",
          "genai",
          "aideployment",
          "operationalefficiency",
          "customerexperience",
          "googlecloudplatform",
          "digitaltransformation"
        ]
      }
    },
    {
      "id": "gv6zK265OUE",
      "title": "Build your first GraphRAG Powered Agent! (No Graph Expert Required) | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-27T20:55:49.000Z",
      "url": "https://www.youtube.com/watch?v=gv6zK265OUE",
      "thumbnail": "https://i.ytimg.com/vi/gv6zK265OUE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This session shows how to build a GraphRAG-powered knowledge graph in an afternoon using the AI tools teams already use, with a live demo on real documents. A sample notebook is provided so teams can follow along without a months-long project.",
        "bullets": [
          "Explains building a knowledge graph (GraphRAG) quickly using familiar AI tools.",
          "Live demo using real documents: docs, PDFs, and wikis.",
          "Positioned as an afternoon project rather than a multi-month effort.",
          "Sample notebook/code provided for hands-on replication.",
          "Focus is on unlocking trapped knowledge so models can reason over it."
        ],
        "takeaways": [
          "Quicker access to institutional knowledge in documents can improve AI-driven decision support.",
          "Shorter build time reduces project risk and resource commitment for infrastructure teams.",
          "Provided sample code and demo enable fast prototyping using existing AI toolchains.",
          "Making documents queryable by models lowers the barrier to extracting operational insights from internal content."
        ],
        "tags": [
          "GraphRAG",
          "knowledge-graph",
          "AI",
          "retrieval-augmented-generation",
          "AWS-Neptune",
          "demo",
          "sample-code",
          "document-knowledge",
          "rapid-prototyping"
        ]
      }
    },
    {
      "id": "azzmtqcIeCU",
      "title": "Cloud Cost Efficiency I The Keys to AWS Optimization | S16 E2",
      "channel": "AWS Events",
      "published_at": "2026-01-27T10:14:44.000Z",
      "url": "https://www.youtube.com/watch?v=azzmtqcIeCU",
      "thumbnail": "https://i.ytimg.com/vi/azzmtqcIeCU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This livestream explores key AWS cost-efficiency KPIs — including cost per transaction, resource utilization rates, and ROI — and explains how to measure, track, and optimize cloud spending. It also covers benchmarking, identifying optimization opportunities, and building dashboards to communicate value to stakeholders, aimed at cloud engineers, FinOps teams, and technical leaders.",
        "bullets": [
          "Focus on essential KPIs: cost per transaction, resource utilization, and ROI.",
          "Guidance on measuring and tracking AWS spending using metrics frameworks.",
          "Practical approaches to benchmarking cloud efficiency and spotting optimization opportunities.",
          "How to build dashboards that align technical performance with business outcomes.",
          "Target audience: cloud engineers, FinOps teams, and technical leaders."
        ],
        "takeaways": [
          "Align cost and performance KPIs with business outcomes to make finance-informed technical decisions.",
          "Benchmarking reveals where to prioritize optimization efforts and reduce wasted spend.",
          "Dashboards are key for communicating efficiency gains and securing stakeholder buy-in.",
          "Consistent measurement and tracking enable continuous improvement of AWS ROI."
        ],
        "tags": [
          "AWS",
          "CloudCosts",
          "FinOps",
          "CostOptimization",
          "CloudMetrics",
          "AWSCostManagement",
          "CloudEfficiency",
          "CostPerTransaction",
          "ResourceUtilization",
          "ROI"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video shows Jo discovering how Copilot Groups makes route planning easy. The description associates the content with Microsoft Copilot and AI (#copilot #microsoftcopilot #ai).",
        "bullets": [
          "Primary message: route planning made easy",
          "Showcases Copilot Groups as the featured capability",
          "Centers on a person named Jo discovering the tool",
          "Tied to Microsoft Copilot and AI via hashtags"
        ],
        "takeaways": [
          "Simpler route planning could help coordinate field crews and reduce travel time for maintenance teams",
          "Copilot Groups may support organizing multi-person tasks, useful for scheduled or emergency responses",
          "Using AI-assisted planning can improve operational efficiency and resource allocation",
          "Adopting such tools could shorten dispatch times and streamline logistics for grid/data center workflows"
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "route-planning",
          "copilot-groups",
          "field-operations",
          "maintenance",
          "team-coordination",
          "efficiency"
        ]
      }
    }
  ]
}