{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-19T14:03:52.865Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "6L86-OnOXV0",
      "title": "How I Built A $1M/Year Business - And Helped My Parents Retire",
      "channel": "CNBC Make It",
      "published_at": "2026-01-17T15:00:09.000Z",
      "url": "https://www.youtube.com/watch?v=6L86-OnOXV0",
      "thumbnail": "https://i.ytimg.com/vi/6L86-OnOXV0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Tuan Le emigrated from Vietnam to Toronto and vowed at 15 to help his parents retire. Ten years later his social video production company, ShortsCut, generates over $1 million USD annually, and he now covers his parents' rent and living expenses so they no longer have to work full time.",
        "bullets": [
          "Tuan Le emigrated from Vietnam to Toronto in 2015 and made a personal vow at age 15 to help his parents retire.",
          "He founded ShortsCut, a social video production company.",
          "ShortsCut brings in over $1 million USD per year in sales.",
          "Le now pays his parents' rent and living expenses so they no longer work full time.",
          "Video credits include production and reporting staff from CNBC Make It and additional footage sources."
        ],
        "takeaways": [
          "High-revenue digital content companies (like ShortsCut) can place significant demand on hosting, storage, and content-delivery resources—plan for scalable capacity.",
          "Reliable uptime and bandwidth are important for video production clients that depend on timely publishing and distribution.",
          "Cost-effective, scalable storage and backup solutions matter for companies producing and archiving large volumes of video content.",
          "Flexible service agreements and ramp-up options can help infrastructure providers support fast-growing media businesses without service interruptions."
        ],
        "tags": [
          "entrepreneurship",
          "shortscut",
          "socialvideo",
          "businessgrowth",
          "immigrantsuccess",
          "family",
          "contentproduction",
          "CNBCMakeIt"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video highlights a giant carbon dioxide bubble battery that can store 20 megawatts of power for about 8 hours. It presents the technology as a way to help manage fluctuating renewable generation and support the global shift to clean energy.",
        "bullets": [
          "Giant carbon dioxide bubble used as an energy storage device.",
          "Stores 20 megawatts of power.",
          "Provides roughly 8 hours of storage.",
          "Aimed at addressing renewable energy variability.",
          "Framed as supporting the global transition to clean energy."
        ],
        "takeaways": [
          "Provides a 20 MW / ~8-hour storage profile to consider when planning capacity and backup needs.",
          "Targets smoothing of renewable generation variability—relevant for grid stability and availability planning.",
          "Could support decarbonization goals by enabling greater renewable integration.",
          "Decision-makers should assess whether this storage profile and technology fit their operational and deployment requirements."
        ],
        "tags": [
          "CO2",
          "battery",
          "energy-storage",
          "renewable-energy",
          "grid",
          "datacenter",
          "innovation",
          "IEEE"
        ]
      }
    },
    {
      "id": "OINppmPan0o",
      "title": "Figure Skating | Making Team USA presented by Xfinity with Apolo Ohno",
      "channel": "Team USA",
      "published_at": "2026-01-16T19:30:36.000Z",
      "url": "https://www.youtube.com/watch?v=OINppmPan0o",
      "thumbnail": "https://i.ytimg.com/vi/OINppmPan0o/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the episode—framed as \"Built on trust\"—features figure skating duo Vadym Kolesnik and Emilia Zingas sitting down with Apolo Ohno ahead of the Winter Olympics. It is an installment of Making Team USA presented by Xfinity that highlights their partnership as they prepare for the Games.",
        "bullets": [
          "Features skaters Vadym Kolesnik and Emilia Zingas",
          "Interviewed by Apolo Ohno",
          "Episode titled or framed as \"Built on trust\"",
          "Aired as part of Making Team USA presented by Xfinity",
          "Positioned ahead of the Winter Olympics"
        ],
        "takeaways": [
          "Emphasis on trust between teammates underscores the value of reliable partnerships in mission-critical operations",
          "Pre-event preparation and communication are key—analogous to planning before major infrastructure or capacity events",
          "Sponsorship/partnership (presented by Xfinity) highlights the role of external providers in supporting high-profile initiatives"
        ],
        "tags": [
          "FigureSkating",
          "VadymKolesnik",
          "EmiliaZingas",
          "ApoloOhno",
          "MakingTeamUSA",
          "Xfinity",
          "WinterOlympics",
          "MTUSA",
          "TeamUSA"
        ]
      }
    },
    {
      "id": "RalzsofAYHM",
      "title": "29-year-old spent $20,000 to open a store in New York — now it brings in $1.6 million a year",
      "channel": "CNBC Make It",
      "published_at": "2026-01-16T17:00:48.000Z",
      "url": "https://www.youtube.com/watch?v=RalzsofAYHM",
      "thumbnail": "https://i.ytimg.com/vi/RalzsofAYHM/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Abby Price founded Abbode while a graduate student at Parsons, selling dried floral arrangements to New York locals on Facebook in 2019. By March 2022 she was operating a Nolita storefront selling bouquets and home decor and had reinvested cashflow to buy a $15,000 embroidery machine she bought “on a total whim,” which had sat in her shop’s basement for a year.",
        "bullets": [
          "Founded Abbode as a Parsons grad student; began selling dried floral arrangements on Facebook in 2019.",
          "By March 2022, operated a rented storefront in Nolita selling bouquets and home decor.",
          "Retail cashflow enabled purchase of a $15,000 embroidery machine.",
          "Price called the embroidery machine purchase “on a total whim.”",
          "The machine (described as a secret to her success) sat covered in dust in the shop’s basement for a year."
        ],
        "takeaways": [
          "Retail cashflow can fund opportunistic capital expenditures without outside financing.",
          "Starting with low-cost online sales can scale into a physical storefront that generates usable cashflow.",
          "Idle or underused equipment can represent latent capabilities that may later drive growth."
        ],
        "tags": [
          "Abby Price",
          "Abbode",
          "Parsons",
          "dried florals",
          "Nolita",
          "storefront",
          "embroidery machine",
          "small business",
          "Facebook sales"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, KPMG tax experts Monika Palmowska and Jakub Roszkiewicz discuss how AI is already transforming transfer pricing — from monitoring profitability and benchmarking to automating documentation — and outline practical steps for implementing AI in TP processes. They emphasize that AI will support and strengthen advisors (not replace them), while flagging data/security risks, regulatory concerns (RODO), and the need for organized processes and secure environments like Digital Gateway.",
        "bullets": [
          "AI use cases in transfer pricing: profitability monitoring, comparative analyses, automated documentation.",
          "AI augments tax advisors’ work rather than replaces them; it also supports junior staff development.",
          "Key risks include data protection, security and AI-specific issues like hallucinations and RODO compliance.",
          "Secure environments (Digital Gateway) and ERP integration are important enablers for AI solutions.",
          "First steps: organize processes, start implementation deliberately, and build on core transformation pillars."
        ],
        "takeaways": [
          "So what: ensure secure, compliant environments (e.g., gated AI workspaces) to meet RODO and data-security needs.",
          "So what: plan for integration between AI tools and ERP/data sources to enable intelligent benchmarking and monitoring.",
          "So what: prioritize process standardization and data hygiene before AI rollout to maximize accuracy and reduce risks.",
          "So what: anticipate requirements for controlled compute, access management and audit trails to support AI-driven TP workflows."
        ],
        "tags": [
          "podatki",
          "AI",
          "cenytransferowe",
          "transfer-pricing",
          "KPMG",
          "automatyzacja",
          "ERP",
          "dane-bezpieczeństwo",
          "RODO"
        ]
      }
    },
    {
      "id": "dGfcT63U7Mo",
      "title": "The 2026 U.S. Olympic Figure Skating Team 🇺🇸",
      "channel": "Team USA",
      "published_at": "2026-01-15T20:43:24.000Z",
      "url": "https://www.youtube.com/watch?v=dGfcT63U7Mo",
      "thumbnail": "https://i.ytimg.com/vi/dGfcT63U7Mo/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this Team USA video announces the U.S. Olympic figure skating lineup for the 2026 Winter Olympics. The clip is titled \"The 2026 U.S. Olympic Figure Skating Team 🇺🇸\" and was published on 2026-01-15T20:43:24.000Z; no transcript is available.",
        "bullets": [
          "Title: The 2026 U.S. Olympic Figure Skating Team 🇺🇸",
          "Channel: Team USA",
          "Published: 2026-01-15T20:43:24.000Z",
          "Description: \"This U.S. Olympic Figure Skating lineup. 🔥 #WinterOlympics\"",
          "Transcript: Not available"
        ],
        "takeaways": [
          "No transcript provided in source; consider generating and storing transcripts for search, accessibility, or analytics needs.",
          "Metadata is minimal (short description and tags), so metadata storage and indexing requirements are low.",
          "Published timestamp is available—useful for retention, lifecycle management, and archival policies.",
          "Channel is the official Team USA account—confirm rights and licensing before redistribution or commercial reuse."
        ],
        "tags": [
          "Team USA",
          "Figure Skating",
          "Winter Olympics",
          "2026",
          "Olympics",
          "U.S. Olympic Team",
          "Lineup",
          "Sports"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video encourages using Microsoft Copilot to keep momentum by stacking small wins across workouts, projects, and personal goals. It frames Copilot as a tool to support steady progress and sustained motivation.",
        "bullets": [
          "Promotes stacking small wins to maintain momentum.",
          "Relevant for workouts, projects, and personal goals.",
          "Positions Copilot as a support for ongoing progress.",
          "Focuses on sustaining momentum rather than dramatic change."
        ],
        "takeaways": [
          "Tools that help teams achieve incremental wins can sustain project momentum.",
          "Supporting steady progress across tasks may reduce the chance of stalled initiatives.",
          "Productivity assistants like Copilot can be considered for workforce enablement strategies.",
          "Emphasizing continuous, small improvements can help maintain motivation over time."
        ],
        "tags": [
          "Microsoft Copilot",
          "Copilot",
          "productivity",
          "momentum",
          "small wins",
          "goals",
          "projects",
          "workouts",
          "motivation",
          "personal development"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights how the Dell PowerEdge R770AP server powered by Intel® Xeon® 6 processors delivers the precision and speed needed for high-frequency trading, enabling hundreds of trades in seconds to help maximize gains and minimize losses. It frames Intel Xeon 6 CPUs' high-performance capabilities as a defining force for the future of finance.",
        "bullets": [
          "High-frequency trading depends on precision and speed.",
          "Dell PowerEdge R770AP server is showcased with Intel® Xeon® 6 processors.",
          "System performance enables execution of hundreds of trades in seconds.",
          "Improved speed and precision aim to maximize gains and minimize losses.",
          "Intel Xeon 6 CPUs are presented as shaping the future of finance."
        ],
        "takeaways": [
          "Prioritize server platforms that emphasize precision and speed for trading workloads.",
          "Evaluate Dell PowerEdge R770AP with Intel Xeon 6 as a candidate for HFT use cases.",
          "High-performance CPUs can directly impact trading throughput and potential financial outcomes.",
          "Data center choices should align with the need to execute large numbers of trades in seconds."
        ],
        "tags": [
          "high-frequency trading",
          "HFT",
          "Intel Xeon 6",
          "Dell PowerEdge R770AP",
          "finance",
          "low-latency",
          "servers",
          "data center",
          "high-performance",
          "trading infrastructure"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the creative spark was out and Copilot brought it back to life. The description invites viewers to download Copilot and try it for themselves via the link in bio.",
        "bullets": [
          "Message: Copilot revived a lost creative spark.",
          "Call to action: download Copilot and try it.",
          "Download link indicated as 'link in bio.'",
          "Short promotional video with no transcript provided."
        ],
        "takeaways": [
          "Consider piloting Copilot to see if it helps restore creative workflows within your teams.",
          "Use the provided download link to trial the tool before wider adoption.",
          "Assess whether the messaging around creativity aligns with your teams' needs and use cases."
        ],
        "tags": [
          "Microsoft",
          "Copilot",
          "creativity",
          "AI",
          "download",
          "link-in-bio",
          "try-now",
          "productivity",
          "creative-tools"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video showcases the open-world martial arts RPG Where Winds Meet running with DLSS 4 and Multi Frame Generation under #RTXOn. The clip is credited to @DigitalDreamsyt.",
        "bullets": [
          "Open-world martial arts RPG: Where Winds Meet",
          "Showcases DLSS 4 with Multi Frame Generation",
          "Highlights #RTXOn",
          "Video credit: @DigitalDreamsyt"
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is featured — note support for DLSS 4 when evaluating GPU/software stacks",
          "#RTXOn is highlighted — ensure drivers and runtimes used in the environment are compatible with RTX features",
          "The demo is an open-world RPG — consider this type of real-time graphics workload when planning GPU capacity and testing"
        ],
        "tags": [
          "Where Winds Meet",
          "DLSS 4",
          "Multi Frame Generation",
          "RTXOn",
          "open-world",
          "martial arts",
          "RPG",
          "DigitalDreamsyt",
          "NVIDIA",
          "gaming"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This video is from the Intel Business YouTube channel and is titled \"Taha Khalifa (Intel) | Intel Business.\" The channel is presented as a hub for IT information, offering resources, guidance, and expert insights for projects ranging from data centers to devices, with links to subscribe and follow.",
        "bullets": [
          "Video title: \"Taha Khalifa (Intel) | Intel Business\" on the Intel Business channel",
          "No transcript available for this video",
          "Intel Business positions itself as a source of IT resources, guidance, and expert insights for data centers and devices",
          "Includes links to subscribe and follow on website, X, LinkedIn, and Facebook",
          "Published on 2026-01-14"
        ],
        "takeaways": [
          "Intel Business is promoted as a centralized resource for IT projects relevant to data center decision-makers",
          "Decision-makers can visit the Intel Business website for resources and guidance specific to data centers and devices",
          "Subscribing and following the channel and social accounts can help stay updated on Intel-provided IT insights and guidance"
        ],
        "tags": [
          "Intel",
          "Intel Business",
          "Taha Khalifa",
          "data centers",
          "IT resources",
          "IT projects",
          "devices",
          "YouTube",
          "subscribe"
        ]
      }
    },
    {
      "id": "kSocjh8PZnQ",
      "title": "Rynek dóbr luksusowych w obliczu transformacji | Andrzej Marczak, Tomasz Wiśniewski",
      "channel": "KPMG Poland",
      "published_at": "2026-01-13T10:23:31.000Z",
      "url": "https://www.youtube.com/watch?v=kSocjh8PZnQ",
      "thumbnail": "https://i.ytimg.com/vi/kSocjh8PZnQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Ten podcast discusses how the luxury goods market is transforming, highlighting trends like a shift toward experiences, rising importance of ESG, and the rise of \"affordable luxury.\" KPMG experts Andrzej Marczak and Tomasz Wiśniewski also compare Poland — a growing but fragmented market — to global dynamics and outline topics from personalization and Gen Z preferences to AI and craftsmanship as the future of luxury.",
        "bullets": [
          "Emphasis on experiences over ownership, especially among Generation Z.",
          "Growing role of ESG and responsible-luxury practices (e.g., eco-leathers, certifications).",
          "Market concentration: top 2% of wealth holders account for ~40% of the market.",
          "Poland’s luxury market is still growing domestically but remains fragmented.",
          "Future themes include AI, personalization, craftsmanship, and luxury in hospitality/film."
        ],
        "takeaways": [
          "AI and personalization trends cited in the episode could increase demand for compute and data-processing capacity — consider scalable infrastructure for AI workloads.",
          "ESG and certification emphasis suggests clients may prefer or require greener, certified hosting and energy-efficient operations — plan for renewable energy options and sustainability reporting.",
          "Growth of luxury hospitality and branded experiences implies a need for low-latency, high-availability services in regional markets like Poland — evaluate local capacity and edge options.",
          "Concentration of high-value customers supports offering tiered, premium SLAs and resiliency features tailored to high-net-worth clientele and experience-driven services."
        ],
        "tags": [
          "luxury",
          "ESG",
          "Poland",
          "personalization",
          "AI",
          "luxury-tourism",
          "affordable-luxury",
          "GenZ",
          "KPMG",
          "market-trends"
        ]
      }
    }
  ]
}