{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-30T15:59:00.419Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "z-X9MYi1Rr0",
      "title": "Leveraging tax credits and incentives for sustainability projects",
      "channel": "PwC US",
      "published_at": "2026-01-30T13:27:25.000Z",
      "url": "https://www.youtube.com/watch?v=z-X9MYi1Rr0",
      "thumbnail": "https://i.ytimg.com/vi/z-X9MYi1Rr0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Randa Barsoum of PwC US emphasizes that energy tax credits are only part of the sustainability incentives landscape and highlights less obvious opportunities such as state and local abatements, location-based incentives, and R&D tax credits tied to innovation like reimagining packaging or processes. The core message: viewing sustainability investments through a broader tax lens can unlock meaningful tax value.",
        "bullets": [
          "Energy incentives are widely known but not the only tax tools for sustainability.",
          "State and local abatements can provide targeted tax relief for sustainability projects.",
          "Location-based incentives may influence siting and project economics.",
          "R&D tax credits can apply to sustainability-focused innovation (e.g., new packaging or processes).",
          "Broader tax analysis can increase the financial return on sustainability investments."
        ],
        "takeaways": [
          "When planning grid or data center projects, evaluate state and local abatements as part of site selection and economic modeling.",
          "Consider location-based incentives alongside energy credits to optimize total project incentives.",
          "Track and document innovation in processes, cooling, or materials to capture potential R&D tax credits.",
          "Integrate a comprehensive tax-incentive review into sustainability ROI assessments and project planning."
        ],
        "tags": [
          "sustainability",
          "tax credits",
          "incentives",
          "R&D tax credit",
          "state and local abatements",
          "location-based incentives",
          "energy incentives",
          "PwC",
          "tax strategy",
          "corporate sustainability"
        ]
      }
    },
    {
      "id": "PxnMl4M2pww",
      "title": "Why data is critical to sustainable supply chains",
      "channel": "PwC US",
      "published_at": "2026-01-30T13:24:27.000Z",
      "url": "https://www.youtube.com/watch?v=PxnMl4M2pww",
      "thumbnail": "https://i.ytimg.com/vi/PxnMl4M2pww/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… David Linich, Sustainability Principal at PwC US, explains that reliable, high-quality data enables organizations to scenario plan, protect margins, and deliver sustainable, high-quality products at the right place and time. With conditions changing week by week, he emphasizes that data-driven decision-making is critical to building resilient, modern supply chains.",
        "bullets": [
          "Reliable, high-quality data supports scenario planning for supply-chain disruptions.",
          "Data helps organizations protect margins amid shifting tariffs and cost pressures.",
          "Accurate data enables delivery of sustainable, high-quality products to the right place and time.",
          "Supply-chain conditions can change week by week, increasing the need for timely data.",
          "Data-driven decision-making is presented as essential for resilient, modern supply chains."
        ],
        "takeaways": [
          "Use reliable, high-quality supply-chain data to run scenario planning for capacity and risk.",
          "Leverage data to protect margins by informing sourcing and logistics decisions.",
          "Ensure procurement and delivery decisions are informed by data to meet sustainability goals and quality targets.",
          "Monitor week-by-week supply conditions with data to adapt operations quickly.",
          "Prioritize data-driven decision processes to strengthen overall supply-chain resilience."
        ],
        "tags": [
          "data",
          "supply-chain",
          "sustainability",
          "PwC",
          "resilience",
          "scenario-planning",
          "operational-resilience",
          "margins",
          "supply-chain-data",
          "sustainable-sourcing"
        ]
      }
    },
    {
      "id": "gv6zK265OUE",
      "title": "Build your first GraphRAG Powered Agent! (No Graph Expert Required) | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-30T06:40:49.000Z",
      "url": "https://www.youtube.com/watch?v=gv6zK265OUE",
      "thumbnail": "https://i.ytimg.com/vi/gv6zK265OUE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This AWS Events session shows how to build a GraphRAG-powered knowledge graph in an afternoon using the same AI tools teams already use, with a live demo using real documents. The talk emphasizes that teams don’t need six‑month projects or graph expertise and includes a sample notebook to follow along.",
        "bullets": [
          "Knowledge in docs, PDFs, and wikis is often trapped and not directly usable by models.",
          "Knowledge graphs can unlock that information for reasoning.",
          "Building a useful graph is presented as achievable in an afternoon, not a major undertaking.",
          "Live demo uses real documents to demonstrate the approach.",
          "A sample notebook is provided for hands‑on replication."
        ],
        "takeaways": [
          "Prototype indexing of operational docs (manuals, runbooks, reports) quickly to surface actionable knowledge.",
          "Shorter project timelines enable faster pilots and evaluation of knowledge‑driven agents.",
          "Leverage existing AI tools and the provided sample notebook to accelerate internal adoption.",
          "Live, document‑based demos indicate practical applicability for decision support and troubleshooting."
        ],
        "tags": [
          "knowledge-graphs",
          "GraphRAG",
          "retrieval-augmented-generation",
          "AI",
          "AWS-Neptune",
          "databases-for-AI",
          "live-demo",
          "sample-notebook"
        ]
      }
    },
    {
      "id": "azzmtqcIeCU",
      "title": "Cloud Cost Efficiency I The Keys to AWS Optimization | S16 E2",
      "channel": "AWS Events",
      "published_at": "2026-01-30T05:12:30.000Z",
      "url": "https://www.youtube.com/watch?v=azzmtqcIeCU",
      "thumbnail": "https://i.ytimg.com/vi/azzmtqcIeCU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This livestream breaks down the key KPIs that drive AWS cost efficiency—highlighting cost per transaction, resource utilization rates, and ROI calculations—and explains how to measure, track, and optimize AWS spending. It also covers practical benchmarking approaches, ways to identify cost optimization opportunities, and building dashboards to communicate value to stakeholders.",
        "bullets": [
          "Core KPIs: cost per transaction, resource utilization, and ROI for cloud financial management.",
          "Methods to measure, track, and optimize AWS spending using proven metrics frameworks.",
          "Practical benchmarking techniques to assess cloud efficiency and spot optimization opportunities.",
          "Guidance on building dashboards that align technical performance with business outcomes.",
          "Intended audience: cloud engineers, FinOps teams, and technical leaders focused on maximizing AWS investment."
        ],
        "takeaways": [
          "Quantify cloud economics (cost per transaction, ROI) to directly compare AWS spending with on‑prem/data center costs.",
          "Monitor resource utilization rates to reveal inefficiencies and right‑size capacity in hybrid environments.",
          "Benchmarking cloud efficiency provides objective data to support migration, consolidation, or optimization decisions.",
          "Dashboards that tie technical metrics to business outcomes improve stakeholder buy‑in for cost-saving initiatives."
        ],
        "tags": [
          "AWS",
          "CloudCosts",
          "FinOps",
          "CostOptimization",
          "CloudMetrics",
          "AWSCostManagement",
          "CloudEfficiency",
          "CostPerTransaction",
          "ResourceUtilization"
        ]
      }
    },
    {
      "id": "oQtkaHzUYlY",
      "title": "Copilot helps Christa find her inner star 🌟",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-29T18:33:49.000Z",
      "url": "https://www.youtube.com/watch?v=oQtkaHzUYlY",
      "thumbnail": "https://i.ytimg.com/vi/oQtkaHzUYlY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video uses a star-filled-sky metaphor to show Copilot helping Christa \"find the star within.\" It presents Copilot as a personal, inspirational assistant and includes a clear call-to-action to download and try Copilot via the link in the creator's bio.",
        "bullets": [
          "Copilot helps Christa \"find the star within\" using a star-filled-sky metaphor.",
          "Framing emphasizes personal inspiration and self-discovery.",
          "Clear call-to-action: download and try Copilot via the link in bio.",
          "No transcript available — summary is based solely on the description.",
          "Short, evocative promotional content aimed at driving hands-on trials."
        ],
        "takeaways": [
          "If promoting consumer-facing AI tools like Copilot, expect CTA-driven traffic from short social clips — plan capacity for download and onboarding spikes.",
          "Positioning Copilot as a personal/creative assistant underscores the need for responsive, reliable service to preserve user experience.",
          "Social-driven trials can be an acquisition channel; ensure analytics and monitoring are in place to track conversion from bio links.",
          "Coordinate scalability and availability around marketing pushes to avoid performance issues during promotional periods."
        ],
        "tags": [
          "Copilot",
          "Microsoft",
          "Christa",
          "AI",
          "personalization",
          "inspiration",
          "download",
          "call-to-action",
          "shortvideo",
          "marketing"
        ]
      }
    },
    {
      "id": "BYtYm-xyKR8",
      "title": "Bringing In $251K A Year With 3 Jobs In The Bay Area",
      "channel": "CNBC Make It",
      "published_at": "2026-01-29T17:47:46.000Z",
      "url": "https://www.youtube.com/watch?v=BYtYm-xyKR8",
      "thumbnail": "https://i.ytimg.com/vi/BYtYm-xyKR8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Naseema McElroy, 44, is a labor and delivery nurse in Brentwood, California who also runs a personal finance brand called Financially Intentional and brings in $251K a year across three jobs in the Bay Area. She documented a journey from nearly $1 million in debt in 2015 to becoming debt-free by 2017 and is profiled in CNBC Make It's Millennial Money series.",
        "bullets": [
          "Naseema McElroy — 44, labor and delivery nurse and founder of Financially Intentional.",
          "Earns $251,000 annually from three jobs in the Bay Area.",
          "Accumulated nearly $1 million in debt by 2015 and tracked her payoff publicly.",
          "Was debt-free by 2017 after documenting the journey.",
          "Profiled by CNBC Make It as part of its Millennial Money series."
        ],
        "takeaways": [
          "Based on the description that she operates a personal finance brand and is featured in video content, data centers and content delivery networks should account for ongoing demand from individual creators and small media producers.",
          "Given the subject is a high-earning, multi-job professional in the Bay Area, grid planners should consider localized residential and commercial energy demand patterns tied to dense employment hubs.",
          "Media profiles and creator-led brands generate storage and bandwidth needs for video hosting and distribution — capacity planning should account for steady creator-driven traffic.",
          "Reliable, low-latency infrastructure benefits professionals who monetize personal brands and appear in multimedia coverage, so redundancy and uptime considerations remain important."
        ],
        "tags": [
          "Naseema McElroy",
          "Financially Intentional",
          "debt payoff",
          "personal finance",
          "Bay Area",
          "Brentwood CA",
          "CNBC Make It",
          "Millennial Money",
          "side hustle",
          "high income"
        ]
      }
    },
    {
      "id": "t6y2cVNjCAw",
      "title": "GeForce Garage - Summer of RTX Community Build",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-29T14:01:25.000Z",
      "url": "https://www.youtube.com/watch?v=t6y2cVNjCAw",
      "thumbnail": "https://i.ytimg.com/vi/t6y2cVNjCAw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description…GeForce Garage highlighted the winner of the Summer of RTX r/buildapc community build, u/JeffersonPutnam, who assembled a small-form-factor GeForce RTX 5090 system. The description lists the full parts: Fractal Design Era 2 chassis, GeForce RTX 5090 Founders Edition, MSI MPG B850I Edge motherboard, Ryzen 7 9800X3D, 32GB Teamgroup DDR5-6000, Corsair SF1000 power supply, and Corsair Nautilus 240 RS AIO.",
        "bullets": [
          "Winner: u/JeffersonPutnam (Summer of RTX r/buildapc community contest).",
          "System: Small-form-factor GeForce RTX 5090 build in a Fractal Design Era 2 chassis.",
          "Core components: RTX 5090 FE, MSI MPG B850I Edge motherboard, Ryzen 7 9800X3D CPU, 32GB DDR5-6000 RAM.",
          "Power & cooling: Corsair SF1000 (1000W SFX) and Corsair Nautilus 240 RS AIO; full parts list on PCPartPicker.",
          "GeForce host: Dwight (twitter: @_MightyPotato); NVIDIA links provided in description."
        ],
        "takeaways": [
          "The RTX 5090 Founders Edition was used in a compact SFF desktop build—component fit and airflow are relevant for dense deployments.",
          "This build uses a Corsair SF1000 (1000W SFX), indicating high-power consumer GPUs can require substantial PSU capacity even in small form factors.",
          "An AIO liquid cooler (Corsair Nautilus 240 RS) was paired with the Ryzen 7 9800X3D, highlighting cooling needs for high-performance CPUs in constrained chassis.",
          "Mini-ITX platform (MSI MPG B850I Edge) and Fractal Era 2 chassis choice underscore compatibility and space considerations when specifying compact systems."
        ],
        "tags": [
          "GeForceGarage",
          "RTX5090",
          "SmallFormFactor",
          "PCBuild",
          "NVIDIA",
          "Ryzen7",
          "DDR5",
          "CorsairSF1000"
        ]
      }
    },
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy GenAI solutions, unlocking new revenue streams and streamlining operations. Sreeni Alakappan says the company leveraged Google Cloud infrastructure to boost developer productivity and compress its digital transformation timeline.",
        "bullets": [
          "TTEC worked with Google Cloud Consulting to rapidly prototype and deploy AI/GenAI solutions.",
          "Google Cloud infrastructure was used to streamline operations and boost developer productivity.",
          "The effort unlocked entirely new revenue streams for TTEC.",
          "Consulting engagement compressed TTEC's digital transformation timeline.",
          "Partnership expanded the company's business ambitions for AI-driven services."
        ],
        "takeaways": [
          "Cloud infrastructure that supports GenAI can accelerate deployment and time-to-value.",
          "Rapid prototyping via cloud consulting shortens digital transformation timelines.",
          "Improved developer productivity from cloud tooling can reduce operational friction.",
          "Engaging cloud consultants can help translate AI pilots into new revenue opportunities.",
          "Decision-makers should prioritize scalable cloud capabilities to enable AI-driven service expansion."
        ],
        "tags": [
          "googlecloud",
          "ttec",
          "genai",
          "aideployment",
          "operationalefficiency",
          "customerexperience",
          "googlecloudplatform",
          "generativeai",
          "digitaltransformation",
          "cloudconsulting"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This video follows Jo discovering how Copilot Groups makes route planning easy. It highlights the power of Copilot Groups to simplify route-planning workflows.",
        "bullets": [
          "Focus on route planning made easy",
          "Jo is the user exploring Copilot Groups",
          "Highlights the capabilities of Copilot Groups",
          "Published by Microsoft Copilot with tags #copilot #microsoftcopilot #ai"
        ],
        "takeaways": [
          "If Copilot Groups simplifies route planning as described, it could streamline field crew routing and reduce planning time.",
          "If route planning is easier, scheduling maintenance or emergency responses for grid/data center sites may be faster.",
          "If Copilot Groups centralizes group-based planning, coordination between teams and assets could be improved."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "route-planning",
          "copilot-groups",
          "logistics",
          "field-operations",
          "productivity"
        ]
      }
    }
  ]
}