{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-22T14:58:09.883Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "IKkVWKdumHw",
      "title": "re:Invent 2025 - Chalk Talk - Origin management for multi-region applications with Amazon CloudFront",
      "channel": "AWS Events",
      "published_at": "2026-01-22T08:10:48.000Z",
      "url": "https://www.youtube.com/watch?v=IKkVWKdumHw",
      "thumbnail": "https://i.ytimg.com/vi/IKkVWKdumHw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… You will learn origin management with Amazon CloudFront to build secure, resilient multi-region content delivery systems. The session covers automatic failover with CloudFront and Route 53, granular routing via CloudFront Functions, origin security (S3 Origin Access Control and VPC private origins), hybrid integration with AWS Direct Connect, and using Origin Shield to optimize cache performance.",
        "bullets": [
          "Automatic failover using CloudFront combined with Route 53",
          "Granular origin routing configured with CloudFront Functions",
          "Secure origins via S3 Origin Access Control (OAC) and VPC private origins",
          "Hybrid on-prem integration through AWS Direct Connect",
          "Origin Shield to improve cache efficiency and reduce origin load"
        ],
        "takeaways": [
          "Automatic failover and multi-region design improve delivery resilience and availability",
          "Fine-grained routing lets you direct traffic to optimal origins for performance or policy",
          "S3 OAC and VPC private origins strengthen origin security posture",
          "Direct Connect enables consistent hybrid architectures between on-prem and AWS",
          "Origin Shield reduces origin load and can enhance cache hit behavior for high-demand content"
        ],
        "tags": [
          "CloudFront",
          "Origin Management",
          "Route53",
          "CloudFront Functions",
          "Origin Shield",
          "S3 OAC",
          "VPC Private Origins",
          "AWS Direct Connect",
          "Hybrid Architecture",
          "Content Delivery"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, KPMG leaders explain that AI is already part of everyday audit work, helping automate repetitive tasks, analyze large datasets and support better decision-making. They outline practical tools and platforms (e.g., AI Transaction Scoring Tool, Clara AI, KPMG Clara), the move from sampling to full-population analysis, client benefits, required auditor competencies, and implementation challenges including data security and regulation.",
        "bullets": [
          "AI tools automate repeatable audit tasks and enable analysis of full populations rather than samples.",
          "KPMG Clara and Clara AI (conversational assistants and specialized agents) support real-time management and client communication.",
          "AI aids documentation and analysis of disclosures to improve audit quality.",
          "Adoption changes the auditor’s role and requires new competencies and adaptation.",
          "Implementation challenges include data security, regulatory environment and potential AI-related risks."
        ],
        "takeaways": [
          "Expect audits to increasingly rely on full-population analysis—ensure your data is complete, consistent and accessible for analysis.",
          "Prepare to interact with real-time audit platforms (e.g., KPMG Clara) and modern client-auditor communication channels.",
          "Prioritize data security and regulatory compliance when sharing operational and financial datasets with auditors.",
          "Invest in internal skills and processes to support AI-enabled audit workflows and to interpret AI-driven findings."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMG",
          "KPMG Clara",
          "Clara AI",
          "AI Transaction Scoring",
          "audytorzy",
          "bezpieczeństwo danych",
          "innowacje",
          "automatyzacja"
        ]
      }
    },
    {
      "id": "t33Fh1JZVgA",
      "title": "AI at Speed: From Investment to Performance",
      "channel": "PwC US",
      "published_at": "2026-01-21T22:48:29.000Z",
      "url": "https://www.youtube.com/watch?v=t33Fh1JZVgA",
      "thumbnail": "https://i.ytimg.com/vi/t33Fh1JZVgA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… From Davos 2026, PwC US Senior Partner and CEO Paul Griggs speaks with CNBC’s Emma Crosby about organizations moving from AI exploration to execution and evaluating initiatives through investment discipline, performance, and measurable value. They note leaders are moving early, placing capital with intent, and designing operating models that remain resilient without sacrificing performance while delivering measurable outcomes today and enabling future transformation.",
        "bullets": [
          "AI is being evaluated by investment discipline, performance, and measurable value.",
          "Leading organizations are moving early and placing capital with intent.",
          "Operating models are being designed for resilience without sacrificing performance.",
          "AI is delivering measurable outcomes today.",
          "AI efforts are helping organizations transform and build for the future."
        ],
        "takeaways": [
          "Set clear performance metrics and ROI expectations for AI investments before committing capital.",
          "Allocate capital intentionally and early to AI initiatives aligned with operational priorities.",
          "Design operating models that balance resilience and performance for AI workloads.",
          "Prioritize measurable outcomes now while planning infrastructure and capacity to support longer-term transformation."
        ],
        "tags": [
          "AI",
          "investment",
          "performance",
          "operating models",
          "resilience",
          "Davos2026",
          "PwC",
          "measurable outcomes",
          "capital allocation",
          "digital transformation"
        ]
      }
    },
    {
      "id": "6hu7hYLiu08",
      "title": "Get Step-By-Step Fixes with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-21T20:14:00.000Z",
      "url": "https://www.youtube.com/watch?v=6hu7hYLiu08",
      "thumbnail": "https://i.ytimg.com/vi/6hu7hYLiu08/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Copilot provides real-time visual assistance for home projects and repairs. It can see what you see and deliver step-by-step instructions and clear guidance for issues like leaky pipes or overflowing washing machines.",
        "bullets": [
          "Real-time support for home projects and repairs",
          "Visual understanding: Copilot can 'see' what you see",
          "Delivers step-by-step instructions",
          "Examples include leaky pipes and overflowing washing machines",
          "Focus on clear, actionable guidance"
        ],
        "takeaways": [
          "If applied to data center operations, the described ability to view a technician's environment and provide step-by-step instructions could support on-site troubleshooting and reduce reliance on specialist dispatch.",
          "Real-time visual guidance (as described) may help standardize repair steps and accelerate resolution of routine equipment issues.",
          "The step-by-step instruction model could be leveraged for remote mentoring and to guide less-experienced staff during maintenance tasks.",
          "Decision-makers should consider whether integrating such visual-assist capabilities aligns with operational workflows, security requirements, and support processes."
        ],
        "tags": [
          "Copilot",
          "Microsoft Copilot",
          "home repair",
          "real-time support",
          "visual assistance",
          "step-by-step",
          "DIY",
          "remote assistance"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer - Launching January 22!",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Arknights: Endfield is launching worldwide on January 22 as a 3D real-time strategy RPG where players act as the Endministrator exploring Talos-II. The trailer emphasizes NVIDIA DLSS 4 with Multi Frame Generation and was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 MFG 4X mode.",
        "bullets": [
          "Worldwide release date: January 22.",
          "Game genre: 3D real-time strategy RPG; player role is the Endministrator of Endfield Industries on Talos-II.",
          "Trailer highlights NVIDIA DLSS 4 with Multi Frame Generation.",
          "Footage captured on GeForce RTX 5080 at 4K Ultra, DLSS 4 MFG 4X mode.",
          "Official links and social channels for Arknights: Endfield and NVIDIA GeForce provided in the description."
        ],
        "takeaways": [
          "Adoption of DLSS 4 with Multi Frame Generation signals reliance on advanced GPU-accelerated AI upscaling features that require compatible GPU hardware and drivers.",
          "Marketing footage captured on an RTX 5080 at 4K Ultra implies use of latest‑generation GPUs for content creation and benchmarking.",
          "Launch and cross-platform promotion (YouTube, X, Instagram, TikTok, Facebook) may increase short-term demand for high-performance GPU resources for capture, streaming, and testing workflows."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "NVIDIA",
          "RTX5080",
          "4K",
          "MultiFrameGeneration",
          "RTxOn",
          "RealTimeStrategy",
          "RPG"
        ]
      }
    },
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video shows how Rate Insurance boosts agent efficiency using Agentforce and Gemini. It also points viewers to learn more about the Google Cloud and Salesforce partnership via the provided link.",
        "bullets": [
          "Demonstrates Rate Insurance improving agent efficiency with Agentforce and Gemini.",
          "References the Google Cloud and Salesforce partnership (link included).",
          "Published by the Google Cloud channel.",
          "Invites viewers to watch a practical example of these tools in action."
        ],
        "takeaways": [
          "Assess whether partnerships like Google Cloud + Salesforce can support or accelerate customer-facing solutions in your environment.",
          "Evaluate commercial solutions (Agentforce/Gemini) as potential avenues to improve frontline agent productivity.",
          "Use partner demo content as a starting point to gather requirements and engage stakeholders before committing to architecture changes.",
          "Consider the trade-offs of adopting integrated vendor solutions versus building custom tooling for operational efficiency."
        ],
        "tags": [
          "Rate Insurance",
          "Agentforce",
          "Gemini",
          "Google Cloud",
          "Salesforce",
          "agent efficiency",
          "partnership",
          "demo",
          "cloud"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Charly Stoever, 35, is a financial coach who lives rent-free in Portland by pet sitting full time. She has spent the last 18 months living out of two suitcases while earning about $60,000 a year; the story is part of CNBC Make It's Millennial Money series.",
        "bullets": [
          "Charly Stoever, 35, is a financial coach who pet sits full time to live rent-free in Portland.",
          "She has been living out of two suitcases for the past 18 months.",
          "Her pet-sitting approach brings in roughly $60,000 per year.",
          "This profile is part of CNBC Make It's Millennial Money series.",
          "Produced credits include Lauren Shamo (producer) and Ryan Ermey (reporter)."
        ],
        "takeaways": [
          "Profiles of nontraditional income strategies (rent-free living via pet sitting) highlight changing economic behaviors that may affect urban housing demand and local service patterns.",
          "Growing interest in alternative, cost-conscious lifestyles among younger demographics suggests organizations should consider flexible staffing and location policies when planning operations.",
          "Ongoing media coverage of these trends signals value in monitoring demographic and lifestyle shifts as inputs for long-term infrastructure and capacity planning."
        ],
        "tags": [
          "pet sitting",
          "rent-free",
          "Portland",
          "financial coach",
          "CNBC Make It",
          "Millennial Money",
          "travel",
          "minimalism",
          "side hustle",
          "$60,000"
        ]
      }
    },
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Dr. Anna Chacon, 39, is a Miami-based dermatologist who runs her own private practice. Her net worth is about $6 million, consisting of $3.2 million in investments, a $1.9 million home, and a $1.1 million office building.",
        "bullets": [
          "Dr. Anna Chacon is 39 and lives in Miami, FL.",
          "She is a dermatologist with her own private practice.",
          "Total reported net worth: approximately $6 million.",
          "$3.2 million of that is in investments.",
          "She also owns a $1.9 million home and a $1.1 million office building."
        ],
        "takeaways": [
          "Ownership of a commercial office building indicates on-site energy needs for medical practice operations.",
          "Private medical practices can represent stable, localized commercial demand for reliable power and backup systems.",
          "High property values reflect potentially higher real estate and energy costs in the service area.",
          "Investment-backed net worth suggests customers or tenants with disposable income, relevant for demand forecasting in affluent markets."
        ],
        "tags": [
          "dermatologist",
          "private practice",
          "net worth",
          "investments",
          "real estate",
          "Miami",
          "office building",
          "personal finance",
          "CNBC Make It"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this giant carbon dioxide bubble is presented as a new battery that can store 20 megawatts of energy. The description frames it as a response to fluctuating renewable generation and as a technology to help power the global shift to clean energy.",
        "bullets": [
          "Giant carbon dioxide \"bubble\" functions as an energy storage device.",
          "Stores 20 megawatts of energy according to the description.",
          "Intended to address fluctuations in renewable energy supply.",
          "Presented as a technology to support the global transition to clean energy."
        ],
        "takeaways": [
          "20 MW storage capacity is a notable scale to consider for grid-level or large-site needs.",
          "Designed to mitigate renewable intermittency, making it relevant for balancing variable generation.",
          "Positioned as a tool for enabling clean-energy transitions—worth monitoring for planners and procurement teams.",
          "May complement existing storage options when evaluating strategies to integrate more renewables."
        ],
        "tags": [
          "ieee",
          "tech",
          "ieeespectrum",
          "innovation",
          "future",
          "energy",
          "battery",
          "CO2",
          "storage",
          "renewables"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… KPMG ON AIR episode with Monika Palmowska and Jakub Roszkiewicz examines how AI is already changing transfer pricing work — from monitoring rentowności and benchmarking to automating documentation — and argues that AI will augment rather than replace tax advisors. The discussion covers practical implementation steps, integration with ERP and secure environments like Digital Gateway, plus risks such as data security, RODO and hallucinations.",
        "bullets": [
          "AI use cases: monitoring profitability, comparative analyses and automation of transfer pricing documentation.",
          "AI should strengthen advisors' work and support junior staff development, not replace experts.",
          "Key risks: data protection, security, RODO and AI hallucinations; secure environments (Digital Gateway) are highlighted.",
          "Implementation advice: integrate AI with ERP and intelligent benchmarks; start by organizing processes.",
          "Podcast walks through personas, why now, examples, risks, first implementation steps and pillars of AI adoption."
        ],
        "takeaways": [
          "Prioritize data protection and GDPR (RODO) compliance when deploying AI workloads, and consider secure environments like Digital Gateway.",
          "Ensure ERP integration and availability of clean, structured data—organizing processes first is presented as a foundation for successful AI adoption.",
          "Treat AI as a tool to augment expert workflows and benchmarking capabilities rather than a full replacement for tax specialists.",
          "Address operational risks (security, hallucinations) in plans for AI-driven analytics and documentation automation."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "transfer pricing",
          "automatyzacja",
          "RODO",
          "Digital Gateway",
          "ERP",
          "benchmarki",
          "KPMG",
          "podatki"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video promotes using Microsoft Copilot to keep momentum by stacking small wins across workouts, projects, and personal goals. It emphasizes steady progress and sustained motivation with Copilot as the enabling tool.",
        "bullets": [
          "Encourages stacking small wins to maintain momentum.",
          "Applies to workouts, projects, and personal goals.",
          "Positions Microsoft Copilot as a support for steady progress.",
          "Focuses on sustaining motivation through incremental progress."
        ],
        "takeaways": [
          "Break large data center or grid initiatives into smaller tasks and use Copilot to keep steady momentum.",
          "Apply Copilot to ongoing operational or upgrade projects to make continuous progress visible.",
          "Use incremental wins to maintain team engagement and reduce project fatigue during long deployments.",
          "Treat Copilot as a tool to support consistent, repeatable progress toward strategic infrastructure goals."
        ],
        "tags": [
          "Microsoft Copilot",
          "productivity",
          "momentum",
          "small wins",
          "projects",
          "personal goals",
          "workouts",
          "motivation"
        ]
      }
    }
  ]
}