{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-26T17:50:51.472Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "wCJ_O97ww-k",
      "title": "World 1-3: Lens of Truth Obtained – Detective Controls Unlocked",
      "channel": "AWS Events",
      "published_at": "2026-01-26T17:44:20.000Z",
      "url": "https://www.youtube.com/watch?v=wCJ_O97ww-k",
      "thumbnail": "https://i.ytimg.com/vi/wCJ_O97ww-k/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this episode of PTD Today is a weekly deep dive into cloud security hosted by Russ Noll and Tristan Watty Ph.D., airing Mondays at 11am PST. Using the \"Lens of Truth\" metaphor, the show explains how to deploy AWS detective controls to reveal hidden threats and improve visibility across cloud environments.",
        "bullets": [
          "Weekly cloud security deep dive with hosts Russ Noll and Tristan Watty Ph.D.",
          "Episode framed around the \"Lens of Truth\" metaphor for revealing hidden threats and passages",
          "Focus on deploying AWS detective controls to illuminate the cloud environment",
          "Aim to make the invisible visible and transform security posture",
          "One-hour episodes airing Mondays at 11am PST"
        ],
        "takeaways": [
          "Deploying AWS detective controls provides visibility into hidden or invisible threats that preventive measures may miss",
          "Improved detection visibility enables faster response and lowers operational risk to critical infrastructure",
          "Detective controls complement preventive controls to create a more comprehensive security posture",
          "Regular technical-to-business discussions help decision-makers align security implementations with practical business needs"
        ],
        "tags": [
          "cloud security",
          "AWS detective controls",
          "visibility",
          "threat detection",
          "cloud monitoring",
          "security posture",
          "Russ Noll",
          "Tristan Watty",
          "PTD Today",
          "AWS Events"
        ]
      }
    },
    {
      "id": "9vS5kvxbPMQ",
      "title": "My Porta-Potty Business Brings In $4.3M/Year",
      "channel": "CNBC Make It",
      "published_at": "2026-01-24T15:00:30.000Z",
      "url": "https://www.youtube.com/watch?v=9vS5kvxbPMQ",
      "thumbnail": "https://i.ytimg.com/vi/9vS5kvxbPMQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Daniel Tom, 31, owns Bay Area Sanitation, which operates nearly 2,000 portable toilets serving construction sites and events across the San Francisco Bay Area. The company reported $4.3 million in total income in 2025 and is the subject of a CNBC Make It piece.",
        "bullets": [
          "Owner: Daniel Tom, 31, founder/operator of Bay Area Sanitation.",
          "Fleet: Almost 2,000 portable toilets in service.",
          "Service area: Construction sites and events across the San Francisco Bay Area.",
          "Financials: $4.3 million in total income in 2025.",
          "Source: CNBC Make It video (no transcript available)."
        ],
        "takeaways": [
          "The Bay Area supports multi-million-dollar, physically intensive service businesses—consider local service-sector scale when evaluating regional demand.",
          "Large fleets (nearly 2,000 units) indicate significant operational logistics and recurring service needs in the area.",
          "Construction and event markets can produce steady revenue streams for on-site services; factor such industry activity into regional capacity and planning assessments."
        ],
        "tags": [
          "CNBCMakeIt",
          "HowIMadeIt",
          "DanielTom",
          "portabletoilets",
          "sanitation",
          "BayArea",
          "smallbusiness",
          "2025revenue"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights Jo discovering the power of Copilot Groups and how they make route planning easy. It positions Copilot Groups as a tool for simplifying route-planning tasks.",
        "bullets": [
          "Focuses on route planning made easy.",
          "Features Copilot Groups as the central capability.",
          "Centers on Jo discovering the value of the feature.",
          "Includes tags: #copilot, #microsoftcopilot, #ai."
        ],
        "takeaways": [
          "Copilot Groups are presented as a means to simplify route planning—relevant for operations and logistics teams.",
          "Decision-makers should consider evaluating Copilot Groups for route coordination or planning workflows.",
          "A short demo-focused format suggests the feature is shown in a practical, user-facing scenario worth reviewing for applicability."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "copilot-groups",
          "route-planning",
          "logistics",
          "productivity",
          "demo"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI w audycie to już codzienność: wspiera powtarzalne czynności, analizę dużych zbiorów danych i wspomaga podejmowanie decyzji. W podcaście przedstawiono praktyczne zastosowania (np. AI Transaction Scoring, Clara AI, platforma KPMG Clara), wpływ na rolę audytora oraz wyzwania związane z bezpieczeństwem danych i regulacjami.",
        "bullets": [
          "AI Transaction Scoring umożliwia analizę pełnych populacji zamiast próbkowania.",
          "Clara AI działa jako konwersacyjny asystent i zestaw wyspecjalizowanych agentów.",
          "KPMG Clara zapewnia zarządzanie badaniem w czasie rzeczywistym i nowoczesną komunikację z klientem.",
          "AI wspiera dokumentację, analizę ujawnień i przyspiesza proces audytu.",
          "Wdrożenie AI wymaga adaptacji kompetencji audytorów oraz uwzględnienia bezpieczeństwa danych i regulacji."
        ],
        "takeaways": [
          "Pełnopopulacyjne analizy oznaczają bardziej szczegółowe i kompleksowe wyniki audytowe dla infrastruktury (np. centra danych).",
          "Platformy do zarządzania audytem w czasie rzeczywistym mogą przyspieszyć komunikację i reakcję na problemy operacyjne.",
          "Przekazywanie danych do narzędzi AI wymaga silnych zabezpieczeń i zgodności z regulacjami — priorytet dla operatorów gridów/centów danych.",
          "Zmiana z próbkowania na analizę pełnych danych może ujawnić nowe ryzyka i optymalizacje operacyjne.",
          "Współpraca z audytorami posiadającymi kompetencje AI ułatwi wdrażanie technologii i interpretuje wyniki w kontekście operacyjnym."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMG",
          "KPMG Clara",
          "Clara AI",
          "innowacje",
          "bezpieczeństwo danych",
          "podcast"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Arknights: Endfield has officially launched and the trailer highlights NVIDIA DLSS 4 with Multi Frame Generation. The 3D real-time strategy RPG footage was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 Multi Frame Generation 4X Mode.",
        "bullets": [
          "Arknights: Endfield launch trailer emphasizes NVIDIA DLSS 4 with Multi Frame Generation.",
          "Game is a 3D real-time strategy RPG set on Talos-II where you play the Endministrator.",
          "Trailer capture: GeForce RTX 5080, 4K Ultra settings, DLSS 4 Multi Frame Generation 4X Mode.",
          "Links provided for DLSS 4 details, the official game site, and social channels.",
          "Includes hashtags: #ArknightsEndfield, #RTXOn, #DLSS4."
        ],
        "takeaways": [
          "DLSS 4 Multi Frame Generation is being used in real-time 4K captures—evaluate GPU inference/AI capabilities when provisioning hardware.",
          "Trailer capture on an RTX 5080 highlights potential high GPU compute needs for 4K Ultra rendering workflows; factor this into capacity planning.",
          "Ensure cluster/driver support for DLSS 4 and Multi Frame Generation SDKs if supporting development, benchmarking, or remote/rendering services.",
          "Benchmark representative workloads on RTX 5080-class hardware to inform procurement and performance expectations."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "NVIDIA",
          "GeForce",
          "RTX5080",
          "4K",
          "Gaming",
          "Trailer"
        ]
      }
    }
  ]
}