{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-21T21:51:11.767Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "6hu7hYLiu08",
      "title": "Get Step-By-Step Fixes with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-21T20:14:00.000Z",
      "url": "https://www.youtube.com/watch?v=6hu7hYLiu08",
      "thumbnail": "https://i.ytimg.com/vi/6hu7hYLiu08/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Copilot provides real-time visual support for home projects and repairs by seeing what you see and offering step-by-step instructions. It delivers clear guidance for common issues such as leaky pipes and overflowing washing machines.",
        "bullets": [
          "Real-time support for home projects and repairs",
          "Copilot can see what you see (visual input)",
          "Provides step-by-step instructions",
          "Aims to give clear guidance for common household issues",
          "Examples: leaky pipes and overflowing washing machines"
        ],
        "takeaways": [
          "Real-time visual, step-by-step guidance could be considered for field technician support to speed on-site troubleshooting",
          "May help reduce the need for remote guidance or repeated site visits by providing clearer instructions during inspections",
          "Could improve first-time-fix rates for routine hardware or appliance issues by giving technicians guided steps",
          "Worth evaluating for integration into maintenance workflows where visual diagnostics and clear repair steps are valuable"
        ],
        "tags": [
          "Copilot",
          "real-time support",
          "visual assistance",
          "step-by-step",
          "home repairs",
          "troubleshooting",
          "appliance repair",
          "DIY",
          "Microsoft",
          "remote guidance"
        ]
      }
    },
    {
      "id": "IKkVWKdumHw",
      "title": "re:Invent 2025 - Chalk Talk - Origin management for multi-region applications with Amazon CloudFront",
      "channel": "AWS Events",
      "published_at": "2026-01-21T17:49:36.000Z",
      "url": "https://www.youtube.com/watch?v=IKkVWKdumHw",
      "thumbnail": "https://i.ytimg.com/vi/IKkVWKdumHw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this session covers comprehensive origin management with Amazon CloudFront to build secure, resilient content delivery systems. It explains automatic failover with CloudFront and Route 53, granular origin routing with CloudFront Functions, origin security using S3 Origin Access Control and VPC private origins, hybrid integration via AWS Direct Connect, and using Origin Shield to optimize cache performance and reduce origin load.",
        "bullets": [
          "Automatic failover patterns using CloudFront together with Route 53",
          "Granular origin routing implemented via CloudFront Functions",
          "Securing origins with S3 Origin Access Control (OAC) and VPC private origins",
          "Integrating on-premises infrastructure through AWS Direct Connect for hybrid setups",
          "Deploying Origin Shield to optimize caching and lower origin load"
        ],
        "takeaways": [
          "Increased delivery resilience: automatic failover options reduce outage risk for distributed services",
          "Stronger origin security: OAC and VPC private origins help protect backend assets from direct exposure",
          "Better traffic control: CloudFront Functions enable fine-grained routing decisions at the CDN edge",
          "Hybrid readiness: Direct Connect integration supports on‑prem to cloud architectures without rearchitecting content flow",
          "Lower origin strain and cost potential: Origin Shield can centralize cache hits and reduce backend load"
        ],
        "tags": [
          "CloudFront",
          "Origin Management",
          "Origin Shield",
          "Route53",
          "CloudFront Functions",
          "Origin Access Control",
          "VPC Private Origins",
          "AWS Direct Connect",
          "Hybrid Architecture",
          "Content Delivery"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer - Launching January 22!",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield launches worldwide on January 22 and the trailer spotlights NVIDIA DLSS 4 with Multi Frame Generation. The game is a 3D real-time strategy RPG where you play the Endministrator exploring Talos-II; the trailer was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 Multi Frame Generation 4X Mode.",
        "bullets": [
          "Worldwide release date: January 22.",
          "Trailer features NVIDIA DLSS 4 with Multi Frame Generation (link provided).",
          "Genre: 3D real-time strategy RPG; player role is the Endministrator on Talos-II.",
          "Captured on GeForce RTX 5080 at 4K Ultra Settings, DLSS 4 Multi Frame Generation 4X Mode.",
          "Official site and social channels listed for more information."
        ],
        "takeaways": [
          "Trailer explicitly uses DLSS 4 with Multi Frame Generation — plan for testing/support of DLSS 4 in GPU fleets and development pipelines if integrating or showcasing the title.",
          "Captured on an RTX 5080 at 4K Ultra — content creation, QA, and capture workflows referenced here rely on high-performance RTX 50-series GPUs and 4K-capable encoding/decoding resources.",
          "Worldwide launch implies coordination for distribution and releases — review CDN, storage, and build/QA provisioning ahead of the January 22 release.",
          "If supporting developer or marketing workloads for this title, validate drivers, SDKs, and DLSS 4 compatibility on target hardware."
        ],
        "tags": [
          "Arknights",
          "Endfield",
          "DLSS4",
          "NVIDIA",
          "RTX5080",
          "4K",
          "MultiFrameGeneration",
          "GameRelease",
          "GeForce"
        ]
      }
    },
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this Google Cloud video shows how Rate Insurance boosts agent efficiency using Agentforce and Gemini. The description also includes a link to learn more about the Google Cloud and Salesforce partnership.",
        "bullets": [
          "Video showcases Rate Insurance improving agent efficiency with Agentforce and Gemini.",
          "Published by Google Cloud (no transcript available).",
          "Description links to Google Cloud and Salesforce partnership details: https://goo.gle/3NSZrJS",
          "Focus is on a vendor-produced case/example rather than a full transcript of content."
        ],
        "takeaways": [
          "Demonstrates a concrete example of an insurance company using Agentforce and Gemini to address agent efficiency.",
          "Includes a vendor partnership reference (Google Cloud + Salesforce) useful for sourcing collaboration details.",
          "Content is produced by Google Cloud, making it a vendor case resource rather than an independent analysis."
        ],
        "tags": [
          "Rate Insurance",
          "Agentforce",
          "Gemini",
          "Google Cloud",
          "Salesforce",
          "agent efficiency",
          "insurance",
          "cloud",
          "AI",
          "partnership"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Charly Stoever, 35, is a financial coach who has spent the last 18 months living out of two suitcases and traveling while pet sitting full time to live rent-free in Portland, Oregon. She brings in about $60,000 a year; the story is part of CNBC Make It's Millennial Money series.",
        "bullets": [
          "Charly Stoever, 35, is a financial coach.",
          "She pet sits full time and lives rent-free in Portland, Oregon.",
          "Has lived out of two suitcases for the past 18 months while traveling.",
          "Earns approximately $60,000 per year from this arrangement.",
          "Feature is part of CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "Full-time pet sitting can be a sustainable, income-generating strategy (about $60k/year in this case).",
          "This approach enabled rent-free living and a highly mobile lifestyle over an extended period (18 months).",
          "The story highlights a nontraditional, location-flexible income model pursued by a millennial professional."
        ],
        "tags": [
          "pet sitting",
          "rent-free",
          "financial coach",
          "Portland",
          "CNBC Make It",
          "Millennial Money",
          "travel",
          "minimalist lifestyle"
        ]
      }
    },
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Dr. Anna Chacon is a 39-year-old dermatologist in Miami who runs her own private practice and earns $900,000 a year. Her reported net worth is about $6 million, made up of $3.2 million in investments, a $1.9 million home, and a $1.1 million office building.",
        "bullets": [
          "Dr. Anna Chacon, age 39, is a Miami-based dermatologist with a private practice.",
          "Annual earnings cited: $900,000.",
          "Total net worth reported: roughly $6 million.",
          "Net worth breakdown: $3.2M investments, $1.9M home, $1.1M office building.",
          "Video published by CNBC Make It on 2026-01-19."
        ],
        "takeaways": [
          "Private medical practices that own their office buildings (as described) are commercial customers that can represent local demand on the grid.",
          "Profiles combining high personal income and owner-occupied commercial real estate indicate customer segments that may prioritize reliable power for business continuity.",
          "Concentration of such practices in a city like Miami should be considered when assessing localized commercial load and resilience needs.",
          "Healthcare office properties documented in profiles can be relevant targets for services related to backup power, redundancy, or dedicated infrastructure planning."
        ],
        "tags": [
          "dermatologist",
          "personal finance",
          "net worth",
          "Miami",
          "private practice",
          "real estate",
          "CNBC Make It",
          "physician income",
          "commercial property",
          "investments"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this IEEE Spectrum item highlights a giant carbon dioxide bubble battery that can store 20 megawatts of power and provide about eight hours of energy. The description positions the technology as a way to smooth fluctuating renewable generation and help drive a global shift to clean energy.",
        "bullets": [
          "Giant bubble of carbon dioxide used as an energy storage battery",
          "Described capacity: 20 megawatts and roughly 8 hours of energy",
          "Aimed at addressing variability in renewable energy supply",
          "Presented as supporting the transition to clean energy worldwide"
        ],
        "takeaways": [
          "Can offer multi-hour backup or load-shifting capability at a 20 MW scale—useful for planning reserve capacity",
          "Helps smooth renewable intermittency, aiding integration of wind/solar into grids or data center power mixes",
          "Potential option to consider when evaluating multi-hour storage solutions for resilience and decarbonization goals"
        ],
        "tags": [
          "CO2 battery",
          "carbon dioxide",
          "energy storage",
          "20MW",
          "8 hours",
          "renewable integration",
          "grid storage",
          "clean energy",
          "IEEE Spectrum"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI już teraz zmienia podejście do cen transferowych — od monitorowania rentowności i analiz porównawczych po automatyzację dokumentacji. W podcaście KPMG ON AIR eksperci Monika Palmowska i Jakub Roszkiewicz omawiają praktyczne zastosowania AI, jej rolę obok doradców podatkowych, ryzyka (dane, bezpieczeństwo, RODO, halucynacje) oraz kroki wdrożeniowe, w tym integrację z ERP i bezpieczne środowiska jak Digital Gateway.",
        "bullets": [
          "Przykłady zastosowań: monitoring rentowności, analizy porównawcze, automatyzacja dokumentacji cen transferowych.",
          "AI ma wzmacniać pracę doradców, wspierać rozwój kompetencji młodszych pracowników — nie zastępować ekspertów.",
          "Kluczowe ryzyka: bezpieczeństwo danych, zgodność z RODO oraz problem halucynacji modeli AI.",
          "Rozwiązania bezpieczne: Digital Gateway jako środowisko do pracy z AI; istotna integracja z systemami ERP i inteligentnymi benchmarkami.",
          "Wdrożenie: zacząć od uporządkowania procesów i realizacji pierwszych kroków wg filarów transformacji."
        ],
        "takeaways": [
          "Zapewnij bezpieczne, zgodne z RODO środowisko do uruchamiania modeli AI (np. rozwiązania typu Digital Gateway) przed przetwarzaniem danych cen transferowych.",
          "Planuj integrację AI z ERP i istniejącymi systemami — przygotuj dane, interfejsy i przepływy, by AI mogła generować wiarygodne benchmarki i analizy.",
          "Oceń potrzeby infrastrukturalne (przechowywanie, przetwarzanie, skalowalność) związane z automatyzacją dokumentacji i analiz AI.",
          "Wdrożenie wymaga silnej kontroli dostępu i governance danych, aby minimalizować ryzyka związane z bezpieczeństwem i błędami modelu (halucynacje)."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "transfer pricing",
          "podatki",
          "KPMG",
          "Digital Gateway",
          "ERP integration",
          "RODO",
          "bezpieczeństwo danych"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Copilot is presented as a tool to help you keep momentum by stacking small wins across workouts, projects, and personal goals. The message emphasizes sustaining progress and using Copilot to support ongoing effort.",
        "bullets": [
          "Focuses on maintaining momentum through incremental progress.",
          "Applies to workouts, projects, and personal goals.",
          "Positions Copilot as a companion for steady progress.",
          "Encourages stacking small wins rather than aiming for single large leaps."
        ],
        "takeaways": [
          "Break large initiatives (e.g., deployments, upgrades) into small, trackable tasks to sustain momentum.",
          "Use Copilot to help teams maintain steady progress during long projects, reducing risk of stalls.",
          "Leverage Copilot-driven checklists or prompts to standardize routine operations and preserve continuity."
        ],
        "tags": [
          "Microsoft Copilot",
          "productivity",
          "momentum",
          "small wins",
          "projects",
          "goals",
          "task management",
          "workflow",
          "motivation"
        ]
      }
    }
  ]
}