{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-22T21:44:34.696Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, KPMG's podcast episode discusses practical uses of AI in audit, showing that AI tools are already embedded in everyday audit work to handle repetitive tasks and large-scale data analysis. The speakers outline specific solutions (like AI Transaction Scoring and Clara AI), the shift from sampling to full-population analysis, impacts on auditor roles and required skills, and implementation challenges including data security and regulation.",
        "bullets": [
          "AI is now part of routine audit work, aiding repetitive tasks and large-data analysis.",
          "AI Transaction Scoring enables analysis of full populations rather than samples.",
          "Clara AI provides conversational assistance and specialized agents; KPMG Clara manages audits in real time and Clara for Clients modernizes client communication.",
          "Technology is shifting auditors' roles and skills; focus on adaptation and training is required.",
          "Key implementation issues include data security, regulatory environment, and potential AI-related risks."
        ],
        "takeaways": [
          "Ensure high-quality, accessible transactional data to enable full-population AI analysis during audits.",
          "Prepare for more continuous, real-time audit interactions by integrating systems with audit platforms and client-facing tools.",
          "Prioritize data security and regulatory compliance when sharing operational data with auditors and AI tools.",
          "Invest in staff training to support AI-assisted audit processes and handle exception reviews that require human judgment."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMG",
          "KPMG Clara",
          "Clara AI",
          "analiza pełnych populacji",
          "bezpieczeństwo danych",
          "innowacje"
        ]
      }
    },
    {
      "id": "6hu7hYLiu08",
      "title": "Get Step-By-Step Fixes with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-21T20:14:00.000Z",
      "url": "https://www.youtube.com/watch?v=6hu7hYLiu08",
      "thumbnail": "https://i.ytimg.com/vi/6hu7hYLiu08/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Copilot provides real-time support for home projects and repairs by seeing what you see and offering clear, step-by-step instructions. Examples given include help for leaky pipes and overflowing washing machines.",
        "bullets": [
          "Real-time support for hands-on repairs and projects",
          "Visual understanding—Copilot can 'see what you see'",
          "Provides step-by-step instructions and clear guidance",
          "Examples include plumbing (leaky pipes) and appliance issues (overflowing washing machines)",
          "Designed to assist users through repair tasks, in the moment"
        ],
        "takeaways": [
          "Based on these capabilities (real-time visual support + step-by-step guidance), Copilot could be applied to on-site troubleshooting for facilities and data center technicians.",
          "May reduce the need for specialist dispatches by enabling remote guidance to less-experienced staff during repairs.",
          "Could speed routine maintenance and incident response by delivering clear, actionable instructions at the point of work.",
          "Offers potential for improving field training and standardizing repair procedures through guided, visual assistance."
        ],
        "tags": [
          "Copilot",
          "Microsoft Copilot",
          "real-time support",
          "visual assistance",
          "step-by-step instructions",
          "home repairs",
          "maintenance",
          "troubleshooting",
          "remote assistance",
          "repair guidance"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield has officially launched and features NVIDIA DLSS 4 with Multi Frame Generation. The game is a 3D real-time strategy RPG where players take the role of the Endministrator of Endfield Industries on Talos-II; the trailer was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 Multi Frame Generation 4X Mode.",
        "bullets": [
          "Arknights: Endfield officially launched and is a 3D real-time strategy RPG.",
          "The release features NVIDIA DLSS 4 with Multi Frame Generation.",
          "Players assume the role of the Endministrator of Endfield Industries on Talos-II.",
          "Trailer footage was captured on a GeForce RTX 5080 at 4K Ultra with DLSS 4 MFG 4X Mode.",
          "Description includes links to the game site and official social channels."
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is being used in a shipped title—consider compatibility and support for DLSS 4 in GPU deployments.",
          "Trailer capture on an RTX 5080 at 4K Ultra highlights demand for high-end GPU capacity for 4K capture and streaming workflows.",
          "Official launch and promotion across social platforms may drive increased cloud gaming and streaming load requiring GPU-accelerated resources."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "RTX5080",
          "4K",
          "NVIDIA",
          "RTxon",
          "Gaming",
          "RealTimeStrategy"
        ]
      }
    },
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video shows how Rate Insurance boosts agent efficiency using Agentforce and Gemini. It also includes a link to learn more about the Google Cloud and Salesforce partnership.",
        "bullets": [
          "Highlights Rate Insurance improving agent efficiency with Agentforce and Gemini",
          "Provides a link to learn more about the Google Cloud and Salesforce partnership",
          "No transcript available (summary derived solely from the description)"
        ],
        "takeaways": [
          "Review the linked Google Cloud–Salesforce partnership page for authoritative details on the joint offerings mentioned in the video",
          "For organizations supporting insurance agent solutions, use the partnership resource as a starting point to understand vendor capabilities",
          "Treat the video as a product/solution showcase and consult the partnership link for technical or deployment specifics"
        ],
        "tags": [
          "Rate Insurance",
          "Agentforce",
          "Gemini",
          "Google Cloud",
          "Salesforce",
          "agent efficiency",
          "partnership",
          "insurance"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Charly Stoever, 35, is a financial coach who has spent the last 18 months living out of two suitcases and living rent-free in Portland, Oregon by pet sitting full time. She brings in about $60,000 a year doing this, and the story is featured in CNBC Make It's Millennial Money series.",
        "bullets": [
          "Lives rent-free in Portland by pet sitting full time",
          "Financial coach, age 35",
          "Has lived out of two suitcases for the past 18 months",
          "Earns roughly $60,000 per year from this arrangement",
          "Profiled in CNBC Make It's Millennial Money series"
        ],
        "takeaways": [
          "No direct relevance to grid or data center operations—story focuses on personal finance and lifestyle.",
          "Content highlights an alternative income-and-housing model rather than infrastructure or energy topics.",
          "Useful as consumer-lifestyle context for understanding demographic trends, but not as a basis for technical decisions.",
          "No operational or capacity actions for grid/data center planners are implied by the description."
        ],
        "tags": [
          "Pet Sitting",
          "Rent-Free Living",
          "Portland",
          "Financial Coach",
          "Millennial Money",
          "CNBC Make It",
          "60k Annual Income",
          "Two Suitcases"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This video describes a new carbon-dioxide “bubble” battery that can store 20 megawatts of power and provide about 8 hours of energy. It’s presented as a solution to manage renewable energy fluctuations and support the global shift to clean energy.",
        "bullets": [
          "Technology uses a giant bubble of carbon dioxide as an energy storage medium.",
          "Reported storage capacity: 20 megawatts.",
          "Reported duration: approximately 8 hours of energy.",
          "Aimed at addressing fluctuations in renewable energy supply.",
          "Positioned as a tool to help enable the transition to clean energy worldwide."
        ],
        "takeaways": [
          "A 20 MW, 8-hour storage system can offer substantial bulk backup and load-shifting capacity for grids and large facilities.",
          "Such storage could help smooth intermittent renewable generation and reduce short-term reliability risks.",
          "Facilities planning resilience or renewable integration should track this storage approach as a potential option for multi-hour capacity needs."
        ],
        "tags": [
          "co2-battery",
          "carbon-dioxide",
          "energy-storage",
          "renewables",
          "battery",
          "ieee",
          "innovation",
          "clean-energy"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Eksperci KPMG (Monika Palmowska i Jakub Roszkiewicz) omawiają, jak AI już wpływa na obszar cen transferowych — od monitorowania rentowności i benchmarków po automatyzację dokumentacji — oraz jak technologia ta może wspierać doradców podatkowych, a nie ich zastąpić. W podcaście poruszono też kwestie wdrożeniowe: integrację z ERP, ryzyka związane z danymi/bezpieczeństwem (RODO, halucynacje) oraz konieczność uporządkowania procesów i korzystania z bezpiecznych środowisk (np. Digital Gateway).",
        "bullets": [
          "AI stosowana jest do monitorowania rentowności, analiz porównawczych i automatyzacji dokumentacji cen transferowych.",
          "Technologia ma wzmocnić pracę doradców podatkowych, nie zastąpić ich; wspiera rozwój kompetencji młodszych pracowników.",
          "Wskazano kluczowe ryzyka: ochrona danych, bezpieczeństwo i problem halucynacji modelów (RODO i zgodność).",
          "Rozwiązaniem są bezpieczne środowiska pracy z AI (Digital Gateway) oraz integracja z ERP i inteligentnymi benchmarkami.",
          "Rekomendowane pierwsze kroki to uporządkowanie procesów jako fundament transformacji i realizacja filarów wdrożenia AI."
        ],
        "takeaways": [
          "Rozważ wykorzystanie AI do monitorowania rentowności i benchmarków wewnętrznych usług (np. rozliczenia międzyoddziałowe).",
          "Priorytetem jest governance danych i bezpieczeństwo — uwzględnij zgodność z RODO i rozważ bezpieczne środowiska (Digital Gateway).",
          "Planuj integrację AI z istniejącym ERP i systemami billingowymi, aby uzyskać inteligentne benchmarki i automatyzację dokumentacji.",
          "Zanim wdrożysz AI, uporządkuj i udokumentuj procesy operacyjne — to kluczowa podstawa dla bezpiecznej i efektywnej transformacji."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "transfer pricing",
          "KPMG",
          "podatki",
          "automatyzacja",
          "RODO",
          "ERP",
          "Digital Gateway",
          "compliance"
        ]
      }
    }
  ]
}