{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-26T09:54:20.244Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "9vS5kvxbPMQ",
      "title": "My Porta-Potty Business Brings In $4.3M/Year",
      "channel": "CNBC Make It",
      "published_at": "2026-01-24T15:00:30.000Z",
      "url": "https://www.youtube.com/watch?v=9vS5kvxbPMQ",
      "thumbnail": "https://i.ytimg.com/vi/9vS5kvxbPMQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Daniel Tom, 31, owns Bay Area Sanitation, which operates nearly 2,000 portable toilets servicing construction sites and events across the San Francisco Bay Area. The company reported $4.3 million in total income in 2025.",
        "bullets": [
          "Owner: Daniel Tom, 31",
          "Company: Bay Area Sanitation",
          "Fleet: almost 2,000 portable toilets",
          "Service area: San Francisco Bay Area (construction sites and events)",
          "2025 income: $4.3 million"
        ],
        "takeaways": [
          "Regional sanitation providers can operate at scale—Bay Area Sanitation runs ~2,000 units, relevant when planning large builds or events.",
          "A dedicated operator reported multi-million-dollar income in 2025, indicating established market demand and operational capacity.",
          "For project planning, factor in coordination and logistics with fleet-based sanitation vendors serving construction sites and events.",
          "Budgeting for temporary sanitation should account for established providers' scale and service coverage in the Bay Area."
        ],
        "tags": [
          "Bay Area Sanitation",
          "portable toilets",
          "Daniel Tom",
          "sanitation",
          "construction sites",
          "events",
          "revenue $4.3M",
          "CNBC Make It"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the short Microsoft Copilot video shows Jo discovering the power of Copilot Groups and how they make route planning easy. The description emphasizes Copilot and AI with hashtags #copilot, #microsoftcopilot, and #ai.",
        "bullets": [
          "No transcript available; summary relies on the video description.",
          "Primary focus: route planning made easy.",
          "Feature highlighted: Copilot Groups.",
          "Protagonist: Jo discovers the capability.",
          "Keywords/tags included: #copilot, #microsoftcopilot, #ai"
        ],
        "takeaways": [
          "Consider evaluating Copilot Groups as a potential tool for route-planning workflows.",
          "Explore whether AI-driven features from Microsoft Copilot align with operational routing and logistics needs.",
          "Assess integration and coordination benefits of group-based Copilot features for team workflows."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "route-planning",
          "copilot-groups",
          "productivity",
          "workflow",
          "navigation"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Ten odcinek podcastu KPMG ON AIR z Katarzyną Chojniak i Alicją Barską omawia praktyczne zastosowania AI w audycie — od narzędzi analizujących pełne populacje transakcji (AI Transaction Scoring Tool), przez konwersacyjnego asystenta Clara AI i wyspecjalizowanych agentów, po platformę KPMG Clara i Clara for Clients dla zarządzania badaniem i komunikacji z klientem. Rozmowa porusza też zmiany roli audytora, kluczowe kompetencje, wyzwania wdrożeniowe, bezpieczeństwo danych, aspekty regulacyjne oraz potencjalne zagrożenia i przyszłość AI w audycie.",
        "bullets": [
          "AI wspiera powtarzalne czynności, analizę dużych zbiorów danych i podejmowanie decyzji w audycie.",
          "AI Transaction Scoring Tool umożliwia analizę pełnych populacji transakcji zamiast tradycyjnego próbkowania.",
          "Clara AI działa jako konwersacyjny asystent oraz zestaw wyspecjalizowanych agentów wspierających audyt.",
          "Platforma KPMG Clara pozwala na zarządzanie badaniem w czasie rzeczywistym; Clara for Clients ułatwia komunikację z klientem.",
          "Omówione są też wyzwania wdrożeniowe, adaptacja audytorów, bezpieczeństwo danych, środowisko regulacyjne i potencjalne zagrożenia AI."
        ],
        "takeaways": [
          "Audyty mogą przechodzić z próbkowania do analiz pełnych populacji — oczekuj większego zakresu i innego rodzaju kontroli nad danymi.",
          "Wdrażane narzędzia (Clara, Clara AI) zwiększają rolę systemów do zarządzania badaniem i kanałów komunikacji z audytorem/firmą audytującą.",
          "Bezpieczeństwo danych i zgodność regulacyjna są kluczowe przy udostępnianiu danych do narzędzi AI — wymagane będą odpowiednie mechanizmy ochrony i polityki.",
          "Organizacje powinny uwzględnić potrzebę nowych kompetencji i współpracy z audytorami podczas adaptacji technologii AI."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMG",
          "KPMG Clara",
          "Clara AI",
          "AI Transaction Scoring",
          "innowacje",
          "bezpieczeństwo danych"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield has officially launched and the trailer highlights NVIDIA DLSS 4 with Multi Frame Generation. The footage was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 Multi Frame Generation 4X Mode, and the description includes links to the game site and social channels.",
        "bullets": [
          "Arknights: Endfield launch trailer showcases NVIDIA DLSS 4 with Multi Frame Generation.",
          "Game genre: 3D real-time strategy RPG where players act as the Endministrator of Endfield Industries.",
          "Trailer capture details: GeForce RTX 5080, 4K Ultra settings, DLSS 4 Multi Frame Generation 4X Mode.",
          "Description includes official links to learn more about the game and follow its social channels.",
          "NVIDIA GeForce channels and community portal are promoted for subscriptions and follow-up."
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is being used in a commercial game release—operations teams should note AI-driven frame generation as an emerging runtime workload.",
          "Trailer was captured on an RTX 5080 at 4K Ultra with MFG 4X mode—validate similar high‑resolution capture and rendering workflows on RTX 50‑series hardware if supporting such content pipelines.",
          "Supporting DLSS 4 workloads may influence GPU provisioning and testing requirements for high‑fidelity capture, streaming, or real‑time rendering tasks.",
          "Use the provided NVIDIA and game links for official technical details and any platform/driver requirements before deployment or procurement decisions."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "RTX5080",
          "4K",
          "NVIDIA",
          "GamingTrailer",
          "RealTimeRPG"
        ]
      }
    }
  ]
}