{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-27T14:56:54.231Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "azzmtqcIeCU",
      "title": "AWS Cost Efficiency Metrics I The Keys to AWS Optimization | S16 E2",
      "channel": "AWS Events",
      "published_at": "2026-01-27T10:14:44.000Z",
      "url": "https://www.youtube.com/watch?v=azzmtqcIeCU",
      "thumbnail": "https://i.ytimg.com/vi/azzmtqcIeCU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this livestream examines the key metrics that drive AWS cost efficiency, including cost per transaction, resource utilization rates, and ROI calculations. It explains how to measure, track, benchmark, and communicate cloud spending through metrics frameworks and dashboards to align technical performance with business outcomes.",
        "bullets": [
          "Covers essential KPIs: cost per transaction, resource utilization, and ROI.",
          "Shows how to measure, track, and benchmark cloud efficiency.",
          "Focuses on frameworks that link technical metrics to business value.",
          "Explains building dashboards to communicate cost optimization to stakeholders.",
          "Intended audience: cloud engineers, FinOps teams, and technical leaders."
        ],
        "takeaways": [
          "Use cost-per-transaction and ROI metrics to quantify the business impact of cloud workloads.",
          "Monitor resource utilization rates to identify right-sizing and efficiency opportunities.",
          "Benchmarking helps prioritize where optimization efforts will yield the most savings.",
          "Dashboards translating technical KPIs into business terms are critical for stakeholder buy-in."
        ],
        "tags": [
          "AWS",
          "FinOps",
          "CostOptimization",
          "CloudMetrics",
          "AWSCostManagement",
          "CloudEfficiency",
          "ROI",
          "ResourceUtilization",
          "Dashboards"
        ]
      }
    },
    {
      "id": "9vS5kvxbPMQ",
      "title": "My Porta-Potty Business Brings In $4.3M/Year",
      "channel": "CNBC Make It",
      "published_at": "2026-01-24T15:00:30.000Z",
      "url": "https://www.youtube.com/watch?v=9vS5kvxbPMQ",
      "thumbnail": "https://i.ytimg.com/vi/9vS5kvxbPMQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Daniel Tom, 31, owns Bay Area Sanitation, which operates a fleet of almost 2,000 portable toilets serving construction sites and events across the San Francisco Bay Area. The company reported $4.3 million in total income in 2025 and the piece was produced by CNBC Make It.",
        "bullets": [
          "Owner: Daniel Tom, 31",
          "Company: Bay Area Sanitation",
          "Fleet: almost 2,000 portable toilets",
          "Service area: construction sites and events across the San Francisco Bay Area",
          "2025 income: $4.3 million"
        ],
        "takeaways": [
          "Use the concrete metrics ( ~2,000 units; $4.3M 2025 income) as baseline data when assessing vendor scale and reliability.",
          "Regional footprint (San Francisco Bay Area) is relevant for location-specific contracting or site services.",
          "The company's focus on construction sites and events indicates capability to support temporary, mobile-site needs—useful when planning short-term deployments.",
          "Known company name and figures provide starting points for procurement, due diligence, and local service-network evaluations."
        ],
        "tags": [
          "Bay Area Sanitation",
          "Daniel Tom",
          "portable toilets",
          "sanitation",
          "San Francisco Bay Area",
          "small business",
          "revenue",
          "CNBC Make It"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video follows Jo discovering the power of Copilot Groups, with a focus on making route planning easy. It frames Copilot Groups as a tool for simplifying route planning and coordination.",
        "bullets": [
          "Focus: route planning made easy.",
          "Highlights: Copilot Groups as the featured capability.",
          "Character: Jo discovers/uses the feature.",
          "Tone: demonstrative/promo of Copilot functionality.",
          "Includes hashtags: #copilot #microsoftcopilot #ai"
        ],
        "takeaways": [
          "The video positions Copilot Groups as a route-planning capability worth noting.",
          "Grid/data center decision-makers should be aware of Copilot Groups when assessing routing or coordination tools.",
          "Consider monitoring Copilot Groups for potential integration into routing-related operational workflows."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "routeplanning",
          "copilotgroups",
          "navigation",
          "logistics",
          "productivity"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI w audycie to już codzienność; liderki KPMG omawiają praktyczne narzędzia, korzyści dla klientów i kluczowe kompetencje audytorów. Poruszają konkretne rozwiązania (AI Transaction Scoring Tool, Clara AI, KPMG Clara), przejście na analizę pełnych populacji, wyzwania wdrożeniowe, bezpieczeństwo danych i przyszłość AI w procesie badania.",
        "bullets": [
          "Wskazane narzędzia: AI Transaction Scoring Tool, Clara AI (asystent konwersacyjny i agenci) oraz platforma KPMG Clara.",
          "Przejście z próbkowania na analizę pełnych populacji dzięki AI i analizie dużych zbiorów danych.",
          "AI wspiera powtarzalne czynności, dokumentację, analizę ujawnień i podejmowanie decyzji audytowych.",
          "KPMG Clara umożliwia zarządzanie badaniem w czasie rzeczywistym i nowoczesną komunikację z klientem (Clara for Clients).",
          "Omówione wyzwania: adaptacja audytorów, bezpieczeństwo danych, środowisko regulacyjne oraz potencjalne zagrożenia związane z AI."
        ],
        "takeaways": [
          "Pełna analiza populacji zwiększa dokładność i wykrywalność niezgodności — warto przygotować dostępność i jakość danych do audytu.",
          "Platformy do zarządzania badaniem w czasie rzeczywistym poprawiają przejrzystość i tempo komunikacji z audytorem — integracja systemów może przyspieszyć procesy zgodności.",
          "Bezpieczeństwo danych i zgodność regulacyjna są kluczowe przy wdrażaniu AI — konieczne są silne kontrole dostępu i ocena dostawców.",
          "Konsekwencja wdrożeń AI wymaga podnoszenia kompetencji zespołów IT i finansowych, by efektywnie współpracować z audytorem i narzędziami AI.",
          "Ryzyka związane z AI wskazują na potrzebę nadzoru, governance i jasnych procedur testowania wyników generowanych przez narzędzia."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMG",
          "KPMG Clara",
          "Clara AI",
          "AI Transaction Scoring",
          "innowacje",
          "bezpieczeństwo danych",
          "compliance",
          "automatyzacja"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Arknights: Endfield has officially launched and features NVIDIA DLSS 4 with Multi Frame Generation. The 3D real-time strategy RPG was showcased captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 Multi Frame Generation 4X Mode.",
        "bullets": [
          "Official launch of Arknights: Endfield highlighting NVIDIA DLSS 4 with Multi Frame Generation.",
          "Game is a 3D real-time strategy RPG where you play the Endministrator exploring Talos-II.",
          "Trailer footage captured on GeForce RTX 5080 at 4K Ultra, DLSS 4 Multi Frame Generation 4X Mode.",
          "Description includes links to the game's site and NVIDIA's DLSS 4 announcement.",
          "Published by NVIDIA GeForce on 2026-01-21."
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is in consumer releases—plan to validate driver and software support for DLSS 4 in deployment environments.",
          "Demonstration used a GeForce RTX 5080 at 4K Ultra with 4X MFG—consider modern GPU capability when evaluating hardware for DLSS 4 workloads.",
          "Assets and technical details are linked from NVIDIA and the game site—use those sources for implementation specifics and testing."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "NVIDIA",
          "RTX5080",
          "MultiFrameGeneration",
          "4K",
          "GeForce",
          "RealTimeStrategy",
          "Gaming"
        ]
      }
    }
  ]
}