{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-19T13:20:44.449Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "6L86-OnOXV0",
      "title": "How I Built A $1M/Year Business - And Helped My Parents Retire",
      "channel": "CNBC Make It",
      "published_at": "2026-01-17T15:00:09.000Z",
      "url": "https://www.youtube.com/watch?v=6L86-OnOXV0",
      "thumbnail": "https://i.ytimg.com/vi/6L86-OnOXV0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Tuan Le emigrated from Vietnam to Toronto in 2015 and vowed at 15 to help his parents retire. Ten years later his social video production company, ShortsCut, generates over $1 million USD a year, and he now covers his parents' rent and living expenses so they no longer have to work full time.",
        "bullets": [
          "Tuan Le and his family emigrated from Vietnam to Toronto in 2015; he made a promise at age 15 to help his parents retire.",
          "His company, ShortsCut, is a social video production business generating over $1 million USD annually.",
          "He fulfills his promise by paying his parents' rent and living expenses so they no longer work full time.",
          "Video credits list production team members and additional footage sources (Produced & Edited by Zach Green; Reporter Kamaron McNair; additional footage: Tuan Le, Sanjay Singhal, Getty Images)."
        ],
        "takeaways": [
          "The scale of short-form video businesses underscores ongoing demand for scalable storage, bandwidth, and content delivery capacity.",
          "Seven-figure digital media revenues point to opportunities for reliable hosting and managed services targeting creators and production firms.",
          "Predictable, recurring content workloads favor infrastructure planning around capacity, SLAs, and cost-effective edge delivery.",
          "Supporting creator-focused customers can drive steady usage patterns—consider tailored pricing, reliability guarantees, and partnership models."
        ],
        "tags": [
          "Tuan Le",
          "ShortsCut",
          "CNBC Make It",
          "entrepreneurship",
          "immigrant entrepreneur",
          "social video",
          "$1M revenue",
          "Toronto",
          "family support",
          "video production"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, a giant bubble of carbon dioxide can store 20 megawatts of energy. The description presents these CO2-based batteries as a way to address renewable energy fluctuations and help power a global shift to clean energy.",
        "bullets": [
          "Giant bubble of carbon dioxide used as an energy storage medium",
          "Stores 20 megawatts of energy",
          "Addresses variability in renewable energy generation",
          "Framed as supporting the global transition to clean energy"
        ],
        "takeaways": [
          "A 20 MW CO2 storage system represents a utility-scale option to consider for balancing supply and demand",
          "Could help smooth intermittent renewable output and improve reliability for grids and large facilities",
          "Aligns with decarbonization goals by enabling greater renewable integration",
          "Decision-makers should investigate technical integration and applicability to peak-shaving or backup needs"
        ],
        "tags": [
          "ieee",
          "tech",
          "ieeespectrum",
          "innovation",
          "future",
          "futuristic",
          "energy",
          "battery"
        ]
      }
    },
    {
      "id": "OINppmPan0o",
      "title": "Figure Skating | Making Team USA presented by Xfinity with Apolo Ohno",
      "channel": "Team USA",
      "published_at": "2026-01-16T19:30:36.000Z",
      "url": "https://www.youtube.com/watch?v=OINppmPan0o",
      "thumbnail": "https://i.ytimg.com/vi/OINppmPan0o/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, figure skating duo Vadym Kolesnik and Emilia Zingas sit down with Apolo Ohno on an episode of Making Team USA presented by Xfinity ahead of the Winter Olympics. The episode is framed around the theme \"Built on trust.\"",
        "bullets": [
          "Features skaters Vadym Kolesnik and Emilia Zingas.",
          "Conversation with former Olympian Apolo Ohno.",
          "Released as part of Making Team USA presented by Xfinity.",
          "Timing: Ahead of the Winter Olympics.",
          "Theme highlighted: \"Built on trust.\""
        ],
        "takeaways": [
          "Emphasis on trust and teamwork can mirror the need for clear vendor and team reliability in grid/data center operations.",
          "Preparing for a major event (the Olympics) underscores the value of advance planning and capacity readiness.",
          "Partnership visibility (a sponsor like Xfinity) highlights how strategic collaborations support large-scale initiatives and resilience."
        ],
        "tags": [
          "FigureSkating",
          "VadymKolesnik",
          "EmiliaZingas",
          "ApoloOhno",
          "MakingTeamUSA",
          "Xfinity",
          "WinterOlympics",
          "TeamUSA",
          "Trust",
          "SportsInterview"
        ]
      }
    },
    {
      "id": "RalzsofAYHM",
      "title": "29-year-old spent $20,000 to open a store in New York — now it brings in $1.6 million a year",
      "channel": "CNBC Make It",
      "published_at": "2026-01-16T17:00:48.000Z",
      "url": "https://www.youtube.com/watch?v=RalzsofAYHM",
      "thumbnail": "https://i.ytimg.com/vi/RalzsofAYHM/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Abby Price started Abbode as a Parsons graduate student selling dried floral arrangements on Facebook in 2019 and had a Nolita storefront by March 2022 selling bouquets and home decor. She generated enough cashflow from the shop to buy a $15,000 embroidery machine, which sat in the shop’s basement covered in dust for a year.",
        "bullets": [
          "Launched Abbode while a graduate student at Parsons, selling dried florals on Facebook in 2019.",
          "By March 2022, operated a Nolita storefront offering bouquets and home decor.",
          "Storefront cashflow financed a $15,000 embroidery machine purchased impulsively.",
          "The machine remained stored in the shop’s basement for about a year."
        ],
        "takeaways": [
          "Capital equipment purchases (e.g., a $15,000 embroidery machine) can create new electrical load requirements—assess tenant circuit and power capacity for small retail spaces.",
          "Transition from online sales to a brick-and-mortar storefront implies growing on-site infrastructure needs (power, connectivity) as businesses scale.",
          "Staggered or delayed use of purchased equipment (machine stored for a year) suggests demand for flexible or staged provisioning rather than immediate permanent capacity increases."
        ],
        "tags": [
          "Abbode",
          "Abby Price",
          "Parsons School of Design",
          "dried floral",
          "Nolita",
          "storefront",
          "embroidery machine",
          "small business",
          "retail",
          "cashflow"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… W podcaście KPMG ON AIR eksperci z Zespołu ds. Cen Transferowych Monika Palmowska i Jakub Roszkiewicz omawiają, jak AI już dziś zmienia podejście do cen transferowych — od monitorowania rentowności i analiz porównawczych po automatyzację dokumentacji. Poruszono też ryzyka związane z danymi i bezpieczeństwem (w tym RODO i halucynacje), integrację z ERP, bezpieczne środowisko Digital Gateway, rozwój kompetencji pracowników oraz praktyczne pierwsze kroki wdrożeniowe i porządkowanie procesów.",
        "bullets": [
          "AI wspiera monitorowanie rentowności, benchmarki i automatyzację dokumentacji cen transferowych.",
          "AI nie ma zastąpić doradców podatkowych, lecz może wzmocnić ich pracę i rozwój młodszych pracowników.",
          "Wskazano ryzyka: dane, bezpieczeństwo, RODO oraz problem halucynacji modeli AI.",
          "Digital Gateway przedstawiono jako bezpieczne środowisko do pracy z AI.",
          "Kluczowe elementy wdrożenia: integracja z ERP, uporządkowanie procesów i określenie pierwszych kroków."
        ],
        "takeaways": [
          "Zapewnij bezpieczne środowiska i kontrolę dostępu dla wdrożeń AI (wzmianka o Digital Gateway i ryzykach bezpieczeństwa).",
          "Priorytetyzuj zarządzanie danymi i zgodność z RODO przy udostępnianiu danych do narzędzi AI.",
          "Przygotuj integrację AI z systemami ERP i procesami raportowania, by wykorzystać inteligentne benchmarki i automatyzację.",
          "Zainwestuj w porządkowanie procesów i szkolenia personelu — AI będzie wspierać kompetencje, nie zastępować ekspertów."
        ],
        "tags": [
          "podatki",
          "AI",
          "cenytransferowe",
          "transfer pricing",
          "ERP",
          "Digital Gateway",
          "RODO",
          "automatyzacja",
          "bezpieczeństwo"
        ]
      }
    },
    {
      "id": "dGfcT63U7Mo",
      "title": "The 2026 U.S. Olympic Figure Skating Team 🇺🇸",
      "channel": "Team USA",
      "published_at": "2026-01-15T20:43:24.000Z",
      "url": "https://www.youtube.com/watch?v=dGfcT63U7Mo",
      "thumbnail": "https://i.ytimg.com/vi/dGfcT63U7Mo/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video presents the U.S. Olympic Figure Skating lineup with an energetic promotional tone. The description uses a fire emoji and the #WinterOlympics hashtag to signal excitement and Olympic relevance.",
        "bullets": [
          "Announces the U.S. Olympic Figure Skating lineup.",
          "Promotional, high-energy tone indicated by the 🔥 emoji.",
          "Includes the #WinterOlympics hashtag.",
          "No transcript is available for the video."
        ],
        "takeaways": [
          "Tag and index this item under Olympic/Winter Olympics content (#WinterOlympics) for search and discovery.",
          "Add a transcript/captions to improve accessibility, compliance, and searchability since none is provided.",
          "Flag as time-sensitive Olympic promotional content for potential prioritization during the Games.",
          "Use the energetic promotional tone (emoji) to guide thumbnail and metadata styling for marketing."
        ],
        "tags": [
          "U.S. Olympic Figure Skating",
          "Figure Skating",
          "Winter Olympics",
          "Olympic Team",
          "Team USA",
          "2026",
          "Sports",
          "FigureSkatingLineup"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, whether you’re tackling workouts, projects, or personal goals, keep momentum going with Copilot. The video frames Microsoft Copilot as a way to stack small wins to sustain progress.",
        "bullets": [
          "Encourages stacking small wins to maintain momentum",
          "Applies to workouts, projects, and personal goals",
          "Positions Microsoft Copilot as the tool to keep progress going",
          "Focuses on sustained, incremental progress"
        ],
        "takeaways": [
          "Break large infrastructure or operational initiatives into small, trackable wins to sustain momentum.",
          "Use Copilot as an aid to keep routine and planning tasks progressing incrementally.",
          "Showcase quick wins to drive team adoption of Copilot in operations and project work.",
          "Consistent small improvements can help reduce project drag and maintain forward momentum."
        ],
        "tags": [
          "Microsoft Copilot",
          "Copilot",
          "productivity",
          "momentum",
          "small wins",
          "workouts",
          "projects",
          "personal goals",
          "motivation"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights how the precision and speed of the Dell PowerEdge R770AP server, powered by Intel® Xeon® 6 processors, support high-frequency trading by enabling hundreds of trades in seconds to help maximize gains and minimize losses. It positions Intel Xeon 6 CPUs' high-performance capabilities as defining the future of finance and points viewers to Intel Business resources for more IT guidance.",
        "bullets": [
          "Focus on high-frequency trading where latency and precision are critical.",
          "Showcases Dell PowerEdge R770AP server as the hardware platform.",
          "Emphasizes Intel® Xeon® 6 processors for high-performance trading workloads.",
          "Claims capability to perform hundreds of trades in seconds to maximize gains and minimize losses.",
          "Directs viewers to Intel Business channels and resources for further IT information."
        ],
        "takeaways": [
          "For HFT workloads, prioritize servers with high-performance CPUs like Intel Xeon 6 to reduce latency and improve trade throughput.",
          "Consider Dell PowerEdge R770AP as a candidate platform when evaluating low-latency finance infrastructure.",
          "Investing in faster, more precise compute resources can directly impact trading performance and financial outcomes.",
          "Use Intel Business resources for additional guidance, best practices, and IT planning information."
        ],
        "tags": [
          "high-frequency-trading",
          "HFT",
          "Intel-Xeon-6",
          "Dell-PowerEdge-R770AP",
          "low-latency",
          "finance",
          "data-center",
          "servers",
          "Intel-Business",
          "trading-infrastructure"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video says a creative spark was out and Copilot brought it back to life. It invites viewers to download Copilot and try it for themselves via the link in the bio.",
        "bullets": [
          "States Copilot reignited a lost creative spark.",
          "Short promotional message encouraging usage.",
          "Direct call to action to download Copilot.",
          "Provides a \"link in bio\" for trying the app."
        ],
        "takeaways": [
          "If teams rely on creative output, the video positions Copilot as a tool worth evaluating in pilot tests.",
          "The explicit download/try call-to-action enables quick hands-on assessment to validate fit for workflows.",
          "Treat the message as promotional—verify benefits through trials and measurable outcomes before wider deployment."
        ],
        "tags": [
          "Copilot",
          "creative-spark",
          "creativity",
          "download",
          "try-it",
          "link-in-bio",
          "promo"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The video presents Where Winds Meet, an open-world martial arts RPG showcasing DLSS 4 with Multi Frame Generation and #RTXOn. Footage is credited to DigitalDreamsyt.",
        "bullets": [
          "Showcases Where Winds Meet, an open-world martial arts RPG",
          "Highlights DLSS 4 with Multi Frame Generation",
          "Emphasizes #RTXOn (ray-tracing enabled)",
          "Footage/clip credited to DigitalDreamsyt"
        ],
        "takeaways": [
          "The demo features DLSS 4 with Multi Frame Generation — infrastructure intended to reproduce or host this content should support NVIDIA DLSS 4 capabilities.",
          "RTX On is highlighted — ensure availability of ray-tracing–capable GPUs if delivering similar RTX-enabled experiences.",
          "Content is game footage with creator credit — consider workflows for ingesting and delivering creator-supplied, high-fidelity visuals."
        ],
        "tags": [
          "Where Winds Meet",
          "DLSS 4",
          "Multi Frame Generation",
          "RTXOn",
          "open-world",
          "martial arts RPG",
          "DigitalDreamsyt",
          "NVIDIA GeForce",
          "gaming"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This Intel Business video is titled \"Taha Khalifa (Intel) | Intel Business\" and is hosted on the Intel Business channel. The channel and Intel® Business Center are presented as sources of resources, guidance, and expert insights for IT projects spanning data centers to devices, with links to subscribe and follow on social platforms.",
        "bullets": [
          "Title: Taha Khalifa (Intel) | Intel Business",
          "No transcript available for the video",
          "Intel Business Center offers resources, guidance, and expert insights for IT projects from data centers to devices",
          "Includes subscribe and connect links (YouTube, website, X, LinkedIn, Facebook)",
          "Published on Intel Business channel on 2026-01-14T09:05:28.000Z"
        ],
        "takeaways": [
          "Intel Business Center positions itself as a practical resource for data center planning and IT project execution.",
          "Decision-makers can use the channel and linked website for guidance and expert insights relevant to infrastructure and device choices.",
          "Following and subscribing to Intel Business provides ongoing access to updates and materials that may inform procurement and deployment decisions."
        ],
        "tags": [
          "Intel Business",
          "Taha Khalifa",
          "data centers",
          "IT resources",
          "Intel",
          "IT projects",
          "enterprise",
          "business center",
          "expert insights",
          "subscribe"
        ]
      }
    },
    {
      "id": "kSocjh8PZnQ",
      "title": "Rynek dóbr luksusowych w obliczu transformacji | Andrzej Marczak, Tomasz Wiśniewski",
      "channel": "KPMG Poland",
      "published_at": "2026-01-13T10:23:31.000Z",
      "url": "https://www.youtube.com/watch?v=kSocjh8PZnQ",
      "thumbnail": "https://i.ytimg.com/vi/kSocjh8PZnQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The KPMG ON AIR episode reviews trends shaping the luxury goods market in Poland and globally, including experience-focused consumption, ESG, \"affordable luxury,\" personalization, and \"luxury fatigue.\" Hosts Andrzej Marczak and Tomasz Wiśniewski discuss market structure (top 2% accounting for 40% of the market), Poland's growing but fragmented market, the role of Gen Z, art, hospitality and tourism, and future themes such as AI, craftsmanship and the human dimension.",
        "bullets": [
          "Główne trendy: doświadczenia ponad posiadanie, ESG, \"affordable luxury\" i \"luxury fatigue\".",
          "Najbogatsi klienci: 2% klientów odpowiada za 40% rynku luksusowego.",
          "Personalizacja i ekskluzywne doświadczenia klienta oraz aspirujący konsumenci i nowe kategorie produktów.",
          "Polska: rynek rosnący, ale rozproszony; rola rynku sztuki i młodych artystów.",
          "Przyszłość: ESG (ekoskóry, certyfikacje), luksus w hotelarstwie i filmie, oraz AI, rzemiosło i ludzki wymiar."
        ],
        "takeaways": [
          "Opis nie zawiera bezpośrednich informacji operacyjnych dotyczących sieci energetycznych, centrów danych ani wymagań infrastrukturalnych.",
          "Trendy wymienione w opisie (ESG, AI) mogą mieć potencjalne implikacje dla infrastruktury, lecz opis nie przedstawia szczegółów technicznych ani zapotrzebowania.",
          "Aby uzyskać konkretne wskazówki dotyczące wpływu na grid/centra danych, odwołaj się do pełnego odcinka podcastu lub raportu KPMG „Luxury in the Midst of Change 2025”."
        ],
        "tags": [
          "luksus",
          "ESG",
          "Polska",
          "KPMG",
          "personalizacja",
          "pokolenieZ",
          "AI",
          "rynek_sztuki"
        ]
      }
    }
  ]
}