{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-20T09:55:52.730Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Dr. Anna Chacon, 39, is a dermatologist in Miami, FL who runs her own private practice. Her reported net worth is about $6 million, made up of $3.2 million in investments, a $1.9 million home, and a $1.1 million office building.",
        "bullets": [
          "Dr. Anna Chacon, age 39, practices dermatology in Miami, FL.",
          "She operates a private practice.",
          "Total reported net worth: about $6 million.",
          "Net worth breakdown: $3.2M investments, $1.9M home, $1.1M office building."
        ],
        "takeaways": [
          "The description highlights an individual who owns both residential and commercial property, which can point to local business ownership as a potential factor in demand assessments.",
          "Ownership of an office building signals a small commercial site that could have facility-level infrastructure or continuity needs to consider.",
          "Public financial/profile summaries like this are limited in detail and should prompt collection of deeper, verified data before making capacity or service commitments.",
          "For localized planning, noting concentrations of owner-operated professional practices can inform outreach and targeted service offerings."
        ],
        "tags": [
          "dermatologist",
          "private practice",
          "net worth",
          "investments",
          "real estate",
          "Miami",
          "office building",
          "financial profile",
          "CNBC Make It",
          "Anna Chacon"
        ]
      }
    },
    {
      "id": "6L86-OnOXV0",
      "title": "How I Built A $1M/Year Business - And Helped My Parents Retire",
      "channel": "CNBC Make It",
      "published_at": "2026-01-17T15:00:09.000Z",
      "url": "https://www.youtube.com/watch?v=6L86-OnOXV0",
      "thumbnail": "https://i.ytimg.com/vi/6L86-OnOXV0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Tuan Le emigrated from Vietnam to Toronto in 2015 and vowed at 15 to help his parents retire. Ten years later his social video production company, ShortsCut generates over $1 million USD in annual sales, and he now pays his parents' rent and living expenses so they no longer work full time.",
        "bullets": [
          "Founder: Tuan Le emigrated from Vietnam to Toronto in 2015 and made a personal vow to support his parents.",
          "Business: ShortsCut is a social video production company bringing in over $1M USD per year in sales.",
          "Outcome: Tuan now covers his parents' rent and living expenses, enabling them to stop working full time.",
          "Backstory timeframe: The milestone came roughly 10 years after the family emigrated.",
          "Video produced by CNBC Make It with listed production credits."
        ],
        "takeaways": [
          "High-revenue social video producers (e.g., >$1M/year) represent potential enterprise customers for digital infrastructure and services.",
          "Scaling video production businesses can drive demand for reliable storage, delivery and compute capacity—consider tailoring offerings to content creators.",
          "Media visibility (CNBC feature) can accelerate demand spikes; prepare for onboarding and bandwidth needs when clients gain exposure.",
          "Targeting growth-oriented, founder-led creative firms— including immigrant entrepreneurs—can uncover stable, expanding revenue opportunities."
        ],
        "tags": [
          "Tuan Le",
          "ShortsCut",
          "social video",
          "entrepreneurship",
          "immigrant founder",
          "CNBC Make It",
          "1M revenue",
          "content production",
          "family support"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this giant bubble of carbon dioxide can store 20 megawatts of energy. The description says these new batteries are intended to manage renewable energy fluctuations and help power the global shift to clean energy.",
        "bullets": [
          "Giant carbon dioxide bubble used as an energy storage system.",
          "Stores 20 megawatts of energy (per description).",
          "Designed to address fluctuations in renewable energy supply.",
          "Positioned as a tool to support the global transition to clean energy.",
          "Covered by IEEE Spectrum with a tech/innovation focus."
        ],
        "takeaways": [
          "Represents a high-capacity (20 MW) storage option to buffer renewable intermittency.",
          "Could be relevant for grid planners seeking large-scale storage to stabilize supply.",
          "May be of interest to data center operators evaluating options for maintaining continuous power amid variable renewables.",
          "Described as a solution intended to support the global transition to cleaner energy sources."
        ],
        "tags": [
          "ieee",
          "tech",
          "ieeespectrum",
          "innovation",
          "future",
          "futuristic",
          "energy",
          "battery",
          "carbon-dioxide"
        ]
      }
    },
    {
      "id": "OINppmPan0o",
      "title": "Figure Skating | Making Team USA presented by Xfinity with Apolo Ohno",
      "channel": "Team USA",
      "published_at": "2026-01-16T19:30:36.000Z",
      "url": "https://www.youtube.com/watch?v=OINppmPan0o",
      "thumbnail": "https://i.ytimg.com/vi/OINppmPan0o/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Figure skating duo Vadym Kolesnik and Emilia Zingas sit down with Apolo Ohno on an episode of Making Team USA presented by Xfinity ahead of the Winter Olympics. The episode is framed around the theme \"Built on trust\" and promotes Team USA's channels.",
        "bullets": [
          "Interview features Vadym Kolesnik and Emilia Zingas with Apolo Ohno",
          "Episode is part of Making Team USA presented by Xfinity",
          "Thematically centered on \"Built on trust\"",
          "Positioned ahead of the Winter Olympics",
          "Promotes Team USA social and web channels"
        ],
        "takeaways": [
          "Major events like the Winter Olympics create predictable, time-bound demand — plan capacity and readiness ahead of peak periods.",
          "Sponsored content (presented by Xfinity) highlights the value of partnering with major providers for distribution and reliability.",
          "Multi-platform distribution (YouTube, website, Facebook, Twitter, Instagram, TikTok) requires cross-platform delivery and CDN planning.",
          "Messaging around \"trust\" reinforces the need for reliable, redundant infrastructure to maintain audience confidence."
        ],
        "tags": [
          "Vadym Kolesnik",
          "Emilia Zingas",
          "Apolo Ohno",
          "Figure Skating",
          "Winter Olympics",
          "Making Team USA",
          "Xfinity",
          "TeamUSA",
          "MTUSA",
          "Interview"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this KPMG ON AIR podcast episode features Monika Palmowska and Jakub Roszkiewicz discussing how AI is already impacting transfer pricing—from monitoring profitability and benchmarking to automating documentation. They cover practical implementation steps, integration with ERP, the role of secure environments like Digital Gateway, and risks such as data security, RODO compliance and AI hallucinations, while noting AI will augment rather than replace advisors.",
        "bullets": [
          "AI applications: monitoring rentowności, inteligentne benchmarki i automatyzacja dokumentacji cen transferowych.",
          "AI jako wsparcie doradców — zwiększa efektywność i rozwój kompetencji młodszych pracowników, nie zastąpi ekspertów.",
          "Ryzyka: ochrona danych, bezpieczeństwo, RODO i problem halucynacji modeli AI.",
          "Rozwiązania bezpieczne do pracy z AI: omówienie Digital Gateway.",
          "Wdrożenie: zaczynać od uporządkowania procesów, potem integracja z ERP i stopniowe wdrażanie inteligentnych narzędzi."
        ],
        "takeaways": [
          "Rozważ wdrożenie AI do monitorowania rentowności i automatyzacji dokumentów, by zwiększyć efektywność operacyjną centrum danych i zarządzania kosztami.",
          "Priorytetem musi być bezpieczeństwo danych i zgodność z RODO — wybieraj bezpieczne środowiska pracy z AI (np. Digital Gateway).",
          "Przed zastosowaniem AI uporządkuj procesy i planuj integrację z ERP, aby uzyskać wartość z inteligentnych benchmarków i analiz.",
          "Traktuj AI jako narzędzie wspierające specjalistów, co może skrócić czas decyzji i podnieść jakość analiz transfer pricing."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "podatki",
          "automatyzacja",
          "bezpieczeństwo danych",
          "RODO",
          "ERP",
          "benchmarking",
          "KPMG",
          "podcast"
        ]
      }
    },
    {
      "id": "dGfcT63U7Mo",
      "title": "The 2026 U.S. Olympic Figure Skating Team 🇺🇸",
      "channel": "Team USA",
      "published_at": "2026-01-15T20:43:24.000Z",
      "url": "https://www.youtube.com/watch?v=dGfcT63U7Mo",
      "thumbnail": "https://i.ytimg.com/vi/dGfcT63U7Mo/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video presents the U.S. Olympic Figure Skating lineup for 2026. It’s an announcement-style clip posted by Team USA ahead of the Winter Olympics.",
        "bullets": [
          "Video title: The 2026 U.S. Olympic Figure Skating Team 🇺🇸",
          "Channel: Team USA; Published: 2026-01-15",
          "Description: “This U.S. Olympic Figure Skating lineup. 🔥 #WinterOlympics”",
          "No transcript is available for this video"
        ],
        "takeaways": [
          "Announcement content tied to a major sporting event can drive short-term spikes in streaming and CDN demand around release and during the Olympics window.",
          "Ensure high availability and scalable capacity for video delivery and social-media endpoints when posting national-team announcements.",
          "Monitor traffic and engagement metrics promptly after publication to detect and respond to surge patterns.",
          "Schedule planned maintenance outside the announcement and Olympic periods to minimize user-impact risk."
        ],
        "tags": [
          "U.S. Figure Skating",
          "2026",
          "WinterOlympics",
          "Team USA",
          "Figure Skating",
          "Olympics",
          "Announcement",
          "Sports",
          "FigureSkatingTeam"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video promotes using Microsoft Copilot to keep momentum across workouts, projects, and personal goals by stacking small wins. It frames Copilot as a practical way to maintain progress and stay motivated.",
        "bullets": [
          "Focuses on maintaining momentum.",
          "Applies to workouts, projects, and personal goals.",
          "Encourages stacking small wins.",
          "Presents Copilot as a tool to keep progress going."
        ],
        "takeaways": [
          "Encourage teams to break large initiatives into small, trackable wins to sustain project momentum with Copilot.",
          "Use Copilot to support staff productivity and motivation during long-running deployments or upgrades.",
          "Consistent small progress can help maintain operational focus and reduce project drift in infrastructure work.",
          "Integrate Copilot into training and routine workflows to build habits that keep infrastructure projects moving forward."
        ],
        "tags": [
          "Microsoft Copilot",
          "small wins",
          "momentum",
          "productivity",
          "motivation",
          "workouts",
          "projects",
          "personal goals"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This video highlights the Dell PowerEdge R770AP server powered by Intel® Xeon® 6 processors and how their precision and speed support high-frequency trading. It emphasizes that these CPUs enable hundreds of trades in seconds to help maximize gains and minimize losses, positioning Intel Xeon 6 as shaping the future of finance.",
        "bullets": [
          "Focus on high-frequency trading where every second matters.",
          "Showcases Dell PowerEdge R770AP server as the hardware platform.",
          "Highlights Intel® Xeon® 6 processors for precision and speed.",
          "Claims capability to perform hundreds of trades in seconds.",
          "Frames Intel Xeon 6 CPUs as defining the future of finance."
        ],
        "takeaways": [
          "For latency-sensitive trading workloads, prioritize servers and CPUs that emphasize precision and speed.",
          "Evaluate the Dell PowerEdge R770AP with Intel Xeon 6 processors for high-frequency trading deployments.",
          "Design infrastructure to support rapid, high-volume trade execution to help maximize gains and minimize losses."
        ],
        "tags": [
          "high-frequency trading",
          "HFT",
          "Dell PowerEdge R770AP",
          "Intel Xeon 6",
          "low-latency",
          "finance",
          "data center",
          "servers",
          "Intel Business"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the creative spark was out and Copilot brought it back to life. The description invites viewers to download Copilot and try it for themselves via the link in bio.",
        "bullets": [
          "Copilot is credited with restoring creative spark.",
          "Viewers are encouraged to download and try Copilot.",
          "Download link is referenced as being in the profile (link in bio).",
          "Short promotional message with a call to action."
        ],
        "takeaways": [
          "Copilot is positioned as a tool to help restore creativity—consider whether a trial aligns with team needs.",
          "A downloadable trial is available via the link in bio—authorize and track any trial deployments per policy.",
          "If evaluating new productivity tools, plan a short assessment to determine fit for creative workflows."
        ],
        "tags": [
          "Copilot",
          "creativity",
          "download",
          "try",
          "link in bio",
          "creative spark",
          "trial",
          "productivity",
          "AI assistant"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this clip showcases Where Winds Meet, an open-world martial arts RPG highlighted with NVIDIA's DLSS 4 featuring Multi Frame Generation and RTX-on visuals. The short footage is credited to DigitalDreamsyt.",
        "bullets": [
          "Showcases the open-world martial arts RPG Where Winds Meet",
          "Highlights DLSS 4 with Multi Frame Generation",
          "Emphasizes RTX-on visual enhancements (#RTXOn)",
          "Presented as a visual showcase rather than detailed commentary",
          "Footage credited to @DigitalDreamsyt"
        ],
        "takeaways": [
          "Uses DLSS 4 and Multi Frame Generation — verify infrastructure supports NVIDIA RTX features and compatible GPUs",
          "Ensure driver and SDK support for DLSS 4/Multi Frame Generation in deployment environments",
          "Account for GPU provisioning for workloads that leverage real-time RTX-enabled rendering",
          "Confirm content delivery and playback pipelines are compatible with RTX-enhanced assets"
        ],
        "tags": [
          "WhereWindsMeet",
          "DLSS4",
          "MultiFrameGeneration",
          "RTXOn",
          "open-world",
          "martial-arts",
          "RPG",
          "NVIDIA",
          "GeForce",
          "DigitalDreamsyt"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This video, titled \"Taha Khalifa (Intel) | Intel Business,\" is posted on the Intel Business YouTube channel. The channel positions itself as a source of IT resources, guidance, and expert insights to support projects from data centers to devices, and the description includes subscription and social links for further connection.",
        "bullets": [
          "No transcript available for the video.",
          "Video titled 'Taha Khalifa (Intel) | Intel Business' on the Intel Business channel.",
          "Subscribe link provided: https://intel.ly/43XZh6J",
          "Channel described as offering resources, guidance, and expert insights for IT projects across data centers to devices.",
          "Connect links listed: Intel Business website and social accounts on X, LinkedIn, and Facebook."
        ],
        "takeaways": [
          "Intel Business presents itself as a centralized resource for IT decision-makers handling data center and device projects.",
          "Subscribe and follow the listed channels to access ongoing guidance and expert insights relevant to IT initiatives.",
          "Use the Intel Business website and social accounts to find additional resources and updates for planning and executing IT projects.",
          "With no transcript available, viewers should consult the channel links to access more information or related content."
        ],
        "tags": [
          "Intel Business",
          "Taha Khalifa",
          "IT resources",
          "data center",
          "devices",
          "Intel",
          "IT guidance",
          "YouTube channel",
          "enterprise IT",
          "IT projects"
        ]
      }
    },
    {
      "id": "kSocjh8PZnQ",
      "title": "Rynek dóbr luksusowych w obliczu transformacji | Andrzej Marczak, Tomasz Wiśniewski",
      "channel": "KPMG Poland",
      "published_at": "2026-01-13T10:23:31.000Z",
      "url": "https://www.youtube.com/watch?v=kSocjh8PZnQ",
      "thumbnail": "https://i.ytimg.com/vi/kSocjh8PZnQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This KPMG ON AIR episode (Andrzej Marczak, Tomasz Wiśniewski) reviews trends shaping the global and Polish luxury goods market, including a shift toward experiences, ESG and responsible-luxury practices, and the rise of “affordable luxury.” The discussion highlights personalization, the role of the wealthiest customers, luxury in hospitality and art, Poland’s growing but fragmented market, and future drivers such as AI and craftsmanship.",
        "bullets": [
          "Key trends: experience-focused luxury, ESG/responsible sourcing, and affordable-luxury.",
          "Top 2% of wealthiest clients account for ~40% of the market.",
          "Personalization and exclusive customer experiences are rising priorities.",
          "Poland’s market is growing despite global declines but remains fragmented.",
          "Future themes include AI, craftsmanship, luxury tourism/hotels, and the Polish art scene."
        ],
        "takeaways": [
          "ESG emphasis suggests demand for energy/operations that can meet sustainability and certification expectations.",
          "Mention of AI and personalization points to potential increases in compute and data infrastructure needs.",
          "Growth in luxury hospitality and tourism implies higher requirements for reliable power and connectivity at premium venues.",
          "Market expansion and digital-first luxury experiences encourage proactive capacity and resilience planning for data centers and grids."
        ],
        "tags": [
          "luksus",
          "ESG",
          "AI",
          "personalizacja",
          "Polska",
          "hotelarstwo",
          "turystyka",
          "affordable-luxury",
          "KPMG",
          "sztuka"
        ]
      }
    }
  ]
}