{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-31T11:38:50.770Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "6B29VDvPPzc",
      "title": "Build Knowledge Graph-powered AI Agents For Your Use Case | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-31T06:10:50.000Z",
      "url": "https://www.youtube.com/watch?v=6B29VDvPPzc",
      "thumbnail": "https://i.ytimg.com/vi/6B29VDvPPzc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This AWS Events session demonstrates how to automatically build a knowledge graph from raw documents and connect it to an AI agent so the agent understands your company. The talk is an end-to-end demo that requires no prior graph expertise.",
        "bullets": [
          "Knowledge graphs are presented as the solution for AI agents that lack company-specific knowledge.",
          "Session builds a knowledge graph automatically from raw documents.",
          "The graph is connected to an AI agent so it can understand your business.",
          "No graph queries or graph theory expertise required.",
          "End-to-end demo; references a prior episode comparing VectorDB vs GraphDB."
        ],
        "takeaways": [
          "If you need AI agents that understand enterprise data, knowledge graphs are a direct approach to enable that capability.",
          "Automated graph construction reduces dependency on specialized graph skills when adopting this tech.",
          "An end-to-end demo can help planning for integration and operational deployment of graph-powered agents.",
          "Evaluate GraphDB vs VectorDB trade-offs (see prior episode) as part of your design choices."
        ],
        "tags": [
          "knowledge-graph",
          "AI-agents",
          "Databases-for-AI",
          "AWS-Events",
          "graph-db",
          "vector-db",
          "no-graph-expertise",
          "end-to-end",
          "enterprise-AI"
        ]
      }
    },
    {
      "id": "z-X9MYi1Rr0",
      "title": "Leveraging tax credits and incentives for sustainability projects",
      "channel": "PwC US",
      "published_at": "2026-01-30T13:27:25.000Z",
      "url": "https://www.youtube.com/watch?v=z-X9MYi1Rr0",
      "thumbnail": "https://i.ytimg.com/vi/z-X9MYi1Rr0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, when leaders think about tax credits for sustainability they often focus on energy incentives, but those are only part of the picture. Randa Barsoum, Tax Partner at PwC US, highlights less obvious opportunities—such as state and local abatements, location-based incentives, and R&D tax credits tied to innovation in packaging or processes—and emphasizes that broadening the view can unlock meaningful tax value from sustainability investments.",
        "bullets": [
          "Energy incentives are commonly considered but not the only tax levers for sustainability.",
          "Less obvious opportunities include state/local abatements and location-based incentives.",
          "R&D tax credits can apply to innovation efforts like reimagining packaging or processes.",
          "Viewing sustainability investments through a broader tax lens can generate meaningful value.",
          "Insight provided by Randa Barsoum, Tax Partner, PwC US; more resources available from PwC."
        ],
        "takeaways": [
          "Don’t assume energy incentives are the only tax benefits—evaluate state/local abatements and location-based incentives when assessing sites.",
          "Factor available location-based incentives into data center siting and expansion decisions to improve project economics.",
          "Document and assess innovation activities (process or design changes) for potential R&D tax credit eligibility.",
          "Integrate tax-incentive considerations into sustainability project planning to capture additional value."
        ],
        "tags": [
          "tax credits",
          "sustainability",
          "energy incentives",
          "state abatements",
          "location-based incentives",
          "R&D tax credit",
          "PwC",
          "corporate tax strategy",
          "data centers",
          "site selection"
        ]
      }
    },
    {
      "id": "oQtkaHzUYlY",
      "title": "Copilot helps Christa find her inner star 🌟",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-29T18:33:49.000Z",
      "url": "https://www.youtube.com/watch?v=oQtkaHzUYlY",
      "thumbnail": "https://i.ytimg.com/vi/oQtkaHzUYlY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the sky is full of stars and Copilot helps Christa find the star within. The short video invites viewers to download and try Copilot via the link in the bio.",
        "bullets": [
          "Visual theme: a sky full of stars, framing an inner 'star' narrative.",
          "Positions Copilot as helping Christa discover her 'star within'.",
          "Clear call to action to download and try Copilot.",
          "Download link directed to the creator's bio.",
          "Published by Microsoft Copilot."
        ],
        "takeaways": [
          "The promotion includes a direct download CTA—ensure download and distribution links are robust and monitored.",
          "Consumer-facing messaging may drive campaign traffic—confirm analytics and monitoring are in place to track spikes.",
          "Coordinate infrastructure readiness with marketing timing to avoid access issues from 'link in bio' traffic.",
          "Verify landing page and backend availability before and during promotional periods."
        ],
        "tags": [
          "Microsoft Copilot",
          "Copilot",
          "Christa",
          "inner star",
          "stars",
          "download",
          "link in bio",
          "marketing",
          "video"
        ]
      }
    },
    {
      "id": "BYtYm-xyKR8",
      "title": "Bringing In $251K A Year With 3 Jobs In The Bay Area",
      "channel": "CNBC Make It",
      "published_at": "2026-01-29T17:47:46.000Z",
      "url": "https://www.youtube.com/watch?v=BYtYm-xyKR8",
      "thumbnail": "https://i.ytimg.com/vi/BYtYm-xyKR8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Naseema McElroy, 44, is a labor and delivery nurse in Brentwood, California who runs a personal finance brand called Financially Intentional. After accumulating nearly $1 million in debt in 2015 she documented her debt-payoff journey, was debt-free by 2017, and now brings in $251K a year across three jobs; the video is part of CNBC Make It's Millennial Money series.",
        "bullets": [
          "Naseema McElroy, 44, is a labor and delivery nurse and founder of Financially Intentional.",
          "In 2015 she had nearly $1 million in debt and began documenting her debt-payoff journey.",
          "She became debt-free by 2017.",
          "She now earns $251K per year through three jobs.",
          "This story is featured in CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "Diversified revenue streams (three jobs) can increase financial resilience — consider multiple income or service lines to reduce single-source risk.",
          "Documenting a personal or company journey can build a brand and open alternative revenue opportunities.",
          "A focused, disciplined approach to reducing liabilities translates to stronger balance-sheet health — apply rigorous cost-control measures to improve margins.",
          "Combining core operations with adjacent entrepreneurial efforts can materially boost total earnings without abandoning primary responsibilities."
        ],
        "tags": [
          "Naseema McElroy",
          "Financially Intentional",
          "debt payoff",
          "personal finance",
          "nurse entrepreneur",
          "Bay Area",
          "CNBC Make It",
          "Millennial Money"
        ]
      }
    },
    {
      "id": "t6y2cVNjCAw",
      "title": "GeForce Garage - Summer of RTX Community Build",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-29T14:01:25.000Z",
      "url": "https://www.youtube.com/watch?v=t6y2cVNjCAw",
      "thumbnail": "https://i.ytimg.com/vi/t6y2cVNjCAw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… NVIDIA’s GeForce Garage highlights the winning Summer of RTX r/buildapc community build by u/JeffersonPutnam: a small-form-factor rig centered on a GeForce RTX 5090 Founders Edition. The description lists the full parts list (PCPartPicker) and key components including a Fractal Design Era 2 chassis, MSI MPG B850I Edge motherboard, Ryzen 7 9800X3D, 32GB DDR5-6000, Corsair SF1000 PSU, and Corsair Nautilus 240 RS AIO.",
        "bullets": [
          "Winner: u/JeffersonPutnam’s SFF GeForce RTX 5090 build (Summer of RTX community contest).",
          "Host: GeForce Dwight (Twitter: @_MightyPotato).",
          "Key components: RTX 5090 FE, Fractal Era 2 chassis, MSI B850I Edge, Ryzen 7 9800X3D, 32GB DDR5-6000, Corsair SF1000, Corsair Nautilus 240 RS AIO.",
          "Full parts list available on PCPartPicker (link provided in description).",
          "Video and social links for GeForce channels included (Twitter, Facebook, Instagram, TikTok, Community Portal)."
        ],
        "takeaways": [
          "High-end consumer GPUs like the RTX 5090 can be integrated into small-form-factor systems, but require appropriate power provisioning (example: Corsair SF1000 SFX PSU).",
          "Effective cooling solutions (here, a 240mm AIO) and a compatible chassis (Fractal Era 2) are essential when deploying compact, high-performance hardware—thermal design must be planned accordingly.",
          "Choosing the right mini-ITX motherboard and components (MSI MPG B850I Edge, compact RAM, SFX PSU) enables dense, space-efficient builds—relevant when evaluating rack or edge deployment constraints.",
          "Community-verified parts lists (PCPartPicker) provide practical configuration examples for assessing compatibility and informing procurement decisions."
        ],
        "tags": [
          "GeForceGarage",
          "RTX5090",
          "SFF",
          "SummerOfRTX",
          "FractalEra2",
          "Ryzen7_9800X3D",
          "CorsairSF1000",
          "PCPartPicker",
          "GeForce",
          "CommunityBuild"
        ]
      }
    },
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy GenAI solutions, unlocking new revenue streams while streamlining operations and boosting developer productivity. Google Cloud's infrastructure and consulting support compressed TTEC's digital transformation timeline and expanded what was possible for their business.",
        "bullets": [
          "TTEC worked with Google Cloud Consulting to rapidly prototype and deploy AI solutions.",
          "They leveraged GenAI and Google Cloud’s infrastructure to streamline operations.",
          "Developer productivity was increased through the new AI-enabled tooling.",
          "The partnership compressed TTEC’s digital transformation timeline.",
          "These efforts enabled entirely new revenue streams for TTEC."
        ],
        "takeaways": [
          "Robust cloud infrastructure matters — TTEC relied on Google Cloud to run GenAI workloads.",
          "Cloud consulting can compress deployment timelines — a partner helped TTEC move faster.",
          "GenAI-focused projects can boost operational efficiency and developer productivity.",
          "Rapid prototyping and deployment via cloud platforms can enable new revenue opportunities."
        ],
        "tags": [
          "googlecloud",
          "ttec",
          "genai",
          "aideployment",
          "operationalefficiency",
          "customerexperience",
          "googlecloudplatform",
          "generativeai"
        ]
      }
    }
  ]
}