{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-28T17:03:39.086Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy GenAI solutions that unlocked new revenue streams and streamlined operations. Sreeni Alakappan says the company used Google Cloud's infrastructure to boost developer productivity and compress its digital transformation timeline.",
        "bullets": [
          "TTEC worked with Google Cloud Consulting to quickly prototype and deploy AI solutions.",
          "Leveraged Generative AI together with Google Cloud's infrastructure.",
          "Streamlined operations and increased developer productivity.",
          "Compressed the digital transformation timeline and expanded business ambitions."
        ],
        "takeaways": [
          "Cloud consulting can accelerate AI deployment timelines, reducing time to value for AI initiatives.",
          "Using cloud-based GenAI platforms can help unlock new revenue streams without building everything in-house.",
          "Robust cloud infrastructure supports increased developer productivity, lowering operational friction.",
          "Partnering with specialists can expand what is feasible for the business while compressing transformation schedules."
        ],
        "tags": [
          "googlecloud",
          "ttec",
          "genai",
          "aideployment",
          "operationalefficiency",
          "customerexperience",
          "cloudconsulting",
          "digitaltransformation"
        ]
      }
    },
    {
      "id": "gv6zK265OUE",
      "title": "Build your first GraphRAG Powered Agent! (No Graph Expert Required) | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-27T20:55:49.000Z",
      "url": "https://www.youtube.com/watch?v=gv6zK265OUE",
      "thumbnail": "https://i.ytimg.com/vi/gv6zK265OUE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This AWS Events session explains how to free up knowledge trapped in docs, PDFs, and wikis by building a knowledge graph. It promises a live demo using real documents and a workflow that can be completed in an afternoon rather than a six-month project.",
        "bullets": [
          "Demonstrates unlocking knowledge from documents, PDFs, and wikis.",
          "Explains use of knowledge graphs to enable reasoning over text.",
          "Shows how to build a knowledge graph in an afternoon.",
          "Uses the same AI tools teams already have.",
          "Includes a live demo with real documents; no long project required."
        ],
        "takeaways": [
          "For grid/data center decision-makers: converting existing docs, PDFs, and wikis into a knowledge graph can surface operational knowledge currently trapped in text.",
          "A knowledge-graph approach can let your AI systems reason over internal documentation more effectively using tools you already use.",
          "A short, afternoon-long build reduces implementation time and lowers the barrier to trialing knowledge-graph capabilities.",
          "Live demos with real documents make it easier to evaluate applicability and plan next steps without committing to a long project."
        ],
        "tags": [
          "knowledge-graphs",
          "GraphRAG",
          "AI",
          "Databases-for-AI",
          "AWS-Events",
          "live-demo",
          "documents",
          "PDFs",
          "wikis",
          "knowledge-management"
        ]
      }
    },
    {
      "id": "yUpQ9pWA9WE",
      "title": "Watch Live: Fed Chair Jerome Powell Holds News Conference | WSJ",
      "channel": "WSJ News",
      "published_at": "2026-01-27T20:49:24.000Z",
      "url": "https://www.youtube.com/watch?v=yUpQ9pWA9WE",
      "thumbnail": "https://i.ytimg.com/vi/yUpQ9pWA9WE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Federal Reserve Chair Jerome Powell speaks to reporters following the Fed's two-day policy-setting meeting. The event is presented live by WSJ News. No transcript or further details of his remarks are provided in the description.",
        "bullets": [
          "Jerome Powell holds a post-meeting press conference.",
          "Remarks come immediately after the Federal Reserve's two-day policy-setting meeting.",
          "Event streamed live on WSJ News.",
          "No transcript or specific content details are included in the description.",
          "Hashtags provided: #JeromePowell #Fed #WSJ"
        ],
        "takeaways": [
          "Monitor the press conference as the primary source of official Fed messaging following the policy meeting.",
          "Record and archive the remarks for planning, compliance, and audit purposes.",
          "Have finance/treasury teams ready to interpret any guidance for cash management and cost-of-capital considerations.",
          "Defer major operational or capital decisions that depend on macroeconomic policy clarity until you can review the conference details."
        ],
        "tags": [
          "JeromePowell",
          "FederalReserve",
          "Fed",
          "WSJ",
          "press-conference",
          "policy-meeting",
          "live",
          "monetary-policy"
        ]
      }
    },
    {
      "id": "5CyVBSbHmbA",
      "title": "Year-end toolkit: Strengthening audit committee collaboration",
      "channel": "PwC US",
      "published_at": "2026-01-27T17:20:31.000Z",
      "url": "https://www.youtube.com/watch?v=5CyVBSbHmbA",
      "thumbnail": "https://i.ytimg.com/vi/5CyVBSbHmbA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this PwC episode offers guidance for finance teams on strengthening collaboration with audit committees during the year-end accounting and reporting process. It covers communication and governance practices, key year-end issues, oversight of AI, enterprise risk and cyber risk in the age of AI, and improving proxy disclosures to help manage a packed audit committee agenda.",
        "bullets": [
          "Strengthening management/audit committee communication and collaboration.",
          "Key year-end accounting and reporting issues finance teams should be ready to address.",
          "Oversight of AI including risks, opportunities, and necessary controls.",
          "Enhancing enterprise risk oversight and addressing evolving cyber risk in the age of AI.",
          "Elevating and streamlining proxy disclosures to support governance and reporting."
        ],
        "takeaways": [
          "Engage the audit committee early and clearly on transformation initiatives (including AI deployments) and their accounting/reporting implications to avoid surprises at year-end.",
          "Prepare documented controls and risk assessments for AI implementations so the audit committee can evaluate related risks and opportunities.",
          "Include AI-specific and cyber threat considerations within enterprise risk reporting to give the audit committee a consolidated view of operational and financial exposures.",
          "Streamline year-end reporting by prioritizing the most material issues and linking operational impacts (e.g., transformation, cyber) to financial disclosures and proxy language."
        ],
        "tags": [
          "audit committee",
          "year-end reporting",
          "finance teams",
          "AI oversight",
          "enterprise risk",
          "cyber risk",
          "proxy disclosures",
          "governance",
          "transformation initiatives",
          "PwC"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Jo discovers the power of Copilot Groups in a short clip that presents route planning made easy. The video highlights Copilot Groups as a tool for simplifying route planning.",
        "bullets": [
          "Focuses on Copilot Groups helping with route planning.",
          "Features a user named Jo discovering the capability.",
          "Positions the feature as making route planning easy.",
          "Includes hashtags: #copilot #microsoftcopilot #ai"
        ],
        "takeaways": [
          "If route planning is part of your operations, consider evaluating Copilot Groups as a potential way to simplify those workflows.",
          "Pilot Copilot Groups with field teams to judge whether it improves coordination and planning for routing tasks.",
          "If pursuing evaluation, check how Copilot Groups would integrate with existing dispatch, scheduling, or operational tools."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "copilot-groups",
          "route-planning",
          "operations",
          "field-operations",
          "efficiency"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, KPMG Poland’s podcast episode presents AI as a present-day element of audit work, with Katarzyna Chojniak and Alicja Barska opisują praktyczne narzędzia i korzyści. Omawiane są m.in. analiza pełnych populacji (AI Transaction Scoring), konwersacyjne asystenty i agenci (Clara AI), platforma KPMG Clara do zarządzania badaniem oraz kwestie kompetencji audytorów, bezpieczeństwa danych i regulacji.",
        "bullets": [
          "AI Transaction Scoring Tool umożliwia analizę pełnych populacji zamiast tradycyjnego próbkowania.",
          "Clara AI działa jako konwersacyjny asystent i zestaw wyspecjalizowanych agentów wspierających audytorów.",
          "Platforma KPMG Clara zapewnia zarządzanie badaniem w czasie rzeczywistym, a Clara for Clients usprawnia komunikację z klientem.",
          "Technologie zmieniają rolę audytora — potrzebne są nowe kompetencje i adaptacja zespołów.",
          "W rozmowie poruszono też wyzwania wdrożeniowe: bezpieczeństwo danych, środowisko regulacyjne i potencjalne zagrożenia AI."
        ],
        "takeaways": [
          "Zapewnij, by procesy audytowe potrafiły obsługiwać analizę pełnych populacji danych — to zwiększa pokrycie i precyzję kontroli.",
          "Priorytetem musi być bezpieczeństwo danych i zgodność z regulacjami przy integracji narzędzi AI w infrastrukturze IT.",
          "Wybieraj rozwiązania wspierające zarządzanie badaniem w czasie rzeczywistym i nowoczesną komunikację z klientem, aby skrócić cykle decyzyjne.",
          "Inwestuj w szkolenia i rozwój kompetencji zespołów audytowych, aby skutecznie korzystały z asystentów AI i agentów wyspecjalizowanych.",
          "Ustal zasady nadzoru i oceny ryzyk związanych z AI, aby ograniczyć potencjalne zagrożenia przy wdrożeniach."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMG",
          "KPMG Clara",
          "Clara AI",
          "AI Transaction Scoring",
          "bezpieczeństwo danych",
          "regulacje"
        ]
      }
    }
  ]
}