{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-18T16:50:47.423Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "6L86-OnOXV0",
      "title": "How I Built A $1M/Year Business - And Helped My Parents Retire",
      "channel": "CNBC Make It",
      "published_at": "2026-01-17T15:00:09.000Z",
      "url": "https://www.youtube.com/watch?v=6L86-OnOXV0",
      "thumbnail": "https://i.ytimg.com/vi/6L86-OnOXV0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, when he was 15 Tuan Le vowed to help his parents retire after his family emigrated from Vietnam to Toronto in 2015. Ten years later his social video production company, ShortsCut, brings in over $1 million USD a year in sales, and he now pays his parents' rent and living expenses so they no longer work full time.",
        "bullets": [
          "Tuan Le emigrated from Vietnam to Toronto in 2015 and vowed at 15 to help his parents retire.",
          "His company, ShortsCut, is a social video production firm generating over $1M USD per year in sales.",
          "He now covers his parents' rent and living expenses, allowing them to stop working full time.",
          "The piece was produced by CNBC Make It; Produced & Edited by Zach Green; Reporter: Kamaron McNair.",
          "Video published by CNBC Make It on Jan 17, 2026."
        ],
        "takeaways": [
          "A social video production company reaching seven-figure revenue (ShortsCut) represents a real, recurring source of demand for digital infrastructure and services.",
          "High-growth content creators will need scalable storage, encoding/transcoding, and content-delivery solutions to support production workflows.",
          "Regional creators (example: Toronto-based founder) indicate geographically distributed demand—plan regional capacity and low-latency delivery accordingly.",
          "Targeting agencies and independent studios could yield steady business for cloud, colocation, and CDN providers supporting video workflows."
        ],
        "tags": [
          "CNBCMakeIt",
          "TuanLe",
          "ShortsCut",
          "entrepreneurship",
          "video-production",
          "immigrant-success",
          "family-support",
          "million-dollar-revenue",
          "Toronto",
          "small-business"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this giant bubble of carbon dioxide is presented as a battery capable of storing 20 megawatts of power for about 8 hours. The device is described as a way to smooth renewable energy fluctuations and help drive the global transition to clean energy.",
        "bullets": [
          "Uses a giant carbon-dioxide bubble as the energy storage medium",
          "Stores 20 megawatts of power for roughly 8 hours",
          "Implied total energy capacity ≈ 160 megawatt-hours (20 MW × 8 h)",
          "Designed to buffer fluctuating renewable generation",
          "Framed as supporting the global shift to clean energy"
        ],
        "takeaways": [
          "Provides roughly 160 MWh of multi‑hour storage capacity — relevant for load shifting and firming renewables",
          "Can help address intermittency from wind and solar for grid operators",
          "May serve as a multi‑hour backup/energy-resilience option for data centers and critical loads",
          "Should be considered in long-duration storage planning for decarbonization strategies"
        ],
        "tags": [
          "CO2",
          "carbon-dioxide",
          "energy-storage",
          "battery",
          "renewables",
          "grid",
          "innovation",
          "clean-energy",
          "ieee"
        ]
      }
    },
    {
      "id": "OINppmPan0o",
      "title": "Figure Skating | Making Team USA presented by Xfinity with Apolo Ohno",
      "channel": "Team USA",
      "published_at": "2026-01-16T19:30:36.000Z",
      "url": "https://www.youtube.com/watch?v=OINppmPan0o",
      "thumbnail": "https://i.ytimg.com/vi/OINppmPan0o/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, figure skating duo Vadym Kolesnik and Emilia Zingas sit down with Apolo Ohno on an episode of Making Team USA presented by Xfinity ahead of the Winter Olympics. The episode is framed around the theme \"Built on trust.\"",
        "bullets": [
          "Features Vadym Kolesnik and Emilia Zingas, a figure skating duo.",
          "Interview conducted by Olympian Apolo Ohno.",
          "Airs as part of Making Team USA presented by Xfinity.",
          "Set in the lead-up to the Winter Olympics.",
          "Theme highlighted: \"Built on trust.\""
        ],
        "takeaways": [
          "Emphasizing trust and teamwork in short profiles can reinforce organizational culture and stakeholder confidence.",
          "Human-centered, timely storytelling (e.g., profiles ahead of major events) is effective for audience engagement and messaging.",
          "Partnering with recognizable spokespeople can increase visibility for key communications and campaigns."
        ],
        "tags": [
          "figure skating",
          "Vadym Kolesnik",
          "Emilia Zingas",
          "Apolo Ohno",
          "Making Team USA",
          "Xfinity",
          "Winter Olympics",
          "trust",
          "interview"
        ]
      }
    },
    {
      "id": "RalzsofAYHM",
      "title": "29-year-old spent $20,000 to open a store in New York — now it brings in $1.6 million a year",
      "channel": "CNBC Make It",
      "published_at": "2026-01-16T17:00:48.000Z",
      "url": "https://www.youtube.com/watch?v=RalzsofAYHM",
      "thumbnail": "https://i.ytimg.com/vi/RalzsofAYHM/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Abby Price started Abbode as a Parsons graduate student, selling dried floral arrangements on Facebook in 2019 and later opened a Nolita storefront in March 2022. She had enough cashflow from the store to buy a $15,000 embroidery machine on a whim, and for a year the secret to her success sat covered in dust in the shop’s basement.",
        "bullets": [
          "Founded Abbode while a Parsons School of Design grad student.",
          "Sold dried floral arrangements to New York locals via Facebook beginning in 2019.",
          "Opened a storefront in Nolita by March 2022 selling bouquets and home decor.",
          "Store cashflow financed a $15,000 embroidery machine purchased impulsively.",
          "An important asset or ‘secret’ remained unused in the shop’s basement for a year."
        ],
        "takeaways": [
          "Track and inventory physical assets — idle equipment can represent untapped value or sunk cost.",
          "Strong cashflow can enable capital purchases without external financing; monitor operating income to support growth.",
          "Physical location and direct-to-consumer channels can drive revenue streams that justify equipment investment."
        ],
        "tags": [
          "Abby Price",
          "Abbode",
          "Parsons School of Design",
          "dried florals",
          "Nolita",
          "storefront",
          "embroidery machine",
          "small business",
          "cashflow",
          "home decor"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… W podcaście KPMG ON AIR eksperci z Zespołu ds. Cen Transferowych omawiają zastosowania AI w obszarze cen transferowych, m.in. monitorowanie rentowności, benchmarki i automatyzację dokumentacji. Dyskusja porusza też ryzyka (dane, bezpieczeństwo, RODO), potrzebę integracji z systemami ERP oraz pierwsze kroki wdrożeniowe i organizacyjne.",
        "bullets": [
          "AI wspiera monitorowanie rentowności, analizy porównawcze i automatyzację dokumentacji cen transferowych.",
          "Sztuczna inteligencja wzmacnia pracę doradców, ale ich nie zastąpi.",
          "Ryzyka obejmują ochronę danych, bezpieczeństwo i zjawisko 'halucynacji' modeli AI.",
          "Digital Gateway przedstawiony jako bezpieczne środowisko pracy z AI.",
          "Kluczowe kroki wdrożeniowe: integracja z ERP oraz uporządkowanie procesów i rozwój kompetencji."
        ],
        "takeaways": [
          "Zapewnienie bezpiecznego środowiska (np. Digital Gateway) jest priorytetem przy uruchamianiu obciążeń AI związanych z podatkami.",
          "Niezbędna jest ścisła polityka danych i zgodność z RODO — infrastruktura musi wspierać zarządzanie i ochronę danych.",
          "Integracja systemów ERP z rozwiązaniami AI wymaga stabilnej, wydajnej i sterowalnej platformy IT.",
          "Automatyzacja dokumentacji i monitoringu stawia wymogi na dostępność i niezawodność środowiska przetwarzania.",
          "Wsparcie dla rozwoju kompetencji użytkowników i porządkowanie procesów ułatwia wdrożenie i zwiększa efektywność rozwiązań AI."
        ],
        "tags": [
          "podatki",
          "AI",
          "ceny transferowe",
          "transfer pricing",
          "RODO",
          "Digital Gateway",
          "automatyzacja",
          "ERP",
          "bezpieczeństwo danych",
          "monitorowanie rentowności"
        ]
      }
    },
    {
      "id": "dGfcT63U7Mo",
      "title": "The 2026 U.S. Olympic Figure Skating Team 🇺🇸",
      "channel": "Team USA",
      "published_at": "2026-01-15T20:43:24.000Z",
      "url": "https://www.youtube.com/watch?v=dGfcT63U7Mo",
      "thumbnail": "https://i.ytimg.com/vi/dGfcT63U7Mo/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… this video highlights the U.S. Olympic figure skating lineup. The brief note and #WinterOlympics tag present the lineup with an enthusiastic tone (🔥).",
        "bullets": [
          "Video focuses on the U.S. Olympic figure skating lineup.",
          "Description is very short and uses a fire emoji to convey excitement.",
          "Includes the hashtag #WinterOlympics.",
          "No transcript is available and no additional details are provided."
        ],
        "takeaways": [
          "Minimal metadata prevents accurate assessment of storage, bitrate, and streaming needs—fetch the video file to size resources correctly.",
          "Content tied to the Winter Olympics may drive time-bound traffic spikes; monitor and provision CDN capacity around event windows.",
          "Add full metadata and a transcript/captions to improve discoverability, accessibility, and caching/edge routing decisions.",
          "Tagging and descriptive details should be standardized to support search, analytics, and automated processing."
        ],
        "tags": [
          "U.S.",
          "Olympic",
          "Figure Skating",
          "lineup",
          "WinterOlympics",
          "🔥"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Microsoft Copilot is presented as a way to keep momentum by stacking small wins. It applies to workouts, projects, and personal goals, emphasizing steady progress to sustain motivation.",
        "bullets": [
          "Encourages stacking small wins to maintain momentum",
          "Intended for use across workouts, projects, and personal goals",
          "Focuses on steady, incremental progress",
          "Positioned as a motivational/productivity aid"
        ],
        "takeaways": [
          "Break large data center or grid projects into small, trackable wins to preserve momentum and visibility.",
          "Leverage assistance tools (like Copilot) to keep routine tasks moving and free staff for higher‑value work.",
          "Prioritize consistent, incremental operational improvements to reduce risk and sustain long‑term performance.",
          "Track and recognize small achievements to maintain team morale during long migrations or upgrades."
        ],
        "tags": [
          "Microsoft Copilot",
          "Copilot",
          "productivity",
          "momentum",
          "small wins",
          "workouts",
          "projects",
          "personal goals",
          "motivation",
          "habit-building"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights how the Dell PowerEdge R770AP server powered by Intel® Xeon® 6 processors delivers the precision and speed needed for high-frequency trading, enabling hundreds of trades in seconds to help maximize gains and minimize losses. It positions Intel Xeon 6 CPUs as a high-performance technology shaping the future of finance and directs viewers to Intel Business for additional IT resources.",
        "bullets": [
          "Focus: high-frequency trading use case requiring precision and speed.",
          "Hardware: Dell PowerEdge R770AP server with Intel® Xeon® 6 processors.",
          "Benefit: enables hundreds of trades in seconds to help maximize gains and minimize losses.",
          "Positioning: Intel Xeon 6 CPUs presented as defining the future of finance through high performance.",
          "Calls to action: subscribe and visit Intel Business for resources and guidance."
        ],
        "takeaways": [
          "Low-latency workloads like HFT emphasize the need for high CPU performance and precision.",
          "Decision-makers should evaluate server platforms such as the Dell PowerEdge R770AP with Intel Xeon 6 for HFT deployments.",
          "The described solution claims the ability to handle hundreds of trades in seconds—factor such performance targets into capacity and network planning.",
          "Leverage Intel Business resources for implementation guidance and IT planning support."
        ],
        "tags": [
          "high-frequency trading",
          "HFT",
          "Dell PowerEdge R770AP",
          "Intel Xeon 6",
          "servers",
          "low-latency",
          "finance",
          "data center",
          "performance",
          "Intel Business"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video presents Copilot as a tool that \"brought [the] creative spark\" back to life. It delivers a brief promotional call to action inviting viewers to download Copilot and try it via the link in the bio.",
        "bullets": [
          "States: \"The creative spark was out. Copilot brought it back to life.\"",
          "Direct call to action: \"Download Copilot & try it for yourself at link in bio.\"",
          "Very short promotional message with no additional features or details provided",
          "Transcript not available; summary based solely on the description text"
        ],
        "takeaways": [
          "Messaging positions Copilot as a creativity-restoring tool that teams might consider for idea generation or creative work support",
          "The video’s primary objective is promotion and trial — a low-effort entry point (download link) for evaluating the product",
          "Decision-makers should note the marketing focus on creativity when assessing fit for teams that need creative assistance",
          "Lacks technical or deployment details, so any procurement or infrastructure decisions will require further investigation"
        ],
        "tags": [
          "Copilot",
          "creativity",
          "AI",
          "download",
          "promo",
          "Microsoft",
          "video",
          "call-to-action",
          "marketing"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, NVIDIA highlights the open-world martial arts RPG Where Winds Meet running with DLSS 4 featuring Multi Frame Generation and #RTXOn. The short promo encourages experiencing the game with NVIDIA RTX enabled and credits @DigitalDreamsyt for the video.",
        "bullets": [
          "Open-world martial arts RPG: Where Winds Meet",
          "Showcases DLSS 4 with Multi Frame Generation",
          "Promoted with #RTXOn (RTX enabled visuals)",
          "Encourages experiencing the title with NVIDIA technology",
          "Video credited to @DigitalDreamsyt"
        ],
        "takeaways": [
          "Supporting games using DLSS 4 with Multi Frame Generation implies the need to provision hardware that is compatible with DLSS 4 features.",
          "Titles marketed with #RTXOn indicate demand for ray-tracing-capable GPUs in demonstration, streaming, or hosting environments.",
          "Validate driver and SDK compatibility for DLSS 4 and RTX features when planning deployments or infrastructure upgrades.",
          "Plan GPU capacity and provisioning for showcasing or streaming RTX-enabled titles to meet performance and visual-quality expectations."
        ],
        "tags": [
          "WhereWindsMeet",
          "DLSS4",
          "MultiFrameGeneration",
          "RTXOn",
          "open-world",
          "martial-arts",
          "NVIDIA",
          "GeForce",
          "DigitalDreamsyt",
          "gaming"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this Intel Business video features Taha Khalifa and is hosted on the Intel Business YouTube channel. The channel positions itself as a hub for IT resources, guidance, and expert insights covering projects from data centers to devices, and includes links to subscribe and follow on social platforms.",
        "bullets": [
          "Title: Taha Khalifa (Intel) | Intel Business on the Intel Business channel",
          "No transcript is available for the video",
          "Channel offers resources, guidance, and expert insights for IT projects across data centers and devices",
          "Includes subscribe link and links to Intel Business website and social profiles",
          "Connect options listed: website, X (Twitter), LinkedIn, Facebook, and YouTube channel"
        ],
        "takeaways": [
          "Intel Business is presented as a centralized resource for data center and IT project guidance—visit the channel for relevant materials.",
          "Subscribe and follow the listed social channels to receive ongoing expert insights and updates for IT initiatives.",
          "Use the Intel Business website and social links provided to access additional resources or connect with Intel for further support."
        ],
        "tags": [
          "Intel",
          "Intel Business",
          "Taha Khalifa",
          "data center",
          "IT resources",
          "enterprise IT",
          "subscribe",
          "technology",
          "YouTube"
        ]
      }
    },
    {
      "id": "kSocjh8PZnQ",
      "title": "Rynek dóbr luksusowych w obliczu transformacji | Andrzej Marczak, Tomasz Wiśniewski",
      "channel": "KPMG Poland",
      "published_at": "2026-01-13T10:23:31.000Z",
      "url": "https://www.youtube.com/watch?v=kSocjh8PZnQ",
      "thumbnail": "https://i.ytimg.com/vi/kSocjh8PZnQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The KPMG ON AIR episode with Andrzej Marczak and Tomasz Wiśniewski examines shifts in the luxury-goods market—highlighting experience-led consumption, rising ESG expectations, the rise of “affordable luxury,” and a concentrated customer base where 2% of the wealthiest clients account for 40% of the market. The conversation also covers personalization, Gen Z preferences, luxury in hospitality and film, Poland’s growing but fragmented market, the art scene and tourism, and future drivers such as AI, craftsmanship and human-centric service.",
        "bullets": [
          "Global trends: 'luxury fatigue' and growth of 'affordable luxury'.",
          "Market concentration: top 2% of clients represent ~40% of the market.",
          "Shift toward experiences, personalization and Gen Z preference for experiences over ownership.",
          "ESG and responsible luxury (e.g., eco-leathers, certifications) gaining importance.",
          "Poland: growing but fragmented market; luxury tourism, art market and future drivers like AI and craftsmanship noted."
        ],
        "takeaways": [
          "Anticipate increased digital and AI-driven workloads to support personalized luxury experiences—plan scalable compute capacity.",
          "ESG focus in luxury implies stronger demand for low-carbon power and sustainability certifications—prioritize renewable energy integration and energy-efficient design.",
          "Growth in Poland’s luxury tourism and hospitality suggests opportunities for regional edge sites and high-reliability connectivity for hotels and premium services.",
          "High market concentration (2% → 40%) indicates demand for premium SLAs, security and bespoke hosting offerings for high-value clients."
        ],
        "tags": [
          "luxury",
          "ESG",
          "Poland",
          "AI",
          "personalization",
          "luxury-tourism",
          "affordable-luxury",
          "art-market",
          "KPMG",
          "hospitality"
        ]
      }
    }
  ]
}