{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-22T02:41:15.168Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "t33Fh1JZVgA",
      "title": "AI at Speed: From Investment to Performance",
      "channel": "PwC US",
      "published_at": "2026-01-21T22:48:29.000Z",
      "url": "https://www.youtube.com/watch?v=t33Fh1JZVgA",
      "thumbnail": "https://i.ytimg.com/vi/t33Fh1JZVgA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… At the 2026 World Economic Forum in Davos, PwC US Senior Partner and CEO Paul Griggs discusses with CNBC’s Emma Crosby how organizations are shifting from AI exploration to execution by applying investment discipline and focusing on measurable performance and value. The conversation highlights that leading organizations move early, place capital with intent, and design operating models that preserve resilience without sacrificing performance as AI delivers measurable outcomes today and enables future transformation.",
        "bullets": [
          "Shift from AI exploration to execution with investment discipline and measurable value.",
          "Leading organizations move early and place capital with clear intent.",
          "Operating models are being designed for resilience without sacrificing performance.",
          "AI is delivering measurable outcomes today while enabling broader transformation.",
          "Discussion took place at Davos 2026 between PwC US CEO Paul Griggs and CNBC’s Emma Crosby."
        ],
        "takeaways": [
          "Evaluate AI projects by measurable performance and clear ROI before committing infrastructure spend.",
          "Prioritize early, intentional capital allocation to support AI initiatives that drive value.",
          "Design data center and grid operations to maintain resilience while meeting AI performance needs.",
          "Use demonstrable AI outcomes to justify upgrades or changes to infrastructure and operating models."
        ],
        "tags": [
          "AI",
          "investment",
          "performance",
          "measurable-value",
          "resilience",
          "operating-models",
          "Davos-2026",
          "PwC",
          "Paul-Griggs"
        ]
      }
    },
    {
      "id": "6hu7hYLiu08",
      "title": "Get Step-By-Step Fixes with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-21T20:14:00.000Z",
      "url": "https://www.youtube.com/watch?v=6hu7hYLiu08",
      "thumbnail": "https://i.ytimg.com/vi/6hu7hYLiu08/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Copilot provides real-time visual support for home projects and repairs. It can see what you see and deliver step-by-step instructions with clear guidance for issues from leaky pipes to overflowing washing machines.",
        "bullets": [
          "Real-time support for home projects and repairs.",
          "Handles a range of issues, e.g., leaky pipes and overflowing washing machines.",
          "Copilot can view the user's environment (see what you see).",
          "Provides step-by-step instructions.",
          "Focus on clear, actionable guidance."
        ],
        "takeaways": [
          "If applied to facilities or data center operations, visual, real-time guidance could enable remote troubleshooting without on-site specialists.",
          "Step-by-step instructions delivered in context may help standardize repair procedures and reduce human error during maintenance.",
          "Real-time visual assistance could shorten mean time to repair (MTTR) by guiding less-experienced staff through tasks.",
          "Such capabilities could be used for training, live support, and reducing travel/response costs for field technicians."
        ],
        "tags": [
          "Copilot",
          "Microsoft Copilot",
          "real-time assistance",
          "visual guidance",
          "step-by-step",
          "home repairs",
          "troubleshooting",
          "plumbing",
          "appliances",
          "maintenance"
        ]
      }
    },
    {
      "id": "IKkVWKdumHw",
      "title": "re:Invent 2025 - Chalk Talk - Origin management for multi-region applications with Amazon CloudFront",
      "channel": "AWS Events",
      "published_at": "2026-01-21T17:49:36.000Z",
      "url": "https://www.youtube.com/watch?v=IKkVWKdumHw",
      "thumbnail": "https://i.ytimg.com/vi/IKkVWKdumHw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this session covers origin management with Amazon CloudFront to build secure, resilient multi-region content delivery systems. It explains automatic failover with CloudFront and Route53, granular origin routing via CloudFront Functions, origin security options (S3 with Origin Access Control and VPC private origins), hybrid integration with AWS Direct Connect, and using Origin Shield to optimize cache performance and reduce origin load.",
        "bullets": [
          "Automatic failover patterns using CloudFront together with Route53",
          "Granular origin routing implemented with CloudFront Functions",
          "Securing origins via S3 Origin Access Control and VPC private origins",
          "Hybrid integration of on-premises infrastructure through AWS Direct Connect",
          "Origin Shield to improve cache efficiency and lower origin load"
        ],
        "takeaways": [
          "Improved uptime: automatic failover increases resilience for multi-region delivery",
          "Better control: granular routing lets operators direct traffic precisely to chosen origins",
          "Enhanced security: OAC and VPC private origins reduce direct origin exposure",
          "Hybrid readiness: Direct Connect enables serving on-prem resources with CloudFront",
          "Operational efficiency: Origin Shield can reduce origin load and improve cache performance"
        ],
        "tags": [
          "Amazon CloudFront",
          "Origin Management",
          "Multi-region",
          "Failover",
          "Route53",
          "CloudFront Functions",
          "Origin Access Control",
          "VPC Private Origins",
          "AWS Direct Connect",
          "Origin Shield"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer - Launching January 22!",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield launches worldwide on January 22 and the trailer highlights support for NVIDIA DLSS 4 with Multi Frame Generation. The game is a 3D real-time strategy RPG where you play the Endministrator of Endfield Industries on Talos-II; the trailer was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 Multi Frame Generation 4X Mode.",
        "bullets": [
          "Worldwide release date: January 22.",
          "Trailer emphasizes NVIDIA DLSS 4 with Multi Frame Generation (MFG).",
          "Genre: 3D real-time strategy RPG; player role: Endministrator of Endfield Industries on Talos-II.",
          "Footage captured on GeForce RTX 5080 at 4K Ultra with DLSS 4 MFG 4X Mode.",
          "Official links and social channels for Arknights: Endfield and NVIDIA GeForce provided in description."
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is featured—verify support for DLSS 4 in any hardware/software stacks used for rendering or cloud streaming.",
          "Trailer capture used an RTX 5080 at 4K Ultra—plan for RTX 50-series class GPU availability if reproducing similar high-resolution captures or demos.",
          "For cloud gaming or remote render services, ensure driver/SDK compatibility with NVIDIA DLSS 4 and MFG modes before deployment."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "NVIDIA",
          "RTX5080",
          "4K",
          "Launch",
          "RTS",
          "GeForce"
        ]
      }
    },
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video shows how Rate Insurance boosts agent efficiency using Agentforce and Gemini. The description also links to information about the Google Cloud and Salesforce partnership.",
        "bullets": [
          "Demonstrates Rate Insurance using Agentforce and Gemini to improve agent efficiency",
          "Published by the Google Cloud channel",
          "Includes a link to Google Cloud and Salesforce partnership details",
          "Focuses on agent efficiency in an insurance context",
          "Transcript not available"
        ],
        "takeaways": [
          "Review the Google Cloud + Salesforce partnership link provided to understand integration options for insurance workloads",
          "Consider evaluating Agentforce and Gemini as mentioned solutions for improving agent productivity",
          "Use the Rate Insurance example as a starting point to assess potential implications for cloud hosting, integration, and resource planning"
        ],
        "tags": [
          "Rate Insurance",
          "Agentforce",
          "Gemini",
          "Google Cloud",
          "Salesforce",
          "agent efficiency",
          "insurance",
          "partnership",
          "cloud"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Charly Stoever, a 35-year-old financial coach, has spent 18 months living out of two suitcases and living rent-free in Portland, Oregon by pet sitting full time. She brings in about $60,000 a year and is profiled in CNBC Make It's Millennial Money series.",
        "bullets": [
          "Charly Stoever is a 35-year-old financial coach.",
          "She has lived rent-free in Portland, Oregon by pet sitting full time.",
          "She lived out of two suitcases for the last 18 months.",
          "Her annual income from this lifestyle is about $60,000.",
          "This story is part of CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "Mobile, low-overhead lifestyles funded by flexible work suggest increasing numbers of users who rely on consistent, remote digital access.",
          "Diverse, nontraditional income streams (e.g., pet sitting plus coaching) indicate demand for secure, scalable online platforms and payment systems.",
          "Distributed, location-independent workers may require data centers and grids to prioritize reliability and edge connectivity to support users on the move."
        ],
        "tags": [
          "pet sitting",
          "rent-free",
          "financial coach",
          "travel lifestyle",
          "Portland",
          "$60,000",
          "CNBC Make It",
          "Millennial Money"
        ]
      }
    },
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Dr. Anna Chacon, 39, is a Miami-based dermatologist who runs her own private practice. Her reported net worth is about $6 million, comprised of $3.2 million in investments, a $1.9 million home, and a $1.1 million office building.",
        "bullets": [
          "Dr. Anna Chacon, age 39, lives in Miami, FL.",
          "She is a dermatologist with her own private practice.",
          "Reported net worth: approximately $6 million.",
          "Net worth breakdown: $3.2M investments, $1.9M home, $1.1M office building.",
          "Description contains no transcript or additional details."
        ],
        "takeaways": [
          "Content centers on an individual's personal finances, not infrastructure or technology.",
          "No information on energy use, facilities, or operational needs is provided.",
          "The description is not actionable for grid or data center capacity or planning decisions."
        ],
        "tags": [
          "dermatologist",
          "Miami",
          "private practice",
          "net worth",
          "investments",
          "real estate",
          "office building",
          "personal finance",
          "CNBC Make It",
          "high net worth"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, a giant bubble of carbon dioxide can store 20 megawatts of energy. The description says these new batteries are intended to manage renewable energy fluctuations and help power a global shift to clean energy.",
        "bullets": [
          "Giant bubble of carbon dioxide stores 20 megawatts of energy.",
          "Designed to address fluctuations in renewable energy generation.",
          "Presented as a battery technology to support the transition to clean energy globally.",
          "Framed in the context of innovation and energy-storage advancement."
        ],
        "takeaways": [
          "Evaluate whether a 20 MW-scale storage option fits capacity and buffering needs for your grid or data center.",
          "Consider integrating emerging storage technologies that mitigate renewable intermittency to improve reliability.",
          "Monitor CO2-based battery developments as potential tools for supporting clean-energy goals and operational resilience.",
          "Plan for pilot or demonstration projects to test interoperability and real-world performance before wide deployment."
        ],
        "tags": [
          "ieee",
          "tech",
          "innovation",
          "energy",
          "battery",
          "carbon-dioxide",
          "storage",
          "renewables",
          "grid",
          "clean-energy"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI już teraz zmienia podejście do cen transferowych, m.in. w monitorowaniu rentowności, analizach porównawczych oraz automatyzacji dokumentacji. Eksperci KPMG dyskutują o praktycznych zastosowaniach, ograniczeniach (AI nie zastąpi doradców) oraz ryzykach i wymogach (dane, bezpieczeństwo, RODO, halucynacje) oraz o krokach wdrożeniowych, takich jak integracja z ERP i uporządkowanie procesów.",
        "bullets": [
          "Zastosowania AI: monitoring rentowności, analizy porównawcze, automatyzacja dokumentacji cen transferowych.",
          "AI jako wsparcie doradców — ma wzmocnić, nie zastąpić ekspertów podatkowych.",
          "Główne ryzyka: jakość danych, bezpieczeństwo, RODO oraz ryzyko halucynacji modeli.",
          "Rozwiązania techniczne i bezpieczne środowiska: Digital Gateway jako przykład bezpiecznej pracy z AI.",
          "Wdrożenie: integracja z ERP, inteligentne benchmarki i uporządkowanie procesów jako pierwsze kroki."
        ],
        "takeaways": [
          "Zadbaj o jakość i zabezpieczenie danych — to warunek wiarygodnych modeli AI i zgodności z RODO.",
          "Planuj integrację AI z ERP i systemami raportowymi, aby uzyskać inteligentne benchmarki i monitoring rentowności.",
          "Rozpocznij od uporządkowania procesów przed wdrożeniem AI — to przyspiesza adopcję i redukuje ryzyko błędów.",
          "Rozważ bezpieczne środowiska pracy z AI (np. Digital Gateway) dla wrażliwych danych podatkowych.",
          "Postaw na rozwój kompetencji zespołów — AI ma zwiększać efektywność pracowników, nie ich zastępować."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "podatki",
          "KPMG",
          "automatyzacja",
          "RODO",
          "bezpieczeństwo danych",
          "ERP",
          "benchmarki",
          "Digital Gateway"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video encourages using Microsoft Copilot to keep momentum when working on workouts, projects, or personal goals. It promotes the idea of stacking small wins to sustain progress with Copilot's assistance.",
        "bullets": [
          "Targets workouts, projects, and personal goals.",
          "Emphasizes maintaining momentum over time.",
          "Advocates stacking small wins as a strategy.",
          "Positions Microsoft Copilot as the enabling tool."
        ],
        "takeaways": [
          "If Copilot helps sustain momentum on varied tasks, decision-makers can evaluate similar assistant tools to support operational consistency.",
          "Prioritizing tools that enable incremental progress may improve staff follow-through on maintenance and project work.",
          "Small, repeatable wins can be framed into workflows to boost morale and measurable progress across teams.",
          "Consider piloting assistive productivity features in targeted teams to assess practical impact on day-to-day operations."
        ],
        "tags": [
          "Microsoft Copilot",
          "momentum",
          "small wins",
          "productivity",
          "workouts",
          "projects",
          "personal goals",
          "habits"
        ]
      }
    }
  ]
}