{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-29T11:51:10.791Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "yUpQ9pWA9WE",
      "title": "Watch: Fed Chair Jerome Powell's Full News Conference | WSJ",
      "channel": "WSJ News",
      "published_at": "2026-01-29T08:28:54.000Z",
      "url": "https://www.youtube.com/watch?v=yUpQ9pWA9WE",
      "thumbnail": "https://i.ytimg.com/vi/yUpQ9pWA9WE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Federal Reserve Chair Jerome Powell speaks to reporters following the Federal Reserve's two-day policy-setting meeting. This WSJ News video presents the full news conference; no transcript is provided in the description.",
        "bullets": [
          "Full news conference with Fed Chair Jerome Powell.",
          "Event follows the Federal Reserve's two-day policy-setting meeting.",
          "Published by WSJ News on 2026-01-29.",
          "No transcript is available in the video description.",
          "Includes hashtags: #JeromePowell #Fed #WSJ."
        ],
        "takeaways": [
          "Watch the full conference to capture any official Fed messaging that could influence market expectations and financing conditions.",
          "Confirm from the conference whether the Fed announced policy actions or guidance relevant to capital costs and planning.",
          "Use Powell's remarks to inform timing for major financing, procurement, or expansion decisions for grid and data center projects.",
          "Monitor market reaction after the conference before finalizing large energy or infrastructure contracts."
        ],
        "tags": [
          "JeromePowell",
          "FederalReserve",
          "Fed",
          "MonetaryPolicy",
          "WSJ",
          "NewsConference",
          "Finance",
          "Markets",
          "DataCenters",
          "Grid"
        ]
      }
    },
    {
      "id": "feL4GUiP7Ws",
      "title": "Building Prior Authorization Systems for Healthcare Payors with Amazon Bedrock",
      "channel": "AWS Events",
      "published_at": "2026-01-29T05:43:38.000Z",
      "url": "https://www.youtube.com/watch?v=feL4GUiP7Ws",
      "thumbnail": "https://i.ytimg.com/vi/feL4GUiP7Ws/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this session shows how to leverage Amazon Bedrock foundation models to build an intelligent prior authorization system for healthcare payors that meets CMS regulatory requirements and improves operational efficiency. AWS Engineers and the AWS Generative AI Innovation Center present an architectural approach combining advanced NLP with healthcare-specific workflows to automate Local Coverage Determinations, analyze medical documentation, and produce explainable prior authorization recommendations to help meet CMS-0057-F timelines while maintaining compliance ",
        "bullets": [
          "Demonstrates building prior authorization systems using Amazon Bedrock foundation models",
          "Combines advanced natural language processing with healthcare-specific workflows",
          "Automates processing of Local Coverage Determinations (LCDs) and complex medical documentation",
          "Generates explainable prior authorization recommendations to support compliance",
          "Targets meeting CMS-0057-F timelines while improving operational efficiency and accuracy"
        ],
        "takeaways": [
          "Adopting Bedrock-based solutions can support payors in meeting CMS-0057-F timelines",
          "Integrating advanced NLP with domain workflows enables automation of LCD processing",
          "Explainable recommendations help maintain regulatory compliance and decision transparency",
          "The approach focuses on improving operational efficiency and accuracy for prior authorizations"
        ],
        "tags": [
          "Amazon Bedrock",
          "prior-authorization",
          "CMS-0057-F",
          "Local Coverage Determinations",
          "NLP",
          "healthcare",
          "AWS",
          "generative-ai",
          "compliance",
          "explainability"
        ]
      }
    },
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy AI solutions that unlocked entirely new revenue streams. Sreeni Alakappan says they leveraged GenAI and Google Cloud's infrastructure to streamline operations, boost developer productivity, and compress their digital transformation timeline.",
        "bullets": [
          "TTEC worked with Google Cloud Consulting to accelerate AI prototyping and deployment.",
          "Used GenAI alongside Google Cloud infrastructure to streamline operations.",
          "Efforts boosted developer productivity.",
          "The initiative unlocked new revenue streams for TTEC.",
          "Consulting compressed the digital transformation timeline and expanded business ambitions."
        ],
        "takeaways": [
          "Robust cloud infrastructure is foundational for faster GenAI prototyping and deployment.",
          "Engaging cloud consulting can compress transformation timelines and accelerate time-to-value.",
          "Operational streamlining and higher developer productivity can enable new revenue-generating services.",
          "Partnering with a cloud provider can help scale AI ambitions without extending internal timelines."
        ],
        "tags": [
          "googlecloud",
          "ttec",
          "genai",
          "aideployment",
          "operationalefficiency",
          "customerexperience",
          "googlecloudplatform",
          "generativeai"
        ]
      }
    },
    {
      "id": "5CyVBSbHmbA",
      "title": "Year-end toolkit: Strengthening audit committee collaboration",
      "channel": "PwC US",
      "published_at": "2026-01-27T17:20:31.000Z",
      "url": "https://www.youtube.com/watch?v=5CyVBSbHmbA",
      "thumbnail": "https://i.ytimg.com/vi/5CyVBSbHmbA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This episode of PwC’s year-end toolkit covers how finance teams can strengthen collaboration with audit committees, streamline year-end accounting and reporting, and address emerging topics such as AI oversight, enterprise risk management, cyber risk, and proxy disclosures. PwC partners Stephen Parker and Diana Stoltzfus discuss practical governance and communication priorities for boards and management as they close the year.",
        "bullets": [
          "Strengthening management/audit committee communication and collaboration (1:18).",
          "Key year-end accounting and reporting issues finance teams should be ready to address (10:10).",
          "Oversight of AI: assessing risks, opportunities, and necessary controls (15:02).",
          "Enhancing enterprise risk oversight and navigating evolving cyber risks in the age of AI (21:33, 27:35).",
          "Elevating proxy disclosures to reflect governance and year-end considerations (36:05)."
        ],
        "takeaways": [
          "Ensure audit committees receive clear, timely updates on AI initiatives and related control frameworks so board-level oversight can keep pace with operational change.",
          "Integrate AI and cyber risk considerations into enterprise risk management and year-end reporting to avoid gaps between operations and governance.",
          "Prioritize documentation and disclosure readiness (including proxy disclosures) around transformation projects and material year-end issues to support transparent governance."
        ],
        "tags": [
          "audit-committee",
          "year-end",
          "finance",
          "AI-oversight",
          "enterprise-risk",
          "cyber-risk",
          "proxy-disclosures",
          "governance",
          "PwC"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Jo discovers how Copilot Groups makes route planning easy. The short video highlights the power of Copilot Groups and includes hashtags #copilot #microsoftcopilot #ai.",
        "bullets": [
          "Jo demonstrates Copilot Groups simplifying route planning.",
          "Central message: route planning made easy.",
          "Showcases the power of Copilot Groups.",
          "Description includes tags: #copilot #microsoftcopilot #ai."
        ],
        "takeaways": [
          "If Copilot Groups simplifies route planning as described, operations teams could consider piloting it for routing and scheduling tasks.",
          "Potential to reduce time spent on route planning and coordination for field or maintenance crews.",
          "Assess how Copilot Groups might fit into existing operational workflows before broader adoption."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "copilot-groups",
          "route-planning",
          "automation",
          "logistics",
          "productivity"
        ]
      }
    }
  ]
}