{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-21T09:54:51.496Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "wicD8G0rn1Y",
      "title": "New: AWS Lambda tenant isolation | Serverless Office Hours",
      "channel": "AWS Events",
      "published_at": "2026-01-21T08:04:52.000Z",
      "url": "https://www.youtube.com/watch?v=wicD8G0rn1Y",
      "thumbnail": "https://i.ytimg.com/vi/wicD8G0rn1Y/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The video demos AWS Lambda's new tenant isolation mode for building secure multi-tenant SaaS applications, with Anton Aleksandrov and Ayush Kulkarni joining Julian Wood. It highlights dedicated per-tenant execution environments that silo cached data and execution contexts, reduce infrastructure complexity, improve scaling during traffic spikes, and provide built-in monitoring with automatic tenant identifier logging.",
        "bullets": [
          "Tenant isolation mode creates dedicated execution environments per tenant to prevent cross-tenant data exposure.",
          "Cached data and execution contexts are siloed to maintain strong isolation guarantees.",
          "Helps reduce infrastructure complexity while enabling robust security boundaries for multi-tenant SaaS.",
          "Supports faster scaling during traffic spikes without compromising isolation.",
          "Includes built-in monitoring with automatic tenant identifier logging for easier tenant-specific debugging."
        ],
        "takeaways": [
          "Stronger isolation reduces risk of cross-tenant data exposure—important for compliance and tenant trust.",
          "Simplified infrastructure can lower operational overhead when supporting many tenants.",
          "Improved scaling behavior helps maintain performance during unpredictable traffic spikes.",
          "Built-in tenant-aware logging accelerates troubleshooting of tenant-specific incidents."
        ],
        "tags": [
          "aws",
          "aws-lambda",
          "tenant-isolation",
          "serverless",
          "multi-tenant",
          "security",
          "scaling",
          "monitoring",
          "SaaS",
          "lambda"
        ]
      }
    },
    {
      "id": "jOC3G_N20lY",
      "title": "Year-end toolkit: Cash flow classification",
      "channel": "PwC US",
      "published_at": "2026-01-20T22:41:11.000Z",
      "url": "https://www.youtube.com/watch?v=jOC3G_N20lY",
      "thumbnail": "https://i.ytimg.com/vi/jOC3G_N20lY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This PwC year-end toolkit episode focuses on the statement of cash flows, covering SEC comment letter observations, practical considerations for complex transactions, and reminders and best practices for year-end reporting. Guests discuss debt restructurings, payment processing arrangements, business combinations, and an upcoming FASB project on targeted improvements to the statement of cash flows.",
        "bullets": [
          "Overview and key reminders on the statement of cash flows (1:05).",
          "SEC comment letter themes and areas of regulatory focus (3:46).",
          "Practical guidance on debt restructurings (7:52) and payment processing arrangements (15:21).",
          "Considerations for cash flow classification in business combinations (20:27).",
          "Discussion of FASB’s targeted improvements project for the statement of cash flows (32:56)."
        ],
        "takeaways": [
          "Regulatory and investor scrutiny on cash flow presentation remains high—ensure disclosures and classifications are well supported.",
          "Complex transactions (debt restructurings, payment processing arrangements, business combinations) can materially affect cash flow classification—review accounting treatment early.",
          "Use the episode’s reminders and best practices to tighten year‑end reporting processes and respond to likely SEC questions.",
          "Monitor the FASB project for potential future changes that could affect cash flow presentation and planning."
        ],
        "tags": [
          "statement of cash flows",
          "SEC comment letters",
          "debt restructuring",
          "payment processing",
          "business combinations",
          "FASB",
          "year-end reporting",
          "PwC",
          "cash flow classification",
          "accounting guidance"
        ]
      }
    },
    {
      "id": "3wQ_yte0TTo",
      "title": "Build Voice Agents with Amazon Nova 2 Sonic &amp; AgentCore | AWS Show and Tell",
      "channel": "AWS Events",
      "published_at": "2026-01-20T22:10:10.000Z",
      "url": "https://www.youtube.com/watch?v=3wQ_yte0TTo",
      "thumbnail": "https://i.ytimg.com/vi/3wQ_yte0TTo/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this AWS Show and Tell episode introduces Amazon Nova 2 Sonic and demonstrates how to build production-ready voice agents using Amazon Bedrock AgentCore and the Strands BidiAgent framework. It highlights Nova 2 Sonic features (polyglot voices, 1‑million token context windows, asynchronous tool calling), bidirectional WebSocket streaming for real-time two-way voice interactions, and hands-on Python demos with workshop code.",
        "bullets": [
          "Nova 2 Sonic: polyglot voices, 1‑million token context windows, and asynchronous tool calling.",
          "AgentCore bidirectional streaming: WebSocket-based real-time two-way communication for responsive voice agents.",
          "Strands BidiAgent integration: simplifies interruption handling and agent-to-agent collaboration patterns.",
          "Hands-on Python implementation and best practices for building production-ready voice agents.",
          "Workshop materials and code samples available on GitHub for the demo and labs."
        ],
        "takeaways": [
          "Bidirectional WebSocket streaming implies requirements for low-latency networking and support for persistent connections.",
          "1‑million token context windows and complex agent workflows can increase compute and memory demands for model hosting.",
          "Asynchronous tool calling and agent-to-agent collaboration point to the need for scalable orchestration and integration infrastructure.",
          "Polyglot voice and speech-to-speech capabilities require multilingual model support and audio processing pipelines.",
          "Available Python demos and workshop materials can accelerate developer onboarding and deployment of voice agent solutions."
        ],
        "tags": [
          "amazon-nova-2",
          "nova-2-sonic",
          "amazon-bedrock",
          "agentcore",
          "strands-bidiagent",
          "bidirectional-streaming",
          "voice-agents",
          "polyglot-voices",
          "python",
          "speech-to-speech"
        ]
      }
    },
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video shows how Rate Insurance boosts agent efficiency using Agentforce and Gemini. The description also points viewers to a Google Cloud and Salesforce partnership link for more information.",
        "bullets": [
          "Showcases Rate Insurance using Agentforce and Gemini to improve agent efficiency",
          "Includes a link to Google Cloud and Salesforce partnership information",
          "Positions the content as a demo or case study to watch",
          "Relevant for teams evaluating agent-facing technology solutions"
        ],
        "takeaways": [
          "Watch the video to see a concrete example of vendor solutions affecting front-line agent productivity",
          "Review the provided Google Cloud–Salesforce partnership link to inform decisions about cloud/CRM vendor engagement",
          "Use the case as a starting point to evaluate how third-party platforms might interact with your infrastructure and support requirements"
        ],
        "tags": [
          "Rate Insurance",
          "Agentforce",
          "Gemini",
          "Google Cloud",
          "Salesforce",
          "agent efficiency",
          "partnership",
          "insurance",
          "CRM",
          "cloud"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Charly Stoever, a 35-year-old financial coach, lives rent-free in Portland by pet sitting full time and has spent the last 18 months living out of two suitcases. She brings in about $60,000 a year, and her story appears in CNBC Make It's Millennial Money series.",
        "bullets": [
          "Charly Stoever, 35, is a financial coach living in Portland, Oregon.",
          "She lives rent-free by pet sitting full time.",
          "Has lived out of two suitcases for the past 18 months.",
          "Earns roughly $60,000 per year from this arrangement.",
          "Profiled in CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "Non-traditional, location-independent income (pet sitting) can sustain a $60k/year lifestyle over extended periods (18 months).",
          "Extended mobile living (living out of two suitcases) is being adopted by some workers, which may affect patterns of residential occupancy and service usage.",
          "Stories like this highlight shifting consumer and work behaviors among the audience covered by Millennial Money, useful for segmenting demand for energy and connectivity services."
        ],
        "tags": [
          "Charly Stoever",
          "pet sitting",
          "rent-free",
          "portable lifestyle",
          "Portland",
          "financial coach",
          "CNBC Make It",
          "Millennial Money",
          "60k income",
          "travel living"
        ]
      }
    },
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Dr. Anna Chacon, 39, is a Miami-based dermatologist who runs her own private practice and reportedly earns $900,000 a year. Her net worth is about $6 million, consisting of $3.2 million in investments, a $1.9 million home, and a $1.1 million office building.",
        "bullets": [
          "Dr. Anna Chacon is a 39-year-old dermatologist in Miami, FL.",
          "She operates her own private dermatology practice.",
          "Annual earnings reported at $900,000.",
          "Total net worth approximately $6 million.",
          "Net worth breakdown: $3.2M investments, $1.9M home, $1.1M office building."
        ],
        "takeaways": [
          "Medical practitioners who own both a practice and office property may value reliable, uninterrupted power for patient services and revenue continuity.",
          "High-earning, physician-owned practices in markets like Miami could represent localized demand for resilient infrastructure and backup power solutions.",
          "Ownership of commercial medical office space suggests potential opportunities for targeted facility-level power, cooling, or security services.",
          "Investment-backed personal wealth among professionals may support willingness to invest in premium uptime or managed infrastructure services for critical operations."
        ],
        "tags": [
          "dermatologist",
          "private practice",
          "Miami",
          "high income",
          "net worth",
          "real estate",
          "investments",
          "medical office",
          "personal finance",
          "CNBC Make It"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This giant bubble of carbon dioxide can store 20 megawatts of energy. The description frames the technology as a way to manage renewable energy variability and support the global shift to clean energy.",
        "bullets": [
          "Description highlights a CO2 'bubble' battery with 20 MW storage capacity.",
          "Framed as a solution for fluctuating renewable energy resources.",
          "Positioned as a tool to power the shift to clean energy worldwide.",
          "No transcript available for additional technical details."
        ],
        "takeaways": [
          "20 MW-scale storage could contribute to grid-level support—compare this capacity to local peak and contingency needs.",
          "Promised ability to smooth renewable variability warrants evaluation for integration with renewable assets and dispatch strategies.",
          "Assess fit for data center resilience and backup power planning, subject to detailed performance and duration specs.",
          "Request vendor technical specifications, operational metrics, and deployment timelines before making procurement or integration decisions."
        ],
        "tags": [
          "co2-battery",
          "carbon-dioxide",
          "energy-storage",
          "renewables",
          "grid-stability",
          "clean-energy",
          "innovation",
          "ieee-spectrum"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI już teraz zmienia podejście do cen transferowych — od monitorowania rentowności i benchmarków, przez automatyzację dokumentacji, po integrację z ERP. Eksperci KPMG (Monika Palmowska i Jakub Roszkiewicz) omawiają, jak wdrażać AI odpowiedzialnie, związane ryzyka (dane, bezpieczeństwo, RODO) oraz praktyczne pierwsze kroki i kompetencje potrzebne w organizacji.",
        "bullets": [
          "AI wspiera monitorowanie rentowności, analizy porównawcze i automatyzację dokumentacji cen transferowych.",
          "Dyskusja o granicach AI — technologia wzmacnia pracę doradców, ale ich nie zastąpi.",
          "Ryzyka: ochrona danych, bezpieczeństwo, halucynacje modeli i zgodność z RODO.",
          "Digital Gateway przedstawiony jako bezpieczne środowisko pracy z AI.",
          "Praktyczne wskazówki: zaczynać od uporządkowania procesów i stopniowej integracji z ERP."
        ],
        "takeaways": [
          "Zadbaj o bezpieczne środowisko do pracy z AI (np. rozwiązania typu Digital Gateway) — krytyczne dla ochrony danych centrów przetwarzania.",
          "Upewnij się, że integracja AI z ERP i systemami finansowymi odbywa się z zachowaniem zgodności RODO i standardów bezpieczeństwa.",
          "Prioritetyzuj uporządkowanie procesów i jakości danych przed szerokim wdrożeniem AI, aby uniknąć błędów i „halucynacji” modeli.",
          "Planuj szkolenia i rozwój kompetencji personelu — AI wspiera, ale wymaga nadzoru eksperckiego i nowych umiejętności."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "transfer pricing",
          "automatyzacja",
          "ERP",
          "bezpieczeństwo danych",
          "RODO",
          "KPMG",
          "podcast"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video presents Microsoft Copilot as a way to stack small wins and keep momentum when tackling workouts, projects, or personal goals. It frames Copilot as a companion for sustaining ongoing progress across different activities.",
        "bullets": [
          "Encourages stacking small wins to maintain momentum.",
          "Applies to workouts, projects, and personal goals.",
          "Positions Microsoft Copilot as a tool to keep progress going.",
          "Focuses on sustained, incremental progress rather than one-off efforts."
        ],
        "takeaways": [
          "Sustaining momentum matters for long-term or multi-phase infrastructure and operations projects.",
          "Using tools that help generate regular small wins can support team engagement and steady progress.",
          "Framing tasks as incremental goals may help keep initiatives on track over time."
        ],
        "tags": [
          "Microsoft Copilot",
          "momentum",
          "productivity",
          "small wins",
          "goals",
          "projects",
          "workouts",
          "personal development",
          "motivation",
          "progress"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the Dell PowerEdge R770AP server powered by Intel® Xeon® 6 processors provides the precision and speed needed for high-frequency trading, performing hundreds of trades in seconds to help maximize gains and minimize losses. Intel frames Xeon 6 CPUs' high-performance expertise as defining the future of finance.",
        "bullets": [
          "Highlights Dell PowerEdge R770AP paired with Intel Xeon 6 CPUs for HFT workloads.",
          "Emphasizes precision and speed as critical for high-frequency trading.",
          "Claims ability to perform hundreds of trades in seconds to maximize gains and minimize losses.",
          "Positions Intel Xeon 6 performance as shaping the future of finance.",
          "Links viewers to Intel Business resources and subscription on YouTube."
        ],
        "takeaways": [
          "For latency-sensitive trading, evaluate server platforms that emphasize precision and speed.",
          "Consider Dell PowerEdge R770AP with Intel Xeon 6 processors for high-frequency trading deployments.",
          "Measure trading throughput and latency under real workloads to verify the \"hundreds of trades in seconds\" capability.",
          "Leverage vendor resources (Intel Business) for guidance and technical information when planning finance-focused infrastructure."
        ],
        "tags": [
          "high-frequency-trading",
          "HFT",
          "Intel-Xeon-6",
          "Dell-PowerEdge-R770AP",
          "low-latency",
          "trading",
          "finance",
          "data-center",
          "servers",
          "Intel-Business"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video presents Copilot as reviving a lost creative spark. It invites viewers to download Copilot and try it via the link in the bio.",
        "bullets": [
          "Copilot is framed as restoring creativity.",
          "Promotional call-to-action to download and try the app.",
          "Directs viewers to the link in the bio for access.",
          "Short, inspirational promotional message."
        ],
        "takeaways": [
          "If teams are facing creative blocks, the description claims Copilot can help restore creative momentum—consider piloting it for ideation tasks.",
          "The clear call-to-action and easy-access link suggest a low-friction way to evaluate Copilot quickly.",
          "Promotional focus on creativity implies potential value for improving team productivity and problem-solving workflows—assess fit for design/operations use cases."
        ],
        "tags": [
          "Copilot",
          "Microsoft",
          "creativity",
          "AI",
          "productivity",
          "download",
          "inspiration",
          "call-to-action",
          "link-in-bio"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video showcases the open-world martial arts RPG Where Winds Meet running with NVIDIA DLSS 4 and Multi Frame Generation, highlighting RTX-on visuals. Footage for the clip is credited to @DigitalDreamsyt.",
        "bullets": [
          "Game: Where Winds Meet — open-world martial arts RPG",
          "Features NVIDIA DLSS 4 with Multi Frame Generation",
          "Promotes #RTXOn visual enhancements",
          "Video footage credited to @DigitalDreamsyt"
        ],
        "takeaways": [
          "Showcases DLSS 4 with Multi Frame Generation — relevant when evaluating GPU platforms that support NVIDIA’s latest upscaling/inference features.",
          "Emphasis on #RTXOn visuals signals demand for GPUs capable of real-time ray tracing and advanced rendering workloads.",
          "Teams delivering high-fidelity, real-time visuals (streaming, remote rendering, demos) should consider hardware/software stacks that support DLSS 4 and RTX features.",
          "Content creators and visualization deployments may prioritize provisioning for GPU acceleration to reproduce similar RTX-enabled experiences."
        ],
        "tags": [
          "WhereWindsMeet",
          "DLSS4",
          "MultiFrameGeneration",
          "RTXOn",
          "NVIDIAGeForce",
          "open-world",
          "martial-arts",
          "gaming",
          "DigitalDreamsyt"
        ]
      }
    }
  ]
}