{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-29T09:04:31.467Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "yUpQ9pWA9WE",
      "title": "Watch: Fed Chair Jerome Powell's Full News Conference | WSJ",
      "channel": "WSJ News",
      "published_at": "2026-01-29T08:28:54.000Z",
      "url": "https://www.youtube.com/watch?v=yUpQ9pWA9WE",
      "thumbnail": "https://i.ytimg.com/vi/yUpQ9pWA9WE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Federal Reserve Chair Jerome Powell speaks to reporters following the Federal Reserve's two-day policy-setting meeting. The video is WSJ News's recording of Powell's post-meeting news conference.",
        "bullets": [
          "Video features Fed Chair Jerome Powell speaking to reporters after a two-day policy-setting meeting.",
          "Posted by WSJ News on 2026-01-29.",
          "No transcript is provided in the video description.",
          "Description includes hashtags: #JeromePowell #Fed #WSJ."
        ],
        "takeaways": [
          "Watch the full conference as a primary source for the Fed's official post-meeting communications.",
          "Record the date and use the remarks as an input when reviewing financing, investment, and budgeting decisions.",
          "Archive or timestamp relevant segments for internal briefings and compliance records.",
          "Use the video alongside official Fed releases to inform stakeholder updates and timing of operational reviews."
        ],
        "tags": [
          "Jerome Powell",
          "Federal Reserve",
          "Policy Meeting",
          "News Conference",
          "WSJ News",
          "Fed Chair",
          "Press Briefing"
        ]
      }
    },
    {
      "id": "feL4GUiP7Ws",
      "title": "Building Prior Authorization Systems for Healthcare Payors with Amazon Bedrock",
      "channel": "AWS Events",
      "published_at": "2026-01-29T05:43:38.000Z",
      "url": "https://www.youtube.com/watch?v=feL4GUiP7Ws",
      "thumbnail": "https://i.ytimg.com/vi/feL4GUiP7Ws/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this technical session demonstrates how to leverage Amazon Bedrock foundation models to build an intelligent prior authorization system for healthcare payors. It outlines a comprehensive architecture combining advanced NLP with healthcare-specific workflows to automate Local Coverage Determinations, analyze medical documentation, and produce explainable prior authorization recommendations while meeting CMS regulatory timelines.",
        "bullets": [
          "Uses Amazon Bedrock foundation models to power prior authorization workflows.",
          "Presents an architectural approach combining advanced NLP and healthcare-specific processes.",
          "Shows automated processing of Local Coverage Determinations (LCDs) and complex medical documents.",
          "Emphasizes generating explainable prior authorization recommendations.",
          "Frames solution to help payors meet CMS-0057-F timelines while maintaining compliance and accuracy."
        ],
        "takeaways": [
          "Plan infrastructure and integration to support foundation-model-driven NLP workloads for prior authorization.",
          "Ensure systems can ingest and accurately analyze complex medical documentation and LCDs.",
          "Prioritize explainability and compliance controls to meet CMS-0057-F regulatory requirements.",
          "Leverage workflow automation to materially improve operational efficiency in payer authorization processes."
        ],
        "tags": [
          "Amazon Bedrock",
          "prior authorization",
          "healthcare payors",
          "CMS-0057-F",
          "local coverage determinations",
          "NLP",
          "explainability",
          "workflow automation",
          "AWS Generative AI Innovation Center",
          "compliance"
        ]
      }
    },
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy GenAI solutions that unlocked new revenue streams while streamlining operations. Sreeni Alakappan says TTEC leveraged Google Cloud's infrastructure to boost developer productivity and compress their digital transformation timeline.",
        "bullets": [
          "TTEC, a leader in customer experience technology and services, partnered with Google Cloud Consulting.",
          "They rapidly prototyped and deployed GenAI solutions to unlock entirely new revenue streams.",
          "Google Cloud's infrastructure was used to streamline operations and boost developer productivity.",
          "Google Cloud Consulting helped compress TTEC's digital transformation timeline.",
          "The project expanded what TTEC views as possible for their business."
        ],
        "takeaways": [
          "Cloud consulting can accelerate prototyping and deployment, shortening transformation timelines.",
          "Deploying GenAI on robust cloud infrastructure can streamline operations and raise developer productivity.",
          "Accelerated AI deployment can enable new revenue streams and expand business ambitions."
        ],
        "tags": [
          "googlecloud",
          "ttec",
          "genai",
          "aideployment",
          "operationalefficiency",
          "customerexperience",
          "googlecloudplatform",
          "generativeai",
          "consulting"
        ]
      }
    },
    {
      "id": "5CyVBSbHmbA",
      "title": "Year-end toolkit: Strengthening audit committee collaboration",
      "channel": "PwC US",
      "published_at": "2026-01-27T17:20:31.000Z",
      "url": "https://www.youtube.com/watch?v=5CyVBSbHmbA",
      "thumbnail": "https://i.ytimg.com/vi/5CyVBSbHmbA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This episode of PwC’s year-end toolkit focuses on strengthening collaboration between finance teams and audit committees during the year-end accounting and reporting process. It covers improving management/committee communication, key year-end issues, and emerging oversight areas including AI, enterprise risk management, cyber risk in the age of AI, transformation initiatives, and proxy disclosures.",
        "bullets": [
          "Strengthening management/audit committee communication and collaboration",
          "Preparing for key year-end accounting and reporting issues",
          "Oversight of AI: assessing risks, opportunities, and controls",
          "Enhancing enterprise risk oversight and addressing evolving cyber risk in the age of AI",
          "Elevating and streamlining proxy disclosures"
        ],
        "takeaways": [
          "Brief the audit committee on AI-related risks, opportunities, and control frameworks as part of year-end reporting",
          "Include AI-driven cyber risk assessments in enterprise risk updates provided to governance",
          "Communicate the financial and control impacts of transformation initiatives to the audit committee ahead of year-end decisions",
          "Ensure proxy disclosures reflect governance oversight and key year-end risk considerations"
        ],
        "tags": [
          "audit committee",
          "year-end",
          "accounting",
          "reporting",
          "AI oversight",
          "enterprise risk",
          "cyber risk",
          "proxy disclosures",
          "governance",
          "PwC"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights how Copilot Groups makes route planning easier as Jo discovers its capabilities. It positions Microsoft Copilot and AI as tools for simplifying planning tasks.",
        "bullets": [
          "Focuses on route planning made easy.",
          "Centers on Copilot Groups and a user named Jo discovering its power.",
          "Associated with Microsoft Copilot and AI branding.",
          "Implied demonstration of Copilot Groups' usefulness for planning tasks."
        ],
        "takeaways": [
          "Explore Copilot Groups for route planning needs in field operations and logistics.",
          "Consider whether Copilot Groups can simplify scheduling and team coordination for maintenance crews.",
          "Evaluate integration requirements with existing operational systems before deployment.",
          "Pilot the tool with a small team to measure potential efficiency gains for routing workflows."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "copilot-groups",
          "route-planning",
          "logistics",
          "team-collaboration",
          "productivity"
        ]
      }
    }
  ]
}