{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-22T10:54:58.529Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "IKkVWKdumHw",
      "title": "re:Invent 2025 - Chalk Talk - Origin management for multi-region applications with Amazon CloudFront",
      "channel": "AWS Events",
      "published_at": "2026-01-22T08:10:48.000Z",
      "url": "https://www.youtube.com/watch?v=IKkVWKdumHw",
      "thumbnail": "https://i.ytimg.com/vi/IKkVWKdumHw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this session covers comprehensive origin management techniques for Amazon CloudFront to build secure and resilient content delivery systems. It explains automatic failover with CloudFront and Route 53, granular origin routing with CloudFront Functions, origin security (S3 OAC and VPC private origins), hybrid integration via AWS Direct Connect, and performance optimization with Origin Shield.",
        "bullets": [
          "Configure automatic failover between origins using CloudFront and Amazon Route 53.",
          "Implement granular origin routing and request handling with CloudFront Functions.",
          "Secure origins using S3 with Origin Access Control (OAC) and VPC private origins.",
          "Integrate on-premises infrastructure through AWS Direct Connect for hybrid deployments.",
          "Use Origin Shield to improve cache performance and reduce load on origin servers."
        ],
        "takeaways": [
          "Reduce downtime risk — automatic failover between origins improves resilience for critical services.",
          "Gain precise traffic control — granular routing lets you direct requests based on logic or locality.",
          "Limit attack surface and unauthorized access — OAC and VPC private origins strengthen origin security.",
          "Enable hybrid architectures — Direct Connect provides a consistent, secure path to on-prem systems.",
          "Lower origin load and bandwidth costs — Origin Shield centralizes cache hits to protect backend infrastructure."
        ],
        "tags": [
          "Amazon CloudFront",
          "Origin Management",
          "Origin Shield",
          "CloudFront Functions",
          "Route 53",
          "Origin Access Control",
          "VPC Private Origins",
          "AWS Direct Connect",
          "Hybrid Architectures",
          "Content Delivery"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI w audycie to już codzienność — KPMG przedstawia praktyczne zastosowania narzędzi takich jak AI Transaction Scoring Tool i Clara AI (asystent konwersacyjny oraz wyspecjalizowani agenci) wraz z platformą KPMG Clara do zarządzania badaniem w czasie rzeczywistym. Omówione są korzyści dla klientów (analiza pełnych populacji, automatyzacja dokumentacji, lepsza komunikacja), zmiana roli audytora, wymagane kompetencje oraz wyzwania związane z wdrożeniem, bezpieczeństwem danych i regulacjami.",
        "bullets": [
          "AI Transaction Scoring Tool pozwala na analizę pełnych populacji zamiast próbkowania.",
          "Clara AI — konwersacyjny asystent i agenci wspierają analizy, dokumentację i ujawnienia.",
          "KPMG Clara zarządza badaniem w czasie rzeczywistym; Clara for Clients usprawnia komunikację z klientem.",
          "W audycie rośnie znaczenie kompetencji technologicznych; wdrożenia wiążą się z wyzwaniami adaptacyjnymi.",
          "Poruszono też kwestie bezpieczeństwa danych, środowiska regulacyjnego i potencjalnych zagrożeń AI."
        ],
        "takeaways": [
          "Pełna analiza populacji może ujawnić ryzyka i anomalie w operacjach centrum danych, które próbkowanie może przeoczyć.",
          "Real‑time audit management ułatwia szybsze potwierdzanie zgodności operacyjnej i reagowanie na incydenty.",
          "Przed udostępnieniem danych audytorom warto upewnić się, że platformy i procesy spełniają wymagania bezpieczeństwa i regulacyjne.",
          "Inwestycja w kompetencje zespołu (narzędzia AI, analiza danych) zwiększy efektywność współpracy z audytorami i skróci czas audytu.",
          "Wybierając dostawców/partnerów audytu, sprawdź możliwości integracji klient‑platforma oraz zakres automatyzacji i raportowania."
        ],
        "tags": [
          "audyt",
          "sztuczna-inteligencja",
          "kpmg-clara",
          "clara-ai",
          "analiza-danych",
          "bezpieczeństwo-danych",
          "regulacje",
          "innowacje"
        ]
      }
    },
    {
      "id": "t33Fh1JZVgA",
      "title": "AI at Speed: From Investment to Performance",
      "channel": "PwC US",
      "published_at": "2026-01-21T22:48:29.000Z",
      "url": "https://www.youtube.com/watch?v=t33Fh1JZVgA",
      "thumbnail": "https://i.ytimg.com/vi/t33Fh1JZVgA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Paul Griggs and CNBC’s Emma Crosby discuss at Davos how organizations are shifting AI from exploration to execution, assessing initiatives through investment discipline, performance, and measurable value. They note leading organizations move early, place capital with intent, and design resilient operating models that preserve performance while AI delivers measurable outcomes today and supports future transformation.",
        "bullets": [
          "AI being evaluated through investment discipline, performance, and measurable value.",
          "Organizations moving from exploration to execution on AI initiatives.",
          "Leaders are placing capital early and with clear intent.",
          "Operating models are being designed for resilience without sacrificing performance.",
          "AI delivers measurable outcomes today and supports longer-term transformation."
        ],
        "takeaways": [
          "Prioritize investment decisions with clear metrics to track AI ROI for infrastructure upgrades.",
          "Allocate capital early to secure capabilities and avoid lagging in performance-sensitive operations.",
          "Design resilient operating models that maintain availability and performance during AI adoption.",
          "Measure and report AI-driven outcomes to justify data center capacity and modernization plans."
        ],
        "tags": [
          "AI",
          "investment",
          "performance",
          "measurable-value",
          "operating-models",
          "resilience",
          "Davos2026",
          "PwC"
        ]
      }
    },
    {
      "id": "6hu7hYLiu08",
      "title": "Get Step-By-Step Fixes with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-21T20:14:00.000Z",
      "url": "https://www.youtube.com/watch?v=6hu7hYLiu08",
      "thumbnail": "https://i.ytimg.com/vi/6hu7hYLiu08/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Copilot provides real-time visual support for home projects and repairs by seeing what you see and delivering step-by-step instructions. It aims to give clear, actionable guidance for issues like leaky pipes and overflowing washing machines to help users fix problems efficiently.",
        "bullets": [
          "Real-time visual assistance that observes the user’s view and offers guidance.",
          "Step-by-step instructions for common household repairs (e.g., plumbing, appliances).",
          "Targets problems such as leaky pipes and overflowing washing machines.",
          "Designed to provide clear, actionable guidance to support DIY troubleshooting.",
          "Positions Copilot as a remote aid to help resolve issues without immediate expert presence."
        ],
        "takeaways": [
          "Remote visual troubleshooting could reduce the need for immediate on-site technician dispatch for routine issues.",
          "Faster guided resolution of common problems may lower operational downtime and maintenance costs.",
          "Field teams and contractors may benefit from incorporating assistive visual tools into their workflows.",
          "Facilities and data center managers should assess how visual-guidance tools might integrate with existing maintenance and incident-response processes."
        ],
        "tags": [
          "Copilot",
          "real-time support",
          "visual assistance",
          "home repairs",
          "troubleshooting",
          "step-by-step",
          "remote assistance",
          "DIY",
          "maintenance"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer - Launching January 22!",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield launches worldwide on January 22 and the trailer highlights NVIDIA DLSS 4 with Multi Frame Generation. The footage was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 Multi Frame Generation 4X Mode.",
        "bullets": [
          "Release date: January 22 worldwide.",
          "Game type: 3D real-time strategy RPG where you play the Endministrator across Talos-II.",
          "Trailer emphasizes NVIDIA DLSS 4 with Multi Frame Generation (link provided).",
          "Captured on GeForce RTX 5080 at 4K Ultra with DLSS 4 MFG 4X Mode.",
          "Description includes official game site and social links for Arknights: Endfield and NVIDIA GeForce."
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is being used in a shipping title—check DLSS 4 support and deployment requirements for relevant workloads.",
          "Trailer capture used GeForce RTX 5080 at 4K Ultra with MFG 4X—note RTX 50-series hardware is referenced for high-resolution captures.",
          "If offering game streaming or remote-rendering services, the presence of DLSS 4/MFG in titles is relevant for compatibility and performance testing.",
          "NVIDIA provides a dedicated DLSS 4 news link in the description—use official NVIDIA resources for technical and integration details."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "RTX5080",
          "4K",
          "NVIDIA",
          "GeForce",
          "RealTimeStrategy",
          "Gaming"
        ]
      }
    },
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The video shows how Rate Insurance boosts agent efficiency using Agentforce and Gemini. It also points viewers to a Google Cloud and Salesforce partnership page for more information.",
        "bullets": [
          "Demonstrates Rate Insurance improving agent efficiency with Agentforce and Gemini.",
          "Includes a link to learn more about the Google Cloud–Salesforce partnership.",
          "Published by Google Cloud on 2026-01-20.",
          "No transcript is available in the video description."
        ],
        "takeaways": [
          "This is a concrete use case connecting Google Cloud and Salesforce technologies (Rate Insurance with Agentforce and Gemini) — review the partnership link for integration details.",
          "If evaluating infrastructure/support for similar solutions, consult the linked Google Cloud–Salesforce partnership page to understand potential requirements.",
          "For vendor or platform decisions, consider this example as a reference point when assessing agent efficiency tools tied to cloud partnerships."
        ],
        "tags": [
          "Rate Insurance",
          "Agentforce",
          "Gemini",
          "Google Cloud",
          "Salesforce",
          "agent efficiency",
          "cloud partnership",
          "insurance tech",
          "customer service"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Charly Stoever, 35, is a financial coach who has spent the last 18 months living out of two suitcases and living rent-free in Portland, Oregon by pet sitting full time. She brings in about $60,000 a year while sustaining this location-independent lifestyle, as profiled in CNBC Make It's Millennial Money series.",
        "bullets": [
          "Charly Stoever, 35, is a financial coach.",
          "She lives rent-free in Portland by pet sitting full time.",
          "Has lived out of two suitcases for the past 18 months.",
          "Earns roughly $60,000 per year from this arrangement.",
          "Profiled in CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "A subset of professionals can sustain full incomes while living nomadically, indicating more geographically distributed users of digital services.",
          "Temporary, nontraditional housing arrangements (like long-term pet sitting) may produce variable local demand patterns that grid and data-center planners should monitor.",
          "Profiles emphasizing mobility and minimal possessions highlight the potential importance of reliable remote connectivity and distributed infrastructure to serve mobile users."
        ],
        "tags": [
          "pet sitting",
          "rent-free",
          "financial coach",
          "Portland",
          "nomad lifestyle",
          "remote work",
          "minimalism",
          "CNBC Make It",
          "Millennial Money",
          "personal finance"
        ]
      }
    },
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Dr. Anna Chacon, 39, is a Miami-based dermatologist who runs a private practice. Her net worth is about $6 million, consisting of $3.2 million in investments, a $1.9 million home and a $1.1 million office building.",
        "bullets": [
          "Dr. Anna Chacon, 39, dermatologist in Miami with a private practice.",
          "Reported net worth: approximately $6 million.",
          "$3.2 million held in investments.",
          "Primary residence valued at $1.9 million.",
          "Owns an office building valued at $1.1 million."
        ],
        "takeaways": [
          "Owner-operated medical practices can also be small commercial property owners (example: a $1.1M office building) — consider owner-occupied commercial parcels when profiling local commercial customers.",
          "The asset mix (investments plus residential and commercial real estate) indicates local professionals may hold capital that could be relevant for commercial property upgrades or transactions.",
          "Presence of private practices in urban markets like Miami represents a segment of small commercial customers to account for in local demand and outreach strategies.",
          "When modeling commercial real estate–related demand, include smaller owner-occupier entities (e.g., physicians) alongside larger corporate tenants."
        ],
        "tags": [
          "dermatologist",
          "private practice",
          "Miami",
          "net worth",
          "investments",
          "real estate",
          "office building",
          "home value",
          "CNBC Make It",
          "Dr. Anna Chacon"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… A giant bubble of carbon dioxide is described as capable of storing 20 megawatts of energy. The description frames these CO2-based batteries as a way to manage fluctuating renewable generation and support the global transition to clean energy.",
        "bullets": [
          "Giant CO2 bubble battery stores 20 megawatts of energy.",
          "Designed to address intermittency in renewable energy supply.",
          "Presented as a tool to support the shift to clean energy globally.",
          "Description emphasizes innovation and future-facing technology."
        ],
        "takeaways": [
          "Represents a large-capacity storage option (20 MW) to consider for peak shaving and balancing variable renewables.",
          "Could reduce reliance on backup generation by smoothing renewable output variability.",
          "Assess operational compatibility and integration requirements with existing grid or data center infrastructure.",
          "Include CO2-based storage concepts in longer-term clean-energy planning and procurement discussions."
        ],
        "tags": [
          "CO2",
          "energy",
          "battery",
          "innovation",
          "future",
          "tech",
          "ieee",
          "ieeespectrum",
          "futuristic"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI już teraz wpływa na procesy związane z cenami transferowymi — od monitorowania rentowności, przez analizy porównawcze, po automatyzację dokumentacji. Eksperci KPMG (Monika Palmowska i Jakub Roszkiewicz) omawiają także, że AI może wzmacniać pracę doradców, wskazują ryzyka związane z danymi i bezpieczeństwem oraz podkreślają potrzebę uporządkowania procesów i stosowania bezpiecznych środowisk (np. Digital Gateway) przy wdrożeniach i integracji z ERP.",
        "bullets": [
          "AI wspiera monitorowanie rentowności i tworzenie inteligentnych benchmarków.",
          "Możliwość automatyzacji dokumentacji cen transferowych.",
          "AI wspomaga doradców, ale ich nie zastępuje.",
          "Wskazane ryzyka: dane, bezpieczeństwo i zagadnienia RODO/halucynacje.",
          "Kluczowe: uporządkowanie procesów, integracja z ERP i bezpieczne środowiska (Digital Gateway)."
        ],
        "takeaways": [
          "Zadbaj o bezpieczne środowiska do pracy z AI (np. izolowane platformy typu Digital Gateway) przed uruchomieniem rozwiązań.",
          "Priorytetem jest zgodność z RODO i ochrona danych — infrastruktura musi wspierać polityki prywatności i zabezpieczenia.",
          "Umożliw integrację AI z ERP i systemami finansowymi, by wykorzystać inteligentne benchmarki i monitoring rentowności.",
          "Wspieraj automatyzację dokumentacji i procesów, ale najpierw uporządkuj dane i procesy operacyjne.",
          "Planuj zasoby i skalowanie infrastruktury pod kątem obciążeń AI oraz wymogów bezpieczeństwa danych."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "podatki",
          "automatyzacja",
          "ERP",
          "bezpieczeństwo danych",
          "RODO",
          "Digital Gateway",
          "monitoring",
          "transferpricing"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video promotes using Microsoft Copilot to stack small wins and keep momentum across workouts, projects, and personal goals. It frames Copilot as a tool to sustain steady progress and maintain motivation.",
        "bullets": [
          "Positions Copilot as a way to maintain momentum across activities.",
          "Emphasizes stacking small wins to build progress over time.",
          "Applies to workouts, projects, and personal goals alike.",
          "Encourages consistency and ongoing effort rather than one-off pushes.",
          "Framed succinctly and motivationally."
        ],
        "takeaways": [
          "Sustained momentum can help keep infrastructure projects and upgrades progressing on schedule.",
          "Stacking small, incremental improvements supports continuous operational enhancements.",
          "Consistent progress reduces the likelihood of disruptive, large-scale overhauls.",
          "Tools that promote ongoing progress can help maintain team morale and project visibility."
        ],
        "tags": [
          "Microsoft Copilot",
          "momentum",
          "productivity",
          "small wins",
          "goal-setting",
          "projects",
          "workouts",
          "personal development",
          "consistency"
        ]
      }
    }
  ]
}