{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-23T04:18:18.933Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This KPMG ON AIR podcast episode explains how AI is already integrated into audit work, showcasing tools like AI Transaction Scoring, Clara AI conversational assistants, and the KPMG Clara platform to enable full-population analysis and real-time audit management. The hosts discuss benefits for clients, changing auditor roles, necessary skills, implementation challenges, data security, regulation, and potential AI-related risks.",
        "bullets": [
          "AI supports repetitive tasks, large-data analysis, and decision-making in audits.",
          "AI Transaction Scoring enables analysis of full populations rather than sampling.",
          "Clara AI provides conversational assistance and specialized agents; KPMG Clara manages audits in real time and Clara for Clients improves client communication.",
          "Shift from sampling to full-population analysis changes auditors' roles and required competencies.",
          "Key implementation concerns include auditor adaptation, data security, regulatory environment, and AI-related risks."
        ],
        "takeaways": [
          "Prepare data pipelines and ensure high-quality, accessible data so AI-driven full-population audits can be supported.",
          "Expect integration opportunities with real-time audit platforms—plan for systems interoperability and audit workflow alignment.",
          "Prioritize data security and regulatory compliance when adopting AI tools in audit processes.",
          "Invest in upskilling staff on AI, data analytics, and new audit workflows to maximize tool effectiveness.",
          "Anticipate efficiency gains and deeper assurance from population-level analysis, and plan governance to mitigate AI-specific risks."
        ],
        "tags": [
          "audit",
          "AI",
          "KPMG",
          "KPMG Clara",
          "Clara AI",
          "full-population-analysis",
          "data-security",
          "audit-innovation",
          "regulatory-compliance",
          "auditor-skills"
        ]
      }
    },
    {
      "id": "6hu7hYLiu08",
      "title": "Get Step-By-Step Fixes with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-21T20:14:00.000Z",
      "url": "https://www.youtube.com/watch?v=6hu7hYLiu08",
      "thumbnail": "https://i.ytimg.com/vi/6hu7hYLiu08/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Copilot provides real-time visual support for home projects and repairs. It can \"see what you see\" and deliver step-by-step instructions and clear guidance for issues like leaky pipes and overflowing washing machines.",
        "bullets": [
          "Real-time visual assistance that interprets what the user is seeing.",
          "Step-by-step instructions to guide repairs and home projects.",
          "Designed for common household issues (e.g., plumbing, appliances).",
          "Focus on clear, actionable guidance to help users complete tasks."
        ],
        "takeaways": [
          "Real-time, visual, step-by-step guidance could be applied to on-site equipment troubleshooting in data centers.",
          "Such guidance may help reduce reliance on specialist technicians for routine fixes, improving resource allocation.",
          "Faster, guided repairs could shorten mean time to repair (MTTR) and reduce downtime exposure.",
          "Remote visual assistance can support distributed teams and streamline maintenance workflows and documentation."
        ],
        "tags": [
          "Copilot",
          "real-time",
          "visual-assistance",
          "step-by-step",
          "home-repair",
          "plumbing",
          "appliances",
          "remote-help",
          "Microsoft",
          "AI-assistant"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield has officially launched and features NVIDIA DLSS 4 with Multi Frame Generation. The game is a 3D real-time strategy RPG in which you play the Endministrator exploring Talos-II; the trailer was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 Multi Frame Generation 4X Mode.",
        "bullets": [
          "Official launch of Arknights: Endfield announced.",
          "Supports NVIDIA DLSS 4 with Multi Frame Generation.",
          "Trailer captured on GeForce RTX 5080 at 4K Ultra, DLSS 4 MFG 4X mode.",
          "Game described as a 3D real-time strategy RPG; player is the Endministrator on Talos-II.",
          "Publisher provides official links and social channels for the game and NVIDIA GeForce."
        ],
        "takeaways": [
          "DLSS 4 MFG support signals adoption of NVIDIA's AI-driven frame generation in a retail title—relevant when evaluating GPU feature requirements.",
          "Trailer capture on an RTX 5080 at 4K Ultra indicates marketing/tests used high-end GPU hardware—budget planning for testing/benchmarking should account for similar class GPUs.",
          "DLSS 4 Multi Frame Generation workloads combine real-time rendering with AI inference, which may influence GPU selection for cloud gaming, QA, and render farms.",
          "Availability of DLSS 4 in a launched title could increase demand for DLSS4-capable hardware in gaming and hosted-service environments."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "RTX5080",
          "NVIDIA",
          "4K",
          "RealTimeStrategy",
          "RPG",
          "GeForce"
        ]
      }
    },
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video shows how Rate Insurance boosts agent efficiency using Agentforce and Gemini. The description also directs viewers to learn more about the Google Cloud and Salesforce partnership via a provided link.",
        "bullets": [
          "Video highlights Rate Insurance improving agent efficiency with Agentforce and Gemini",
          "Published by Google Cloud on 2026-01-20",
          "Description includes a link to Google Cloud and Salesforce partnership information",
          "No transcript is available for this video",
          "Focus is on agent efficiency through integrated tools"
        ],
        "takeaways": [
          "If evaluating platform options, review the Google Cloud–Salesforce partnership details linked in the description",
          "Consider assessing integrated agent tools (like Agentforce and Gemini) for efficiency gains",
          "Use the video as a high-level example of a vendor using cloud/CRM integrations to support agents"
        ],
        "tags": [
          "Google Cloud",
          "Salesforce",
          "Rate Insurance",
          "Agentforce",
          "Gemini",
          "agent efficiency",
          "cloud partnership",
          "video"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Charly Stoever, 35, is a financial coach who has spent the last 18 months living out of two suitcases while pet sitting full time to live rent-free in Portland and earn about $60,000 a year. The segment is part of CNBC Make It's Millennial Money series profiling how people earn, spend, and save.",
        "bullets": [
          "Charly Stoever, 35, is a financial coach.",
          "She lives rent-free in Portland by pet sitting full time.",
          "She has spent 18 months living out of two suitcases.",
          "Her pet-sitting arrangement brings in about $60,000 per year.",
          "This story appears in CNBC Make It's Millennial Money series (production credits included)."
        ],
        "takeaways": [
          "This profile illustrates growth in mobile, nontraditional work and living arrangements that can affect demand for residential and temporary services.",
          "Decision-makers should note increasing prevalence of location-independent income models when planning for distributed connectivity and infrastructure needs.",
          "Shifts toward gig-based, flexible lifestyles may influence patterns of residential energy and network usage across urban areas."
        ],
        "tags": [
          "pet-sitting",
          "rent-free",
          "financial coach",
          "Portland",
          "Millennial Money",
          "CNBC Make It",
          "travel",
          "side hustle",
          "nomad"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This video highlights a giant carbon dioxide \"bubble\" battery that can store 20 megawatts of power and provide about eight hours of energy. It frames the technology as a way to smooth renewable energy fluctuations and support the global shift to clean energy.",
        "bullets": [
          "Device described as a giant carbon dioxide \"bubble\" battery",
          "Storage capacity reported at 20 megawatts",
          "Energy duration cited as roughly 8 hours",
          "Intended to smooth fluctuations from renewable energy sources",
          "Presented as supporting the global transition to clean energy"
        ],
        "takeaways": [
          "8-hour, 20 MW storage can be used for multi-hour load shifting and planning backup supply capacity",
          "Can help smooth renewable intermittency—useful for balancing supply during peak and trough periods",
          "Represents a large-scale storage option to consider when developing decarbonization and long-duration storage strategies"
        ],
        "tags": [
          "ieee",
          "tech",
          "innovation",
          "energy",
          "battery",
          "CO2",
          "clean-energy",
          "storage",
          "renewable",
          "grid"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… KPMG ON AIR hosts Monika Palmowska and Jakub Roszkiewicz discuss how AI is already changing transfer pricing by enabling monitoring of profitability, comparative analyses and automation of documentation, while outlining risks and compliance challenges. They stress that AI will augment (not replace) tax advisors and cover practical topics: secure environments (Digital Gateway), RODO and hallucinations, ERP integration, intelligent benchmarks and first steps for implementation.",
        "bullets": [
          "AI use cases: monitoring rentowności, porównania benchmarkingowe i automatyzacja dokumentacji cen transferowych.",
          "AI jako wsparcie doradców podatkowych — nie zastąpi, ale wzmocni kompetencje i procesy.",
          "Główne ryzyka: dane, bezpieczeństwo, RODO oraz problem halucynacji modeli.",
          "Digital Gateway wskazana jako bezpieczne środowisko do pracy z AI.",
          "Wdrożenie: integracja z ERP, inteligentne benchmarki i uporządkowanie procesów jako pierwsze kroki."
        ],
        "takeaways": [
          "Ensure strong data governance and security controls before adopting AI for transfer pricing (addresses data, RODO and hallucination risks).",
          "Evaluate secure platforms like Digital Gateway to isolate sensitive tax and transfer-pricing workflows from external exposure.",
          "Prioritise process standardisation and ERP integration to enable reliable AI-driven benchmarks and monitoring.",
          "Use AI to augment in-house and external tax advisors rather than replace them—focus on enabling analyst upskilling and oversight."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "transfer pricing",
          "podatki",
          "KPMG",
          "Digital Gateway",
          "ERP",
          "compliance",
          "RODO",
          "automatyzacja"
        ]
      }
    }
  ]
}