{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-28T11:42:48.256Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "gv6zK265OUE",
      "title": "Build your first GraphRAG Powered Agent! (No Graph Expert Required) | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-27T20:55:49.000Z",
      "url": "https://www.youtube.com/watch?v=gv6zK265OUE",
      "thumbnail": "https://i.ytimg.com/vi/gv6zK265OUE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this AWS Events session explains how to build a GraphRAG-powered knowledge graph to unlock information trapped in documents, PDFs, and wikis. The presenters offer a live demo showing a practical, afternoon-long workflow using familiar AI tools—no six-month project required.",
        "bullets": [
          "Problem: crucial knowledge is trapped in unstructured docs, PDFs, and wikis.",
          "Solution: use knowledge graphs to make that content searchable and reason-able by AI.",
          "Approach: the session shows a step-by-step build that can be completed in an afternoon.",
          "Tools: leverages AI tools teams already use—no specialized graph expertise required.",
          "Format: live demo with real documents to demonstrate practical results."
        ],
        "takeaways": [
          "Faster access to operational and technical documents can speed decision-making in grids and data centers.",
          "A short, practical build lowers upfront cost and time compared to long-term projects.",
          "Using existing AI tooling reduces integration friction and staffing barriers.",
          "A live-demo approach shows feasibility for rapid prototyping and pilot deployments."
        ],
        "tags": [
          "knowledge-graph",
          "GraphRAG",
          "AI",
          "retrieval-augmented-generation",
          "documentation",
          "AWS Events",
          "live-demo",
          "knowledge-management",
          "enterprise-AI"
        ]
      }
    },
    {
      "id": "yUpQ9pWA9WE",
      "title": "Watch Live: Fed Chair Jerome Powell Holds News Conference | WSJ",
      "channel": "WSJ News",
      "published_at": "2026-01-27T20:49:24.000Z",
      "url": "https://www.youtube.com/watch?v=yUpQ9pWA9WE",
      "thumbnail": "https://i.ytimg.com/vi/yUpQ9pWA9WE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Federal Reserve Chair Jerome Powell spoke to reporters following the Fed's two-day policy-setting meeting. WSJ News provided live coverage of the news conference, but no transcript is available in the video's description.",
        "bullets": [
          "Federal Reserve Chair Jerome Powell held a news conference.",
          "The event followed the Fed's two-day policy-setting meeting.",
          "WSJ News broadcast the live coverage.",
          "No transcript is included in the video description.",
          "Description includes hashtags: #JeromePowell #Fed #WSJ"
        ],
        "takeaways": [
          "Monitor the Fed's official statement and Powell's full remarks for guidance that could affect macroeconomic assumptions used in planning.",
          "Obtain the official transcript or reliable coverage to capture precise language relevant to financing, budgeting, and risk assessments.",
          "Use timely Fed communications to validate assumptions in capital expenditure, power procurement, and demand-forecast models for grid and data-center planning."
        ],
        "tags": [
          "JeromePowell",
          "Fed",
          "WSJ",
          "FederalReserve",
          "press-conference",
          "policy-meeting",
          "live",
          "economy",
          "finance"
        ]
      }
    },
    {
      "id": "MuQmKCWjSYI",
      "title": "Deutsche Bank accelerates Cloud journeys with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-27T17:39:29.000Z",
      "url": "https://www.youtube.com/watch?v=MuQmKCWjSYI",
      "thumbnail": "https://i.ytimg.com/vi/MuQmKCWjSYI/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Google Cloud Consulting helped Deutsche Bank design novel learning experiences that trained thousands of engineers to become fluent in cloud engineering. The program used Generative AI to create personalized, interactive training that blends the convenience of on-demand learning with the effectiveness of instructor-led sessions, with Google Cloud Consulting Learning Services providing the creative and technical expertise to accelerate Deutsche Bank's cloud journey.",
        "bullets": [
          "Novel learning experiences trained thousands of engineers in cloud engineering.",
          "Generative AI was used to create personalized, interactive training.",
          "Training combined on-demand convenience with instructor-led effectiveness.",
          "Google Cloud Consulting Learning Services provided creative innovation and technical expertise.",
          "The program aimed to massively accelerate Deutsche Bank’s cloud journey."
        ],
        "takeaways": [
          "Investing in scalable, AI-driven training can speed workforce readiness for cloud initiatives.",
          "Blended on-demand plus instructor-led models offer flexibility while maintaining training effectiveness.",
          "Engaging a cloud consulting partner can bring the specialized skills needed to build large-scale learning programs.",
          "Faster engineering fluency supports accelerated cloud journeys and modernization efforts."
        ],
        "tags": [
          "Deutsche Bank",
          "Google Cloud",
          "Cloud Engineering",
          "Generative AI",
          "Learning Services",
          "Training",
          "Cloud Consulting",
          "Workforce Development",
          "On-demand Learning",
          "Instructor-led Training"
        ]
      }
    },
    {
      "id": "5CyVBSbHmbA",
      "title": "Year-end toolkit: Strengthening audit committee collaboration",
      "channel": "PwC US",
      "published_at": "2026-01-27T17:20:31.000Z",
      "url": "https://www.youtube.com/watch?v=5CyVBSbHmbA",
      "thumbnail": "https://i.ytimg.com/vi/5CyVBSbHmbA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this episode guides finance teams on strengthening collaboration with audit committees during the year-end accounting and reporting process. It covers improving communication, key year-end issues, oversight of AI (risks, opportunities, controls), enhancing enterprise risk oversight, evolving cyber risk in the age of AI, and elevating proxy disclosures.",
        "bullets": [
          "Best practices for management/audit committee communication and collaboration",
          "Key year-end accounting and reporting issues finance teams should be ready to address",
          "Oversight of AI: focus on risks, opportunities, and control frameworks",
          "Strengthening enterprise risk management and cyber risk oversight amid AI advances",
          "Improving proxy disclosures and aligning reporting with governance expectations"
        ],
        "takeaways": [
          "Expect heightened audit committee interest in AI: be prepared to explain AI uses, associated risks, and the controls in place",
          "Prioritize cyber risk preparedness—AI-related threat vectors are an explicit focus for oversight and reporting",
          "Embed enterprise risk management in year-end reporting so governance leaders can see how operational risks map to financial disclosures",
          "Document and communicate transformation initiatives and their accounting impacts to streamline audit committee review",
          "Anticipate requests to enhance proxy disclosures and ensure disclosures reflect governance oversight of emerging risks"
        ],
        "tags": [
          "audit-committee",
          "year-end",
          "accounting",
          "AI-oversight",
          "enterprise-risk",
          "cyber-risk",
          "proxy-disclosures",
          "governance",
          "reporting"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Route planning is presented as being made easy as Jo discovers the power of Copilot Groups. The short description frames this as part of the Microsoft Copilot/AI conversation.",
        "bullets": [
          "Highlights route planning made easy.",
          "Centers on Jo discovering Copilot Groups.",
          "Emphasizes the \"power\" of Copilot Groups.",
          "Tags reference Microsoft Copilot and AI (#copilot #microsoftcopilot #ai)."
        ],
        "takeaways": [
          "Signals that Copilot Groups are positioned to assist with route-planning workflows—worth evaluating for logistics and field operations.",
          "Suggests exploring Copilot Groups as a coordination tool for teams that manage routes or on-site tasks.",
          "As part of the Microsoft Copilot/AI ecosystem, assess compatibility with existing tooling and vendor strategy.",
          "Short-form content like this can be a quick intro for stakeholders considering AI-enabled operational aids."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "copilot-groups",
          "route-planning",
          "Jo"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… W podcaście ekspertki KPMG omawiają praktyczne wdrożenia AI w audycie: narzędzia wspierające powtarzalne czynności, analizę dużych zbiorów danych oraz podejmowanie decyzji. Opisane rozwiązania (m.in. AI Transaction Scoring Tool, Clara AI, platforma KPMG Clara) umożliwiają analizę pełnych populacji, zarządzanie badaniem w czasie rzeczywistym, usprawnioną komunikację z klientem oraz zmieniają rolę audytora, przy jednoczesnych wyzwaniach związanych z bezpieczeństwem danych i regulacjami.",
        "bullets": [
          "AI Transaction Scoring Tool pozwala analizować pełne populacje transakcji zamiast tradycyjnego próbkowania.",
          "Clara AI to konwersacyjny asystent i wyspecjalizowani agenci wspierający pracę audytorów.",
          "KPMG Clara umożliwia zarządzanie badaniem w czasie rzeczywistym i lepszą komunikację z klientem (Clara for Clients).",
          "AI wspiera dokumentację i analizę ujawnień oraz zmienia funkcję audytora z wykonawcy próbek na analityka wyników.",
          "Wdrożenie niesie wyzwania: adaptacja audytorów, bezpieczeństwo danych, środowisko regulacyjne i potencjalne ryzyka AI."
        ],
        "takeaways": [
          "Przygotuj kompletne, wysokiej jakości logi i dane operacyjne — audyty oparte na AI analizują całe populacje danych.",
          "Spodziewaj się audytów prowadzonych w czasie rzeczywistym/near‑real‑time; zapewnij dostępność i stabilność interfejsów danych.",
          "Wzmocnij zabezpieczenia danych i zgodność regulacyjną przed udostępnieniem danych do analiz AI (szyfrowanie, kontrola dostępu, audyt śladów).",
          "Zainwestuj w szkolenia i wyznacz osoby kontaktowe do współpracy z audytorami korzystającymi z narzędzi AI i platform klienta.",
          "Rozważ integrację z platformami komunikacji audytowej (np. Clara for Clients) aby przyspieszyć wymianę informacji i procesy decyzyjne."
        ],
        "tags": [
          "AI",
          "audyt",
          "KPMG Clara",
          "Clara AI",
          "transaction scoring",
          "full-population analysis",
          "data security",
          "regulacje",
          "innowacja w audycie",
          "kompetencje audytora"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield has officially launched and the trailer spotlights NVIDIA DLSS 4 with Multi Frame Generation. The game is a 3D real-time strategy RPG, and the trailer was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 Multi Frame Generation 4X Mode.",
        "bullets": [
          "Official launch of Arknights: Endfield, a 3D real-time strategy RPG.",
          "Trailer emphasizes NVIDIA DLSS 4 with Multi Frame Generation; NVIDIA link provided.",
          "Captured on GeForce RTX 5080 at 4K Ultra with DLSS 4 MFG 4X Mode.",
          "Official game site and social channels listed for more information.",
          "NVIDIA GeForce channels and community portal links included."
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is being promoted in consumer content—data centers supporting graphics/visualization workloads should evaluate support for NVIDIA GPUs and drivers that enable DLSS 4 features.",
          "4K Ultra captures using an RTX 5080 indicate higher GPU and encode requirements for high-fidelity recording and testing—plan capacity and storage accordingly for similar workflows.",
          "Advances in GPU-driven upscaling/frame generation can affect real-time rendering and remote visualization pipelines, so compatibility testing with DLSS 4 is advisable before deployment.",
          "Monitor vendor channels (NVIDIA and game developers) for implementation details and support resources tied to new rendering/upscaling technologies."
        ],
        "tags": [
          "ArknightsEndfield",
          "Arknights",
          "DLSS4",
          "MultiFrameGeneration",
          "RTX5080",
          "4K",
          "NVIDIAGeForce",
          "gaming",
          "launch"
        ]
      }
    }
  ]
}