{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-21T04:22:10.550Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "jOC3G_N20lY",
      "title": "Year-end toolkit: Cash flow classification",
      "channel": "PwC US",
      "published_at": "2026-01-20T22:41:11.000Z",
      "url": "https://www.youtube.com/watch?v=jOC3G_N20lY",
      "thumbnail": "https://i.ytimg.com/vi/jOC3G_N20lY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This episode of PwC’s Year‑end Toolkit focuses on the statement of cash flows, highlighting SEC comment letter observations and practical considerations for complex transactions. Guests discuss debt restructurings, payment processing arrangements, business combinations, reminders and best practices, and a FASB project on targeted improvements to the statement of cash flows.",
        "bullets": [
          "Overview of the statement of cash flows and key reminders for year‑end reporting.",
          "SEC comment letter themes related to cash flow presentation.",
          "Practical considerations for debt restructurings.",
          "Treatment of payment processing arrangements and business combinations.",
          "Discussion of the FASB project on targeted improvements and link to PwC Chapter 6 guidance."
        ],
        "takeaways": [
          "Investor and regulator focus on cash flow classification means accurate, well‑documented presentation is critical for grid/data center financials.",
          "Debt restructurings can materially affect cash flow presentation—review classification and disclosures early in the year‑end process.",
          "Payment processing arrangements and business combinations may change cash flow reporting; coordinate finance, treasury, and accounting teams to ensure consistent treatment.",
          "Monitor SEC comment letter trends and the FASB targeted‑improvements project and use PwC guidance (Chapter 6) to inform year‑end decisions."
        ],
        "tags": [
          "statement of cash flows",
          "cash flow classification",
          "SEC comment letters",
          "debt restructuring",
          "payment processing",
          "business combinations",
          "FASB",
          "year-end reporting",
          "PwC",
          "financial reporting"
        ]
      }
    },
    {
      "id": "3wQ_yte0TTo",
      "title": "Build Voice Agents with Amazon Nova 2 Sonic &amp; AgentCore | AWS Show and Tell",
      "channel": "AWS Events",
      "published_at": "2026-01-20T22:10:10.000Z",
      "url": "https://www.youtube.com/watch?v=3wQ_yte0TTo",
      "thumbnail": "https://i.ytimg.com/vi/3wQ_yte0TTo/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This episode presents Amazon Nova 2 Sonic and Bedrock AgentCore features for building advanced voice agents, including polyglot voices, 1‑million token context windows, and asynchronous tool calling. It also covers WebSocket-based bidirectional streaming, Strands BidiAgent integration, and hands-on Python demos with workshop code on GitHub.",
        "bullets": [
          "Nova 2 Sonic: polyglot voice switching, 1M token context windows, and async tool calling.",
          "AgentCore: WebSocket bidirectional streaming for real-time two-way voice interactions.",
          "Strands BidiAgent: integration to handle interruptions and agent-to-agent collaboration.",
          "Includes practical Python implementation examples and production-ready best practices.",
          "Workshop materials and code samples available on the linked GitHub repo."
        ],
        "takeaways": [
          "Large (1M) context windows suggest increased memory and model-serving capacity needs for deployments.",
          "Real-time bidirectional streaming emphasizes the importance of low-latency networking and WebSocket support in infrastructure.",
          "Asynchronous tool calling and agent collaboration indicate potential for variable, bursty compute patterns that capacity planning should accommodate.",
          "Hands-on Python demos and workshop assets enable faster developer onboarding and predictable deployment workflows."
        ],
        "tags": [
          "amazon-nova-2",
          "nova-sonic",
          "bedrock-agentcore",
          "strands-bidiagent",
          "voice-agents",
          "speech-to-speech",
          "bidirectional-streaming",
          "polyglot-voices",
          "python",
          "workshop"
        ]
      }
    },
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video shows how Rate Insurance boosts agent efficiency using Agentforce and Gemini. It also directs viewers to learn more about the Google Cloud and Salesforce partnership via the provided link.",
        "bullets": [
          "Demonstrates Rate Insurance improving agent efficiency with Agentforce and Gemini.",
          "References the Google Cloud and Salesforce partnership for further information.",
          "Provides a link for viewers to explore the partnership details.",
          "Focused on showcasing a customer example rather than technical specifics."
        ],
        "takeaways": [
          "Follow the Google Cloud–Salesforce partnership link to evaluate potential platform integrations for customer service workloads.",
          "Note the named solutions (Agentforce and Gemini) as technologies to assess when reviewing agent-support systems.",
          "Engage vendor partners to clarify operational requirements, integration needs, and potential impacts on capacity planning.",
          "Use the video as an introductory demo to inform deeper technical due diligence and SLA discussions."
        ],
        "tags": [
          "Rate Insurance",
          "Agentforce",
          "Gemini",
          "Google Cloud",
          "Salesforce",
          "agent efficiency",
          "partnership",
          "customer service",
          "demo"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Charly Stoever, a 35-year-old financial coach, lives rent-free in Portland, Oregon by pet sitting full time. Over the past 18 months she has lived out of two suitcases while earning $60,000 a year.",
        "bullets": [
          "Charly Stoever, 35, is a financial coach.",
          "She lives rent-free in Portland by pet sitting full time.",
          "Has spent the last 18 months living out of two suitcases.",
          "Annual earnings reported: $60,000.",
          "This story is part of CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "Example highlights a location-independent lifestyle that combines gig work (pet sitting) with a professional role (financial coach).",
          "Anecdote shows an alternative cost-saving housing strategy (rent-free living) paired with a moderate annual income.",
          "Short-term, mobile living arrangements (living out of two suitcases) may reflect a user segment that values portability and flexibility.",
          "For planners, this is a data point about diverse modern work/living patterns worth monitoring when assessing service needs for distributed, mobile users."
        ],
        "tags": [
          "pet-sitting",
          "rent-free",
          "financial-coach",
          "travel",
          "Portland",
          "millennial-money",
          "CNBCMakeIt",
          "living-out-of-two-suitcases",
          "income-60000"
        ]
      }
    },
    {
      "id": "wicD8G0rn1Y",
      "title": "New: AWS Lambda tenant isolation | Serverless Office Hours",
      "channel": "AWS Events",
      "published_at": "2026-01-20T15:40:24.000Z",
      "url": "https://www.youtube.com/watch?v=wicD8G0rn1Y",
      "thumbnail": "https://i.ytimg.com/vi/wicD8G0rn1Y/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This Serverless Office Hours episode showcases AWS Lambda's new tenant isolation mode for building secure multi-tenant SaaS applications. The feature provides dedicated execution environments per tenant to silo cached data and execution contexts, reduces infrastructure complexity, enables faster scaling during traffic spikes, and includes automatic tenant identifier logging for tenant-specific debugging.",
        "bullets": [
          "Dedicated execution environments per tenant to prevent cross-tenant data exposure",
          "Silos cached data and execution context to strengthen security boundaries",
          "Reduces infrastructure complexity for multi-tenant SaaS deployments",
          "Enables faster scaling during traffic spikes while maintaining isolation guarantees",
          "Built-in monitoring with automatic tenant identifier logging for easier debugging"
        ],
        "takeaways": [
          "Improved tenant-level security: isolation mode minimizes risk of cross-tenant data exposure by segregating execution contexts and caches.",
          "Operational simplification: consolidates multi-tenant deployments without needing separate infrastructure per tenant, reducing management overhead.",
          "Better resilience and performance: supports faster scaling during spikes while preserving isolation guarantees for tenants.",
          "Enhanced observability: automatic tenant identifier logging speeds up troubleshooting of tenant-specific issues.",
          "Suitable for SaaS decision-makers evaluating trade-offs between isolation, scalability, and operational complexity."
        ],
        "tags": [
          "AWS Lambda",
          "tenant isolation",
          "multi-tenant",
          "serverless",
          "SaaS",
          "security",
          "scaling",
          "observability",
          "monitoring"
        ]
      }
    },
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Dr. Anna Chacon, 39, is a dermatologist in Miami, FL who runs her own private practice and earns $900,000 a year. Her net worth is about $6 million, made up of $3.2 million in investments, a $1.9 million home and a $1.1 million office building.",
        "bullets": [
          "Dr. Anna Chacon, 39, lives in Miami, FL and is a dermatologist.",
          "She operates her own private practice and earns $900,000 annually.",
          "Total net worth is about $6 million.",
          "Net worth breakdown: $3.2M investments, $1.9M home, $1.1M office building.",
          "Information comes from the video's description (no transcript available)."
        ],
        "takeaways": [
          "The description provides no information about energy use, IT infrastructure, or facility requirements relevant to grid/datacenter planning.",
          "It does note ownership of a commercial office building (valued at $1.1M), which is a factual asset detail but includes no operational or technical specifics.",
          "Financial figures (income and investments) are personal/financial data and do not inform capacity, power, or resiliency needs.",
          "Location is stated as Miami, FL, but no site-level details (address, building systems, or power requirements) are provided."
        ],
        "tags": [
          "dermatologist",
          "Anna Chacon",
          "Miami",
          "private practice",
          "net worth",
          "investments",
          "home",
          "office building",
          "personal finance",
          "$900k income"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, a giant bubble of carbon dioxide is reported to store 20 megawatts of energy. The description says these batteries can help manage renewable energy fluctuations and support the global transition to clean energy.",
        "bullets": [
          "A CO2-based storage system is described as holding 20 megawatts of energy.",
          "Designed to address variability in renewable energy generation.",
          "Positioned as a technology to aid the shift to clean energy worldwide.",
          "No transcript provided; only the brief description and hashtags are available."
        ],
        "takeaways": [
          "A 20 MW storage unit could be relevant for large-scale smoothing of renewable generation on a grid.",
          "Such storage technology is presented as a tool to support broader clean-energy integration.",
          "Grid and data-center planners should view this as a potential option for managing renewable variability, pending technical and operational details.",
          "Additional technical, economic, and operational information is required before making procurement or deployment decisions."
        ],
        "tags": [
          "ieee",
          "tech",
          "ieeespectrum",
          "innovation",
          "future",
          "futuristic",
          "energy",
          "battery"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI is already changing transfer pricing—supporting monitoring of profitability, comparable analyses and automation of documentation. In the KPMG ON AIR podcast Monika Palmowska and Jakub Roszkiewicz discuss AI as a tool to strengthen (not replace) advisors, implementation steps (process cleanup, ERP integration, intelligent benchmarks), and risks such as data/security, RODO and hallucinations, with solutions like the Digital Gateway.",
        "bullets": [
          "AI use cases in transfer pricing: profitability monitoring, benchmarking and documentation automation",
          "AI is positioned to augment tax advisors’ work, not replace them",
          "Implementation advice: start with orderly processes, then integrate AI with ERP and benchmark tools",
          "Key risks highlighted: data/privacy, security and AI hallucinations",
          "Mentioned mitigation: secure environments (Digital Gateway) and upskilling junior staff"
        ],
        "takeaways": [
          "Ensure strong data governance and privacy controls before deploying AI for transfer pricing",
          "Use secure environments (e.g., Digital Gateway) for AI work to limit data/security exposure",
          "Prioritize ERP integration and reliable data pipelines to enable intelligent benchmarking",
          "Standardize and document processes first—this is the foundation for successful AI adoption",
          "Plan for workforce upskilling, as AI will augment advisors and support junior team development"
        ],
        "tags": [
          "podatki",
          "AI",
          "cenytransferowe",
          "transferpricing",
          "ERP",
          "DigitalGateway",
          "RODO",
          "security",
          "automation",
          "benchmarking"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video encourages stacking small wins with Microsoft Copilot to keep momentum. It frames Copilot as a way to sustain progress across workouts, projects, and personal goals.",
        "bullets": [
          "Encourages stacking small wins to build momentum",
          "Targets workouts, projects, and personal goals",
          "Positions Microsoft Copilot as a tool for sustained progress",
          "Motivational, short-form messaging rather than technical detail"
        ],
        "takeaways": [
          "So what — For grid/data center decision-makers, Copilot's emphasis on keeping momentum for projects suggests potential value in using it to sustain progress on longer initiatives.",
          "So what — A focus on incremental wins may help maintain team engagement during multi‑phase rollouts or extended operational work.",
          "So what — Even without technical specifics, Copilot could be considered for supporting regular follow‑through and goal tracking to keep projects on schedule."
        ],
        "tags": [
          "Microsoft Copilot",
          "stack small wins",
          "momentum",
          "productivity",
          "workouts",
          "projects",
          "personal goals",
          "motivation",
          "AI assistant"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… the video highlights how the precision and speed of the Dell PowerEdge R770AP server, powered by Intel® Xeon® 6 processors, support high-frequency trading by executing hundreds of trades in seconds. It frames Intel Xeon 6 CPUs' high-performance expertise as a defining technology for the future of finance.",
        "bullets": [
          "Focus on high-frequency trading where every second matters.",
          "Showcases Dell PowerEdge R770AP servers with Intel® Xeon® 6 processors.",
          "Emphasizes precision and speed to maximize gains and minimize losses.",
          "Claims capability to perform hundreds of trades in seconds.",
          "Positions Intel Xeon 6 CPUs as shaping the future of finance."
        ],
        "takeaways": [
          "Prioritize compute platforms that deliver the precision and speed required for HFT workloads, such as the Dell PowerEdge R770AP with Intel Xeon 6.",
          "Investing in high-performance CPUs can directly support trading performance objectives—maximizing gains and reducing losses.",
          "Architect data center resources to sustain very high transaction rates (hundreds of trades per second) for finance workloads.",
          "Use Intel Business resources for guidance on deploying IT infrastructure for finance and trading environments."
        ],
        "tags": [
          "high-frequency trading",
          "HFT",
          "Dell PowerEdge R770AP",
          "Intel Xeon 6",
          "low latency",
          "finance technology",
          "data center",
          "servers",
          "Intel Business"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the short video promotes Microsoft Copilot as a tool that revived a creative spark and encourages viewers to try it. The message is a brief promotional call-to-action directing users to download Copilot via the link in the creator's bio.",
        "bullets": [
          "Promotional clip claiming Copilot restored a creative spark.",
          "Direct call-to-action: download Copilot via link in bio.",
          "No transcript available for additional detail.",
          "Posted by Microsoft Copilot channel on 2026-01-14."
        ],
        "takeaways": [
          "If your teams need creative support, consider trying Copilot (download link provided in promo) to evaluate potential benefits.",
          "Treat the video as a prompt to run a short pilot or trial before making procurement decisions.",
          "Use any trial period to measure user adoption and whether Copilot improves idea generation or creative workflows.",
          "Plan for basic onboarding and access logistics since the video emphasizes immediate download and use."
        ],
        "tags": [
          "Copilot",
          "Creativity",
          "Microsoft",
          "AI",
          "Download",
          "Promo",
          "TryNow",
          "Productivity",
          "GenerativeAI"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This short promo highlights Where Winds Meet as an open-world martial arts RPG showcasing DLSS 4 with Multi Frame Generation and #RTXOn. The clip is credited to @DigitalDreamsyt and invites viewers to experience the game with NVIDIA RTX features enabled.",
        "bullets": [
          "Open-world martial arts RPG showcased.",
          "Uses DLSS 4 with Multi Frame Generation.",
          "Promoted with #RTXOn (ray tracing enabled).",
          "Encourages experiencing Where Winds Meet.",
          "Video credited to @DigitalDreamsyt."
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation indicates demos that rely on NVIDIA's latest upscaling/AI frame synthesis—ensure infrastructure can support NVIDIA feature stacks.",
          "Provision GPUs and drivers that support RTX features for accurate rendering and benchmarking of such titles.",
          "Validate software/SDK compatibility (DLSS/RTX) in test environments before production deployment.",
          "Consider using visually rich RTX demos like this for client presentations or performance validation of GPU clusters."
        ],
        "tags": [
          "Where Winds Meet",
          "DLSS 4",
          "Multi Frame Generation",
          "RTX On",
          "NVIDIA GeForce",
          "open-world",
          "martial arts RPG",
          "DigitalDreamsyt",
          "ray tracing",
          "gaming"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this Intel Business video features Taha Khalifa and directs viewers to subscribe and connect with Intel Business channels. The description positions Intel Business as a hub for IT information—covering topics from data centers to devices—and emphasizes resources, guidance, and expert insights.",
        "bullets": [
          "Call to subscribe to the Intel Business YouTube channel.",
          "Video features Taha Khalifa (Intel).",
          "Intel Business provides IT resources covering data centers to devices.",
          "Emphasizes guidance and expert insights for IT projects.",
          "Provides links to website and social channels (X, LinkedIn, Facebook)."
        ],
        "takeaways": [
          "Intel Business is presented as a centralized resource for data center and device-related IT guidance—useful when seeking vendor-curated information.",
          "The channel and website can be sources of expert insights to inform planning and implementation of IT projects.",
          "Following Intel Business on social platforms can help decision-makers stay updated on resources and guidance relevant to enterprise IT."
        ],
        "tags": [
          "Intel Business",
          "Taha Khalifa",
          "data centers",
          "IT resources",
          "enterprise IT",
          "technology guidance",
          "Intel",
          "IT center",
          "expert insights"
        ]
      }
    }
  ]
}