{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-19T10:56:14.603Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "6L86-OnOXV0",
      "title": "How I Built A $1M/Year Business - And Helped My Parents Retire",
      "channel": "CNBC Make It",
      "published_at": "2026-01-17T15:00:09.000Z",
      "url": "https://www.youtube.com/watch?v=6L86-OnOXV0",
      "thumbnail": "https://i.ytimg.com/vi/6L86-OnOXV0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Tuan Le emigrated from Vietnam to Toronto in 2015 and vowed at 15 to help his parents retire. Ten years later his social video production company, ShortsCut, brings in over $1 million USD a year in sales, and he now covers his parents' rent and living expenses so they no longer have to work full time.",
        "bullets": [
          "Tuan Le emigrated from Vietnam to Toronto, Canada in 2015.",
          "At age 15 he vowed to help his parents retire.",
          "His company, ShortsCut, is a social video production business.",
          "ShortsCut generates over $1 million USD in annual sales.",
          "Le now pays his parents' rent and living expenses so they no longer work full time."
        ],
        "takeaways": [
          "A social video production company can scale to >$1M/year in revenue—highlighting video creators as potentially significant commercial customers for digital infrastructure.",
          "Entrepreneurial media businesses can create direct economic impact for founders and families, underscoring the broader value of supporting creative industries.",
          "Providers serving content creators should note the growing market for social video services when planning capacity and service offerings."
        ],
        "tags": [
          "ShortsCut",
          "Tuan Le",
          "social video",
          "entrepreneurship",
          "CNBC Make It",
          "1M revenue",
          "family support",
          "immigrant story",
          "Toronto",
          "video production"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights a new battery that uses a giant bubble of carbon dioxide to store energy and can deliver 20 megawatts for about eight hours. The technology is presented as a way to smooth renewable intermittency and support the global shift to clean energy.",
        "bullets": [
          "Battery uses a large carbon dioxide bubble as the storage medium",
          "Can supply 20 megawatts of power",
          "Stores energy for approximately eight hours",
          "Aimed at addressing fluctuations from renewable energy sources",
          "Framed as supporting the global transition to clean energy"
        ],
        "takeaways": [
          "Provides an 8-hour, 20 MW scale storage option to consider for medium-duration backup or load-shifting needs",
          "Could help integrate variable renewables by supplying predictable power during lulls",
          "Relevant for data centers and grids planning multi-hour resilience or decarbonization strategies",
          "Technology uses CO2 as the working/storage medium, which may affect operational or regulatory considerations"
        ],
        "tags": [
          "CO2-battery",
          "carbon-dioxide",
          "energy-storage",
          "8-hour-storage",
          "20MW",
          "renewable-integration",
          "grid-resilience",
          "data-center-power",
          "clean-energy",
          "IEEE-Spectrum"
        ]
      }
    },
    {
      "id": "OINppmPan0o",
      "title": "Figure Skating | Making Team USA presented by Xfinity with Apolo Ohno",
      "channel": "Team USA",
      "published_at": "2026-01-16T19:30:36.000Z",
      "url": "https://www.youtube.com/watch?v=OINppmPan0o",
      "thumbnail": "https://i.ytimg.com/vi/OINppmPan0o/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Figure skating duo Vadym Kolesnik and Emilia Zingas sit down with Apolo Ohno to discuss their partnership and the role of trust as they prepare for the Winter Olympics. The conversation is featured in this week's episode of Making Team USA presented by Xfinity.",
        "bullets": [
          "Conversation focuses on the partnership of Vadym Kolesnik and Emilia Zingas.",
          "Apolo Ohno hosts the interview ahead of the Winter Olympics.",
          "Central theme highlighted is trust between the skating partners.",
          "Episode is part of the Making Team USA series presented by Xfinity.",
          "Published by Team USA on YouTube with associated social links."
        ],
        "takeaways": [
          "Emphasis on trust underscores the value of reliable teammates for high-stakes operations — prioritize relationship-building in teams.",
          "Clear coordination between two-person teams (duos) is critical — useful model for paired operational responsibilities like on-call rotations.",
          "Preparing for major events through focused practice and alignment can translate to better readiness for large deployments or peak-demand periods."
        ],
        "tags": [
          "figure skating",
          "Vadym Kolesnik",
          "Emilia Zingas",
          "Apolo Ohno",
          "Making Team USA",
          "Winter Olympics",
          "trust",
          "Xfinity",
          "Team USA",
          "sports interview"
        ]
      }
    },
    {
      "id": "RalzsofAYHM",
      "title": "29-year-old spent $20,000 to open a store in New York — now it brings in $1.6 million a year",
      "channel": "CNBC Make It",
      "published_at": "2026-01-16T17:00:48.000Z",
      "url": "https://www.youtube.com/watch?v=RalzsofAYHM",
      "thumbnail": "https://i.ytimg.com/vi/RalzsofAYHM/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Abby Price launched Abbode as a Parsons grad student, selling dried floral arrangements on Facebook in 2019. By March 2022 she was operating a Nolita storefront selling bouquets and home decor and had used store cashflow to buy a $15,000 embroidery machine that sat covered in dust in the shop’s basement for a year.",
        "bullets": [
          "Founder Abby Price started Abbode while at Parsons School of Design in 2019.",
          "Initial sales channel was Facebook, selling dried floral arrangements to local New Yorkers.",
          "By March 2022 Abbode had a physical storefront in Nolita selling bouquets and home decor.",
          "Price financed a $15,000 embroidery machine from store cashflow, bought on a whim.",
          "The embroidery machine remained unused and stored in the shop basement for a year."
        ],
        "takeaways": [
          "Small-to-moderate capital purchases can be funded from operational cashflow—plan capex around proven revenue streams.",
          "Purchased equipment may sit idle; factor utilization risk and storage capacity into investment decisions.",
          "Diversifying channels (online to physical retail) can change cashflow patterns and prompt unexpected capital needs.",
          "Track asset deployment timelines to avoid tying up capital in underused equipment."
        ],
        "tags": [
          "Abby Price",
          "Abbode",
          "Parsons School of Design",
          "dried floral",
          "Nolita",
          "embroidery machine",
          "small business",
          "retail",
          "cashflow",
          "ecommerce"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI już teraz zmienia podejście do cen transferowych — od monitorowania rentowności i analiz porównawczych po automatyzację dokumentacji. W podcaście KPMG ON AIR eksperci Monika Palmowska i Jakub Roszkiewicz omawiają praktyczne zastosowania, ryzyka (dane, bezpieczeństwo, RODO), integrację z ERP oraz pierwsze kroki wdrożeniowe.",
        "bullets": [
          "Przykłady zastosowań: monitoring rentowności, benchmarki i automatyzacja dokumentacji cen transferowych.",
          "AI ma wzmacniać pracę doradców, a nie ich zastępować; wspiera też rozwój kompetencji młodszych pracowników.",
          "Główne ryzyka: jakościowe dane, bezpieczeństwo oraz wyzwania regulacyjne (RODO, halucynacje).",
          "Digital Gateway wymieniony jako bezpieczne środowisko do pracy z AI.",
          "Kluczowe elementy wdrożenia: integracja z ERP, inteligentne benchmarki i uporządkowanie procesów jako fundament."
        ],
        "takeaways": [
          "Zadbaj o bezpieczne środowisko uruchamiania AI (np. Digital Gateway) dla danych transfer pricingowych.",
          "Postaw na silne standardy ochrony i zgodności danych (RODO) przed uruchomieniem rozwiązań AI.",
          "Planuj integrację AI z ERP i narzędziami benchmarkowymi, aby uzyskać spójne, automatyczne workflowy.",
          "Wspieraj wdrożenia procesowo — uporządkowane procesy są fundamentem skutecznej transformacji AI.",
          "Traktuj AI jako narzędzie podnoszące efektywność zespołów podatkowych i wspomagające rozwój pracowników."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "transfer pricing",
          "automatyzacja",
          "ERP",
          "bezpieczeństwo danych",
          "RODO",
          "Digital Gateway"
        ]
      }
    },
    {
      "id": "dGfcT63U7Mo",
      "title": "The 2026 U.S. Olympic Figure Skating Team 🇺🇸",
      "channel": "Team USA",
      "published_at": "2026-01-15T20:43:24.000Z",
      "url": "https://www.youtube.com/watch?v=dGfcT63U7Mo",
      "thumbnail": "https://i.ytimg.com/vi/dGfcT63U7Mo/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The video highlights the U.S. Olympic figure skating lineup with an enthusiastic tone. The description also includes the hashtag #WinterOlympics.",
        "bullets": [
          "Presents the U.S. Olympic figure skating lineup.",
          "Promotional, excited tone signaled by a fire emoji.",
          "Includes the #WinterOlympics hashtag."
        ],
        "takeaways": [
          "Olympics-related content can drive seasonal spikes in viewership—plan capacity and CDN resources accordingly.",
          "Ensure high availability and low-latency streaming for peak interest around lineup announcements and related events.",
          "Monitor social channels and hashtags (e.g., #WinterOlympics) for sudden referral traffic and scale autoscaling rules as needed."
        ],
        "tags": [
          "U.S. Olympic",
          "Figure Skating",
          "Lineup",
          "WinterOlympics",
          "Olympics",
          "Winter Sports",
          "Skating",
          "Sports"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video encourages using Microsoft Copilot to keep momentum while tackling workouts, projects, or personal goals. It highlights the idea of stacking small wins to sustain progress.",
        "bullets": [
          "Positions Copilot as a tool to help maintain momentum.",
          "Applies across workouts, projects, and personal goals.",
          "Emphasizes stacking small wins to keep progress steady.",
          "Short, motivational message focused on consistent progress."
        ],
        "takeaways": [
          "Apply the 'stack small wins' mindset to break large data center initiatives into manageable, trackable steps to sustain momentum.",
          "Consider using Copilot to support ongoing project workflows and routine operational tasks to help maintain steady progress.",
          "Set frequent, achievable milestones during migrations, upgrades, or deployments to keep teams motivated and progress visible.",
          "Consistent, incremental progress can improve execution reliability for long-running infrastructure projects."
        ],
        "tags": [
          "Microsoft Copilot",
          "Copilot",
          "momentum",
          "small wins",
          "productivity",
          "goals",
          "projects",
          "workouts",
          "motivation",
          "goal-setting"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights how the Dell PowerEdge R770AP server, powered by Intel Xeon 6 processors, provides the speed and precision needed for high-frequency trading. It emphasizes performing hundreds of trades in seconds to help maximize gains and minimize losses and positions Intel Xeon 6 CPUs as defining the future of finance.",
        "bullets": [
          "Focus on low-latency, high-precision compute for high-frequency trading (HFT).",
          "Showcases the Dell PowerEdge R770AP server equipped with Intel Xeon 6 processors.",
          "Claims the platform can execute hundreds of trades in seconds.",
          "Positions Intel Xeon 6 CPUs as shaping the future of finance."
        ],
        "takeaways": [
          "For trading workloads, prioritize servers and CPUs optimized for low latency and high throughput.",
          "Evaluate Dell PowerEdge R770AP with Intel Xeon 6 for environments requiring rapid, sub-second transaction processing.",
          "Capacity planning should account for hundreds of trades per second workloads to protect gains and limit losses."
        ],
        "tags": [
          "high-frequency-trading",
          "HFT",
          "Dell PowerEdge R770AP",
          "Intel Xeon 6",
          "low-latency",
          "trading-servers",
          "finance",
          "data-center",
          "performance"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Copilot is presented as the tool that brought a lost creative spark back to life. The short promo invites viewers to download Copilot and try it via the link in the bio.",
        "bullets": [
          "No transcript available.",
          "Description states: 'The creative spark was out. Copilot brought it back to life.'",
          "Clear call to action to download Copilot and try it.",
          "Message is a brief promotional invite to test the app via the link in bio."
        ],
        "takeaways": [
          "So what: If creativity or ideation is a concern, consider downloading Copilot to run a quick hands-on trial before committing.",
          "So what: Use a controlled pilot to evaluate whether Copilot supports your team's creative workflows and collaboration needs.",
          "So what: Access to the app is promoted via the link in the bio—use that entry point for immediate trialing.",
          "So what: Keep assessments focused on fit and user acceptance for grid/data center teams rather than assuming outcomes."
        ],
        "tags": [
          "Copilot",
          "creativity",
          "download",
          "Microsoft",
          "AI",
          "promo",
          "try it",
          "link in bio"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This video showcases the open-world martial arts RPG Where Winds Meet running with DLSS 4 featuring Multi Frame Generation. It invites viewers to experience the title with #RTXOn and credits @DigitalDreamsyt for the footage.",
        "bullets": [
          "No transcript available; summary based on description only.",
          "Features 'Where Winds Meet', an open-world martial arts RPG.",
          "Highlights DLSS 4 with Multi Frame Generation.",
          "Promotes experiencing the game with #RTXOn (ray tracing).",
          "Footage credited to @DigitalDreamsyt."
        ],
        "takeaways": [
          "Demonstrates use of DLSS 4 with Multi Frame Generation in game showcase material—relevant when evaluating support for NVIDIA upscaling features.",
          "Signals continued production of RTX-enabled promotional content that may require GPU-capable playback and testing environments.",
          "Useful reference for assessing compatibility and validation needs for DLSS/RTX-enabled titles in infrastructure and QA workflows."
        ],
        "tags": [
          "DLSS 4",
          "Multi Frame Generation",
          "RTXOn",
          "Where Winds Meet",
          "open-world",
          "martial arts",
          "NVIDIA GeForce",
          "DigitalDreamsyt",
          "gaming",
          "trailer"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this YouTube video features Taha Khalifa on the Intel Business channel and invites viewers to subscribe. The Intel Business channel provides resources, guidance, and expert insights for IT projects ranging from data centers to devices, with links to the Intel Business website and social channels.",
        "bullets": [
          "Video title: Taha Khalifa (Intel) | Intel Business",
          "Channel invites viewers to subscribe to Intel Business on YouTube",
          "Intel Business offers resources, guidance, and expert insights for IT projects (data centers to devices)",
          "Links provided: Intel Business website, X (Twitter), LinkedIn, Facebook",
          "No transcript available for this video"
        ],
        "takeaways": [
          "Use the Intel Business channel as a centralized source of guidance and expert insight for data center and device planning",
          "Leverage provided resources to support IT project execution and decision-making",
          "Follow the Intel Business website and social channels to stay updated on Intel guidance and materials relevant to grid/data center operations",
          "Contact or connect via listed channels to access additional Intel Business resources"
        ],
        "tags": [
          "Intel Business",
          "Taha Khalifa",
          "Intel",
          "data center",
          "IT resources",
          "devices",
          "subscribe",
          "enterprise IT"
        ]
      }
    },
    {
      "id": "kSocjh8PZnQ",
      "title": "Rynek dóbr luksusowych w obliczu transformacji | Andrzej Marczak, Tomasz Wiśniewski",
      "channel": "KPMG Poland",
      "published_at": "2026-01-13T10:23:31.000Z",
      "url": "https://www.youtube.com/watch?v=kSocjh8PZnQ",
      "thumbnail": "https://i.ytimg.com/vi/kSocjh8PZnQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The podcast discusses how the luxury goods market is being reshaped by a shift toward experiences over possessions, rising ESG expectations, and the rise of \"affordable luxury,\" with Poland still growing despite global declines. Experts highlight trends including concentration of wealth, personalization, Gen Z preferences for experiences, luxury tourism and hotels, the art market, and future drivers such as AI, craftsmanship and the human dimension.",
        "bullets": [
          "Key trends: experience-driven luxury, ESG/responsible sourcing, and \"affordable luxury.\"",
          "Wealth concentration: ~2% of the wealthiest customers account for ~40% of the market.",
          "Consumer segments: personalization, aspirational buyers, and Gen Z prioritizing experiences.",
          "Poland: a growing but fragmented luxury market, with notable activity in hotels, tourism and the art scene.",
          "Looking ahead: AI, craftsmanship and human-centered experiences are expected to shape the future."
        ],
        "takeaways": [
          "Poland's continued market growth and emphasis on luxury hotels/tourism may translate to concentrated local demand for reliable power and data services in hospitality and coastal regions.",
          "ESG and responsible-luxury trends suggest increased importance of sustainable, energy-efficient infrastructure and renewable-backed power options for facilities serving luxury brands.",
          "Future focus on AI and personalized, experience-led services implies potential growth in compute, low-latency networking and capacity planning for digital platforms supporting luxury experiences."
        ],
        "tags": [
          "luksus",
          "ESG",
          "Polska",
          "affordable-luxury",
          "personalizacja",
          "GenZ",
          "turystyka-luksusowa",
          "sztuka",
          "AI",
          "KPMG"
        ]
      }
    }
  ]
}