{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-19T15:51:10.979Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Dr. Anna Chacon, 39, is a Miami-based dermatologist who runs her own private practice. Her reported net worth is about $6 million, made up of $3.2 million in investments, a $1.9 million home and a $1.1 million office building.",
        "bullets": [
          "Name: Dr. Anna Chacon, age 39",
          "Location: Miami, FL",
          "Profession: Dermatologist with a private practice",
          "Net worth: Approximately $6 million",
          "Asset breakdown: $3.2M investments, $1.9M home, $1.1M office building"
        ],
        "takeaways": [
          "Profile shows a mix of liquid investments and owned real estate—useful when mapping potential local stakeholders for infrastructure projects.",
          "Ownership of a $1.1M office building indicates small commercial property owners can be decision-makers for building-level systems.",
          "High net worth individuals in a region (here Miami) represent a segment whose asset composition (investments vs. property) could inform financing or partnership approaches.",
          "Understanding that professionals may hold both personal and commercial real estate can help tailor outreach and service offerings at the property level."
        ],
        "tags": [
          "dermatologist",
          "private practice",
          "net worth",
          "real estate",
          "investments",
          "Miami",
          "office building",
          "personal finance",
          "physician wealth"
        ]
      }
    },
    {
      "id": "6L86-OnOXV0",
      "title": "How I Built A $1M/Year Business - And Helped My Parents Retire",
      "channel": "CNBC Make It",
      "published_at": "2026-01-17T15:00:09.000Z",
      "url": "https://www.youtube.com/watch?v=6L86-OnOXV0",
      "thumbnail": "https://i.ytimg.com/vi/6L86-OnOXV0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Tuan Le emigrated from Vietnam to Toronto in 2015 and vowed at 15 to help his parents retire. Ten years later his social video production company, ShortsCut, brings in over $1 million USD a year, and he now pays his parents' rent and living expenses so they no longer have to work full time.",
        "bullets": [
          "Tuan Le and his family emigrated from Vietnam to Toronto in 2015.",
          "At age 15 he vowed to help his parents retire.",
          "His company, ShortsCut, is a social video production firm.",
          "ShortsCut generates over $1 million USD in annual sales.",
          "He now covers his parents' rent and living expenses so they no longer work full time."
        ],
        "takeaways": [
          "Small, specialized media companies can scale to >$1M/year — plan infrastructure and service offerings to support rapidly growing content customers.",
          "Video-focused businesses drive sustained demand for storage, bandwidth, and delivery — factor content workloads into capacity and CDN planning.",
          "The creator economy represents a high-growth customer segment — consider targeted outreach and scalable pricing to capture such firms."
        ],
        "tags": [
          "Tuan Le",
          "ShortsCut",
          "CNBC Make It",
          "entrepreneurship",
          "immigrant story",
          "video production",
          "creator economy",
          "$1M/year",
          "Toronto",
          "family support"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this IEEE Spectrum video highlights a CO2-based battery — described as a giant bubble of carbon dioxide — that can store 20 megawatts of energy for about eight hours. The description frames the technology as a response to renewable intermittency and as a tool to help power the global shift to clean energy.",
        "bullets": [
          "Giant bubble of carbon dioxide used as an energy-storage battery",
          "Stores 20 megawatts of power",
          "Provides roughly 8 hours of energy storage",
          "Aimed at addressing fluctuations in renewable energy output",
          "Presented as supporting the global transition to clean energy"
        ],
        "takeaways": [
          "A 20 MW, 8-hour storage option could support multi-hour load shifting or backup needs for medium-scale grid or facility operations",
          "Targets renewable intermittency—consider as a complementary tool alongside renewables for balancing supply",
          "Capacity and duration figures give a baseline for sizing potential deployments and evaluating fit with demand profiles",
          "Track development and demonstration outcomes to assess readiness for integration into resilience and decarbonization strategies"
        ],
        "tags": [
          "co2-battery",
          "20-MW",
          "8-hours",
          "energy-storage",
          "renewables",
          "grid-resilience",
          "clean-energy",
          "battery-technology",
          "IEEE-Spectrum",
          "innovation"
        ]
      }
    },
    {
      "id": "OINppmPan0o",
      "title": "Figure Skating | Making Team USA presented by Xfinity with Apolo Ohno",
      "channel": "Team USA",
      "published_at": "2026-01-16T19:30:36.000Z",
      "url": "https://www.youtube.com/watch?v=OINppmPan0o",
      "thumbnail": "https://i.ytimg.com/vi/OINppmPan0o/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, figure skating duo Vadym Kolesnik and Emilia Zingas sit down with Apolo Ohno ahead of the Winter Olympics on this episode of Making Team USA presented by Xfinity. The short preview emphasizes the partnership being \"built on trust\" as they prepare for the Games.",
        "bullets": [
          "Interview-style episode featuring Vadym Kolesnik and Emilia Zingas with Apolo Ohno.",
          "Positioned as a pre-Winter Olympics feature on Making Team USA presented by Xfinity.",
          "Central theme highlighted: trust between skating partners.",
          "Published by Team USA on YouTube (Jan 16, 2026) with links to Team USA social channels.",
          "Promotional content encouraging subscriptions and follows across Team USA platforms."
        ],
        "takeaways": [
          "Trust and strong partnerships are critical when coordinating teams for high-stakes events.",
          "Advance preparation and clear communication matter before major operational milestones.",
          "Experienced mentors or spokespeople can help align teams and communicate readiness to stakeholders.",
          "Use official channels and short, focused content to keep stakeholders engaged and informed ahead of key events."
        ],
        "tags": [
          "figure skating",
          "Vadym Kolesnik",
          "Emilia Zingas",
          "Apolo Ohno",
          "Winter Olympics",
          "Making Team USA",
          "Xfinity",
          "Team USA"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, eksperci KPMG dyskutują o roli AI w cenach transferowych — od monitorowania rentowności i automatyzacji dokumentacji po inteligentne benchmarki i integrację z ERP. Omawiają też ograniczenia i ryzyka (dane, bezpieczeństwo, RODO, halucynacje) oraz podkreślają, że AI wspiera, a nie zastępuje doradców, wymagając uporządkowania procesów i rozwoju kompetencji.",
        "bullets": [
          "AI już stosowane do monitorowania rentowności, porównań benchmarkingowych i automatyzacji dokumentacji cen transferowych.",
          "Nie zastąpi doradców podatkowych, lecz wzmocni ich pracę i przyspieszy rozwój młodszych pracowników.",
          "Ryzyka: ochrona danych, bezpieczeństwo, RODO i zjawisko halucynacji modeli AI.",
          "Digital Gateway wskazany jako bezpieczne środowisko do pracy z AI i danymi w obszarze podatków.",
          "Kluczowe kroki wdrożeniowe: integracja z ERP, uporządkowanie procesów i budowa filarów transformacji."
        ],
        "takeaways": [
          "Zapewnij bezpieczne środowisko przetwarzania (np. rozwiązania typu Digital Gateway) dla modeli AI pracujących na danych podatkowych.",
          "Zadbaj o zgodność z RODO i mechanizmy ograniczające ryzyko „halucynacji” AI przy automatyzacji dokumentacji.",
          "Przygotuj infrastrukturę do integracji AI z ERP oraz do obsługi inteligentnych benchmarków i monitoringu rentowności.",
          "Wdrożenie wymaga uporządkowanych procesów i planu rozwoju kompetencji zespołów pracujących z AI."
        ],
        "tags": [
          "podatki",
          "AI",
          "ceny transferowe",
          "transfer pricing",
          "Digital Gateway",
          "RODO",
          "ERP integration",
          "automatyzacja",
          "bezpieczeństwo danych",
          "benchmarking"
        ]
      }
    },
    {
      "id": "dGfcT63U7Mo",
      "title": "The 2026 U.S. Olympic Figure Skating Team 🇺🇸",
      "channel": "Team USA",
      "published_at": "2026-01-15T20:43:24.000Z",
      "url": "https://www.youtube.com/watch?v=dGfcT63U7Mo",
      "thumbnail": "https://i.ytimg.com/vi/dGfcT63U7Mo/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This video presents the U.S. Olympic figure skating lineup and was posted by Team USA. The short description includes a fire emoji and the hashtag #WinterOlympics.",
        "bullets": [
          "Title: The 2026 U.S. Olympic Figure Skating Team",
          "Channel: Team USA",
          "Published: 2026-01-15T20:43:24.000Z",
          "Description text: \"This U.S. Olympic Figure Skating lineup. 🔥\"",
          "Hashtag used: #WinterOlympics"
        ],
        "takeaways": [
          "Tagged #WinterOlympics — content is associated with the Winter Olympics and may align with event-driven audience interest.",
          "Posted on the official Team USA channel — likely to be an authoritative source and could attract higher visibility.",
          "Published in January 2026 — timing suggests relevance to the 2026 Olympic period when capacity planning should be reviewed."
        ],
        "tags": [
          "US Olympic",
          "Figure Skating",
          "Team USA",
          "Winter Olympics",
          "Olympics2026",
          "Lineup",
          "Sports",
          "FigureSkating",
          "USOC"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, whether you’re tackling workouts, projects, or personal goals, Copilot is presented as a way to keep momentum going. The message positions Copilot as a tool to help maintain progress across personal and work-related activities.",
        "bullets": [
          "Focuses on keeping momentum for workouts.",
          "Aims to sustain progress on projects.",
          "Supports personal goal tracking and continuation.",
          "Positions Copilot as a general-purpose aid for staying on track."
        ],
        "takeaways": [
          "Based on the available description, the core value is maintaining momentum—decision-makers should consider whether that aligns with operational and project continuity needs.",
          "Consider piloting Copilot where sustained progress matters (long projects, routine workflows) to see if it helps teams keep tasks moving.",
          "Assess training and adoption requirements so staff can effectively use Copilot to support ongoing infrastructure or operations work.",
          "Measure impact on goal completion and workflow continuity in a controlled trial before wider rollout, since the stated benefit centers on keeping momentum."
        ],
        "tags": [
          "Copilot",
          "Microsoft Copilot",
          "productivity",
          "momentum",
          "workouts",
          "projects",
          "personal goals",
          "AI assistant",
          "goal tracking"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights how precision and speed matter in high-frequency trading and spotlights the Dell PowerEdge R770AP server powered by Intel® Xeon® 6 processors. It says this platform can perform hundreds of trades in seconds to help maximize gains and minimize losses and positions Intel Xeon 6 CPUs as defining the future of finance.",
        "bullets": [
          "High-frequency trading hinges on precision and speed.",
          "Dell PowerEdge R770AP server is showcased as the hardware platform.",
          "Powered by Intel® Xeon® 6 processors for high-performance trading workloads.",
          "Claimed ability to perform hundreds of trades in seconds.",
          "Framed as technology shaping the future of finance."
        ],
        "takeaways": [
          "Prioritize platforms that deliver precision and speed for HFT workloads.",
          "Evaluate server options like the Dell PowerEdge R770AP for latency-sensitive trading environments.",
          "Consider Intel Xeon 6 CPU performance when planning finance-focused infrastructure.",
          "Recognize high-performance compute as a factor in maximizing gains and minimizing losses.",
          "Plan infrastructure updates with future-facing CPU capabilities in mind."
        ],
        "tags": [
          "high-frequency trading",
          "HFT",
          "Intel Xeon 6",
          "Dell PowerEdge R770AP",
          "low latency",
          "finance servers",
          "trading infrastructure",
          "data center",
          "high-performance compute"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the short video says the creative spark was lost and that Copilot brought it back to life. It’s a brief promotional message inviting viewers to download Copilot via the link in the channel’s bio.",
        "bullets": [
          "Promotional message positioning Copilot as a creativity-restoring tool.",
          "Core claim: 'The creative spark was out. Copilot brought it back to life.'",
          "Call to action: download Copilot (link in bio).",
          "No transcript or technical details provided.",
          "Very short, focused on prompting trials/downloads."
        ],
        "takeaways": [
          "Advertisement claims Copilot can revive creativity—consider this as a prompt to evaluate the tool rather than a technical endorsement.",
          "For grid/data center teams needing brainstorming or planning support, the video suggests trying Copilot via the provided download link.",
          "The content is promotional and lacks technical or performance details, so assess suitability through direct trial and internal evaluation."
        ],
        "tags": [
          "Copilot",
          "Microsoft",
          "creativity",
          "AI",
          "download",
          "promo",
          "link-in-bio",
          "productivity",
          "ad",
          "2026"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This video spotlights the open-world martial arts RPG Where Winds Meet running with DLSS 4 featuring Multi Frame Generation and #RTXOn visuals. Footage is credited to @DigitalDreamsyt.",
        "bullets": [
          "Open-world martial arts RPG: Where Winds Meet",
          "Showcases DLSS 4 with Multi Frame Generation",
          "Highlights #RTXOn visual effects",
          "Footage/credit: @DigitalDreamsyt"
        ],
        "takeaways": [
          "The demo highlights DLSS 4 with Multi Frame Generation — ensure test and demo systems support DLSS 4 features.",
          "RTX On tag implies ray-tracing visuals — plan for GPUs and drivers that enable real-time ray tracing for accurate demos.",
          "Use representative game footage (like open-world titles) when validating sustained graphics and capture pipelines.",
          "Track source/credits (e.g., @DigitalDreamsyt) for asset licensing and attribution in demo workflows."
        ],
        "tags": [
          "WhereWindsMeet",
          "DLSS4",
          "MultiFrameGeneration",
          "RTXOn",
          "open-world",
          "martial-arts",
          "gameplay",
          "DigitalDreamsyt"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this Intel Business video features Taha Khalifa and is published on the Intel Business YouTube channel. The channel offers IT resources, guidance, and expert insights spanning data centers to devices and includes links to the Intel Business website and social channels.",
        "bullets": [
          "Video title: Taha Khalifa (Intel) on the Intel Business channel.",
          "Channel focus: IT information and guidance from data centers to devices.",
          "Provides resources, guidance, and expert insights for IT projects.",
          "Includes links to Intel Business website and social channels (X, LinkedIn, Facebook).",
          "No transcript is available for this video."
        ],
        "takeaways": [
          "Intel Business positions itself as a resource hub for data center and enterprise IT decision-making.",
          "Visit the Intel Business website for downloadable resources and project guidance.",
          "Follow Intel Business on social channels to receive updates and additional content.",
          "The video features an Intel representative (Taha Khalifa), indicating vendor expertise worth reviewing for Intel-related perspectives."
        ],
        "tags": [
          "Intel",
          "Intel Business",
          "Taha Khalifa",
          "data center",
          "IT resources",
          "enterprise IT",
          "IT guidance",
          "subscribe"
        ]
      }
    },
    {
      "id": "kSocjh8PZnQ",
      "title": "Rynek dóbr luksusowych w obliczu transformacji | Andrzej Marczak, Tomasz Wiśniewski",
      "channel": "KPMG Poland",
      "published_at": "2026-01-13T10:23:31.000Z",
      "url": "https://www.youtube.com/watch?v=kSocjh8PZnQ",
      "thumbnail": "https://i.ytimg.com/vi/kSocjh8PZnQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this KPMG ON AIR episode (guests: Andrzej Marczak and Tomasz Wiśniewski) surveys current transformations in the luxury goods market, highlighting shifts toward experience-driven luxury, ESG and responsible sourcing, and the rise of \"affordable luxury.\" The discussion contrasts global softening with continued growth and a fragmented but expanding luxury market in Poland, and touches on drivers such as personalization, Gen Z preferences, tourism/hospitality, the art market, and emerging roles for AI.",
        "bullets": [
          "Trend toward experiences over ownership and growing \"affordable luxury\" categories.",
          "Concentration of spend: the top ~2% of customers account for ~40% of the market.",
          "Rising importance of personalization, exclusive client experiences, and Gen Z preference for experiences.",
          "ESG and responsible luxury (e.g., eco-leathers, certifications) are increasing in significance.",
          "Polish market is growing yet dispersed; future themes include luxury hospitality/tourism, art market dynamics, and AI alongside craftsmanship."
        ],
        "takeaways": [
          "ESG emphasis in luxury suggests prioritizing energy-efficient, certified operations to meet brand and client sustainability expectations.",
          "AI and personalization trends point to growing demand for compute and low-latency data services—plan capacity and performance for advanced workloads.",
          "Poland's growing but fragmented luxury market indicates potential regional demand for additional reliable capacity and localized services.",
          "Luxury hospitality and tourism focus increases the need for high-availability connectivity and resiliency to support premium guest experiences.",
          "Concentration of high-value customers implies stringent requirements for security, privacy, and uptime to protect brand reputation."
        ],
        "tags": [
          "luksus",
          "ESG",
          "Polska",
          "personalizacja",
          "AI",
          "turystyka",
          "affordable-luxury",
          "rynek-sztuki",
          "KPMG"
        ]
      }
    }
  ]
}