{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-26T02:46:36.964Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "9vS5kvxbPMQ",
      "title": "My Porta-Potty Business Brings In $4.3M/Year",
      "channel": "CNBC Make It",
      "published_at": "2026-01-24T15:00:30.000Z",
      "url": "https://www.youtube.com/watch?v=9vS5kvxbPMQ",
      "thumbnail": "https://i.ytimg.com/vi/9vS5kvxbPMQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Daniel Tom, 31, owns Bay Area Sanitation, which operates almost 2,000 portable toilets serving construction sites and events across the San Francisco Bay Area. The company reported $4.3 million in total income in 2025.",
        "bullets": [
          "Owner: Daniel Tom, 31",
          "Company: Bay Area Sanitation",
          "Fleet: almost 2,000 portable toilets",
          "Service area: construction sites and events across the San Francisco Bay Area",
          "2025 income: $4.3 million"
        ],
        "takeaways": [
          "The business scale (≈2,000 units) and $4.3M revenue indicate sizable, localized service operations in a dense metro area.",
          "Service demand is tied to construction sites and events, implying location-specific and time-variable operational needs to consider in urban planning.",
          "Large fleets of mobile-service assets represent potential partners or customers when evaluating on-site infrastructure or resilience solutions.",
          "When assessing regional infrastructure and capacity, include commercial service sectors like sanitation fleets as part of overall urban service loads."
        ],
        "tags": [
          "portable-toilets",
          "sanitation",
          "Bay-Area",
          "small-business",
          "entrepreneurship",
          "construction",
          "events",
          "revenue",
          "CNBCMakeIt",
          "DanielTom"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video shows Jo discovering the power of Copilot Groups to make route planning easy. It presents Copilot Groups as a Microsoft Copilot feature focused on simplifying route-planning tasks.",
        "bullets": [
          "Jo discovers Copilot Groups.",
          "Primary focus: making route planning easy.",
          "Positions Copilot Groups as a Microsoft Copilot capability.",
          "Short description includes hashtags: #copilot #microsoftcopilot #ai.",
          "Video title: Zip Up, Clip In, Copilot On."
        ],
        "takeaways": [
          "The video frames Copilot Groups as a tool for simplifying route planning—assess its relevance for your routing and logistics workflows.",
          "For operations that depend on coordinated routes (maintenance, field teams, deliveries), Copilot Groups could be worth evaluating in pilots or demos.",
          "If considering adoption, review Microsoft Copilot integration, data access, and governance requirements for operational planning tools."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "copilot-groups",
          "route-planning",
          "logistics",
          "productivity",
          "automation"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Podcast KPMG ON AIR z Katarzyną Chojniak i Alicją Barską omawia praktyczne zastosowania AI w audycie, prezentując konkretne narzędzia i korzyści dla klientów. Rozmowa porusza m.in. analizę pełnych populacji, konwersacyjnych asystentów (Clara AI), platformę KPMG Clara oraz wyzwania związane z kompetencjami audytorów, bezpieczeństwem danych i regulacjami.",
        "bullets": [
          "Gospodarze: Katarzyna Chojniak (Dyrektor, Dział Audytu) i Alicja Barska (Dyrektor, Liderka innowacji audytu).",
          "Przedstawione narzędzia: AI Transaction Scoring Tool (analiza pełnych populacji) oraz Clara AI (konwersacyjny asystent i wyspecjalizowani agenci).",
          "KPMG Clara – platforma do zarządzania badaniem w czasie rzeczywistym oraz Clara for Clients do komunikacji z klientem.",
          "Zmiana metodologii: odejście od próbkowania na rzecz analizy pełnych populacji.",
          "Poruszono też tematy: nowe kompetencje audytorów, bezpieczeństwo danych, środowisko regulacyjne i potencjalne zagrożenia AI."
        ],
        "takeaways": [
          "Rozważenie narzędzi AI do analizy dużych zbiorów danych może przyspieszyć i zwiększyć precyzję audytów infrastruktury IT/centrum danych.",
          "Wdrożenie AI wymaga bezpiecznego środowiska danych i zgodności z regulacjami — priorytet dla decyzji o integracji rozwiązań audytowych.",
          "Systemy do zarządzania badaniem w czasie rzeczywistym (np. KPMG Clara) poprawiają komunikację z audytorami i klientami oraz ułatwiają monitorowanie zgodności operacyjnej.",
          "Przejście od próbkowania do analizy pełnych populacji zmienia wymagania wobec danych i narzędzi — warto ocenić jakość i dostępność danych operacyjnych w centrum danych.",
          "Inwestycja w kompetencje zespołu (praca z AI, interpretacja wyników) jest kluczowa, by w pełni wykorzystać korzyści narzędzi AI."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMG",
          "Clara",
          "analiza danych",
          "bezpieczeństwo danych",
          "innowacje",
          "audytorzy"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield has officially launched and the trailer highlights support for NVIDIA DLSS 4 with Multi Frame Generation. The game is a 3D real-time strategy RPG where players take the role of the Endministrator exploring Talos-II; the footage was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 Multi Frame Generation 4X Mode.",
        "bullets": [
          "Arknights: Endfield launch trailer showcases NVIDIA DLSS 4 with Multi Frame Generation.",
          "Game is a 3D real-time strategy RPG; player is the Endministrator across Talos-II.",
          "Trailer footage captured on GeForce RTX 5080 at 4K Ultra with DLSS 4 MFG 4X Mode.",
          "Description includes links to NVIDIA DLSS 4 article and the game's official site.",
          "Official social channels for Arknights: Endfield and NVIDIA GeForce are listed."
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is featured in this launch—use RTX 5080 + DLSS4 4X Mode as a reproducible baseline for benchmarking.",
          "Captured 4K Ultra footage provides a reference workload for testing GPU performance, image quality, and streaming pipelines.",
          "NVIDIA-provided DLSS 4 article link offers a primary source for technical details and implementation guidance.",
          "Assets and trailer footage can be used for marketing or demoing RTX 50-series capabilities in validation environments."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "NVIDIA",
          "RTX5080",
          "4K",
          "RealTimeStrategy",
          "GeForce",
          "GameLaunch",
          "GamingTech"
        ]
      }
    }
  ]
}