{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-22T20:51:31.631Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, KPMG leaders Katarzyna Chojniak and Alicja Barska present AI as a current, everyday part of audit work, explaining practical tools (full-population analysis, conversational assistants) and the KPMG Clara platform. They outline client benefits, changing auditor roles and competencies, and discuss implementation challenges including data security, regulation, and potential AI risks.",
        "bullets": [
          "AI Transaction Scoring Tool enables analysis of full populations instead of sampling.",
          "Clara AI provides conversational assistance and specialized agents to support auditors.",
          "AI supports documentation and disclosure analysis and is integrated in KPMG Clara for real-time audit management.",
          "Clara for Clients modernizes communication between audit teams and clients.",
          "Discussion includes auditor upskilling needs, implementation challenges, data security/regulatory concerns, and AI-related risks."
        ],
        "takeaways": [
          "Expect more comprehensive, data-driven audit evidence (full-population analysis) for infrastructure and asset data.",
          "Use client-facing platforms (e.g., Clara for Clients) to improve real-time communication and transparency during audits.",
          "Ensure strong data security and regulatory compliance when sharing operational and financial data with auditors using AI tools.",
          "Prepare internal teams to interpret AI-driven audit findings and adapt processes as auditor roles evolve."
        ],
        "tags": [
          "AI",
          "audit",
          "KPMG",
          "KPMG Clara",
          "Clara AI",
          "transaction scoring",
          "data security",
          "audit innovation"
        ]
      }
    },
    {
      "id": "6hu7hYLiu08",
      "title": "Get Step-By-Step Fixes with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-21T20:14:00.000Z",
      "url": "https://www.youtube.com/watch?v=6hu7hYLiu08",
      "thumbnail": "https://i.ytimg.com/vi/6hu7hYLiu08/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Copilot provides real-time visual support for home projects and repairs, offering step-by-step instructions. It can \"see what you see\" and deliver clear guidance for issues such as leaky pipes and overflowing washing machines.",
        "bullets": [
          "Real-time support for home projects and repairs",
          "Visual capability: Copilot can see what you see",
          "Delivers step-by-step instructions",
          "Examples include leaky pipes and overflowing washing machines",
          "Focus on clear, on-the-spot guidance"
        ],
        "takeaways": [
          "The described capability centers on real-time visual, step-by-step repair guidance—evaluate if similar functionality would aid on-site infrastructure maintenance.",
          "Visual guidance that helps non-experts follow instructions could reduce dependence on specialist technicians for routine fixes.",
          "Real-time troubleshooting and clear instructions may shorten diagnosis and repair time for physical equipment.",
          "Consider whether Copilot-style remote visual assistance could support operator training and remote support workflows."
        ],
        "tags": [
          "Copilot",
          "home repair",
          "real-time support",
          "visual assistance",
          "step-by-step",
          "plumbing",
          "appliances",
          "troubleshooting",
          "Microsoft Copilot",
          "repair guidance"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield has officially launched and the trailer spotlights NVIDIA DLSS 4 with Multi Frame Generation. The game is a 3D real-time strategy RPG where you play the Endministrator exploring Talos-II; the footage was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 Multi Frame Generation 4X Mode.",
        "bullets": [
          "Arknights: Endfield officially launched.",
          "Trailer highlights NVIDIA DLSS 4 with Multi Frame Generation.",
          "3D real-time strategy RPG—player is the Endministrator exploring Talos-II.",
          "Footage captured on GeForce RTX 5080 at 4K Ultra, DLSS 4 MFG 4X Mode.",
          "Links provided for the game site and official social/NVIDIA GeForce channels."
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is shipping in a released title—ensure hardware stack includes GPUs that support DLSS 4 (example shown: RTX 5080) for testing and demos.",
          "4K Ultra captures with DLSS 4 MFG 4X indicate significant GPU compute per stream—plan for sufficient high-end GPU capacity for capture, QA, and showcase workloads.",
          "Distribution of 4K promotional assets can increase storage and bandwidth needs—account for higher egress and archival capacity.",
          "NVIDIA is promoting the title across GeForce channels—use platform partner channels when coordinating launches or promotional activity."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "RTX5080",
          "4K",
          "GeForce",
          "NVIDIA",
          "RTS",
          "Gaming",
          "Trailer"
        ]
      }
    },
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video shows how Rate Insurance boosts agent efficiency using Agentforce and Gemini and references the Google Cloud–Salesforce partnership. Viewers are directed to a link to learn more about that partnership.",
        "bullets": [
          "Demonstrates Rate Insurance improving agent efficiency with Agentforce and Gemini.",
          "References the Google Cloud and Salesforce partnership (link provided).",
          "Hosted on the Google Cloud channel.",
          "Publication date: 2026-01-20."
        ],
        "takeaways": [
          "If your organization supports customer-facing systems, review capacity and integration needs for CRM and AI workloads referenced (Google Cloud + Salesforce, Gemini).",
          "Evaluate interoperability and vendor partnership impacts when planning infrastructure for agent productivity tools.",
          "Consider including AI/CRM integration scenarios in monitoring, security, and procurement reviews to support similar efficiency initiatives."
        ],
        "tags": [
          "Google Cloud",
          "Salesforce",
          "Rate Insurance",
          "Agentforce",
          "Gemini",
          "agent efficiency",
          "cloud partnership",
          "CRM"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Charly Stoever, a 35-year-old financial coach, has spent the last 18 months living out of two suitcases and traveling while pet sitting full time to live rent-free in Portland, Oregon. She brings in about $60,000 a year doing this, and the video is part of CNBC Make It's Millennial Money series.",
        "bullets": [
          "Charly Stoever, 35, is a financial coach living rent-free in Portland by pet sitting full time.",
          "She has spent the past 18 months living out of two suitcases while traveling.",
          "Her pet-sitting approach generates roughly $60,000 per year.",
          "This profile is part of CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "Alternative compensation or benefit models (for example, housing tied to services) can materially reduce employees' housing costs and effectively increase net income.",
          "A sustainable, mobile lifestyle on an annual income of about $60K suggests workforce flexibility that may factor into location and staffing strategies.",
          "Non-traditional income and living arrangements can alter local labor pool expectations in high-cost areas, which may be relevant for recruitment and retention planning."
        ],
        "tags": [
          "pet-sitting",
          "rent-free",
          "travel",
          "minimalism",
          "financial-coach",
          "Portland",
          "CNBCMakeIt",
          "MillennialMoney",
          "60k"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, a giant bubble of carbon dioxide can store 20 megawatts of energy. The description says these CO2-based batteries are intended to help buffer fluctuations in renewable energy and support the global shift to clean energy.",
        "bullets": [
          "Giant CO2 bubble stores 20 megawatts of energy.",
          "Designed to address fluctuations in renewable energy resources.",
          "Described as a battery technology using carbon dioxide.",
          "Presented as a tool to power the transition to clean energy worldwide."
        ],
        "takeaways": [
          "20 MW capacity positions this technology as a candidate for managing significant renewable variability at grid or facility scale.",
          "Grid operators and data center planners should monitor development of CO2-based storage as a potential option for resilience and load balancing.",
          "Evaluate how a CO2-bubble battery concept might integrate with existing renewable assets and operational needs as more technical and deployment details emerge."
        ],
        "tags": [
          "ieee",
          "tech",
          "ieeespectrum",
          "innovation",
          "future",
          "futuristic",
          "energy",
          "battery"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI już teraz wpływa na obszar cen transferowych — od monitorowania rentowności i analiz porównawczych po automatyzację dokumentacji. W podcaście eksperci KPMG, Monika Palmowska i Jakub Roszkiewicz, omawiają, że AI może wzmacniać pracę doradców (nie zastępować ich), wskazują przykłady zastosowań, główne ryzyka (dane, bezpieczeństwo, RODO, halucynacje) oraz praktyczne kroki wdrożeniowe, w tym integrację z ERP i konieczność uporządkowania procesów.",
        "bullets": [
          "Zastosowania AI: monitoring rentowności, benchmarki porównawcze, automatyzacja dokumentacji cen transferowych.",
          "AI jako narzędzie wspierające doradców podatkowych, nie jako ich zastępstwo.",
          "Główne ryzyka: jakość danych, bezpieczeństwo, zgodność z RODO i problem halucynacji AI.",
          "Digital Gateway wskazany jako bezpieczne środowisko do pracy z AI.",
          "Wdrożenie: integracja z ERP, uporządkowanie procesów i określenie pierwszych kroków transformacji."
        ],
        "takeaways": [
          "Wykorzystaj AI do ciągłego monitoringu rentowności operacji i szybszego wykrywania odchyleń wpływających na koszty i marże.",
          "Automatyzacja dokumentacji może zmniejszyć obciążenie compliance i przyspieszyć raportowanie transfer-pricingowe.",
          "Priorytetem są silne reguły zarządzania danymi i bezpieczeństwo (zgodność z RODO) przed wdrożeniem rozwiązań AI.",
          "Rozważ korzystanie z bezpiecznych środowisk typu Digital Gateway dla pracy z wrażliwymi danymi.",
          "Zacznij od uporządkowania procesów i integracji z ERP — to fundament skutecznej transformacji AI."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "transfer-pricing",
          "podatki",
          "automatyzacja",
          "ERP",
          "bezpieczeństwo danych",
          "RODO",
          "DigitalGateway"
        ]
      }
    }
  ]
}