{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-20T23:44:25.275Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "jOC3G_N20lY",
      "title": "Year-end toolkit: Cash flow classification",
      "channel": "PwC US",
      "published_at": "2026-01-20T22:41:11.000Z",
      "url": "https://www.youtube.com/watch?v=jOC3G_N20lY",
      "thumbnail": "https://i.ytimg.com/vi/jOC3G_N20lY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This PwC year‑end toolkit episode focuses on the statement of cash flows, highlighting its importance to investors and regulatory scrutiny. The discussion covers SEC comment letter themes, practical considerations for debt restructurings, payment processing arrangements, business combinations, and the FASB targeted‑improvements project, plus reminders and year‑end best practices.",
        "bullets": [
          "Overview and key reminders for the statement of cash flows (1:05).",
          "SEC comment letter themes and common reporting issues (3:46).",
          "Practical considerations for debt restructurings and cash flow presentation (7:52).",
          "Guidance on payment processing arrangements and their cash flow effects (15:21).",
          "Business combination cash flow issues and FASB targeted‑improvements project (20:27, 32:56)."
        ],
        "takeaways": [
          "Ensure clear classification of operating, investing, and financing cash flows for large capital projects to meet investor and regulator expectations.",
          "When renegotiating or restructuring debt, evaluate how changes will affect cash flow presentation and related disclosures.",
          "Review payment processing arrangements to confirm how receipts and payments are reported in the statement of cash flows.",
          "For acquisitions, verify cash flow reporting and disclosures and monitor the FASB project for potential reporting changes."
        ],
        "tags": [
          "statement of cash flows",
          "SEC comment letters",
          "debt restructurings",
          "payment processing",
          "business combinations",
          "FASB",
          "year-end reporting",
          "PwC",
          "accounting",
          "disclosures"
        ]
      }
    },
    {
      "id": "3wQ_yte0TTo",
      "title": "Build Voice Agents with Amazon Nova 2 Sonic &amp; AgentCore | AWS Show and Tell",
      "channel": "AWS Events",
      "published_at": "2026-01-20T22:10:10.000Z",
      "url": "https://www.youtube.com/watch?v=3wQ_yte0TTo",
      "thumbnail": "https://i.ytimg.com/vi/3wQ_yte0TTo/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This AWS Show and Tell episode introduces Amazon Nova 2 Sonic and demonstrates building voice agents using Amazon Bedrock AgentCore and the Strands BidiAgent framework. It highlights new Nova 2 Sonic capabilities (polyglot voices, 1‑million token context windows, asynchronous tool calling), Bedrock AgentCore bidirectional WebSocket streaming, and includes hands-on Python demos and workshop code.",
        "bullets": [
          "Nova 2 Sonic features: polyglot voices, 1‑million token context windows, asynchronous tool calling.",
          "AgentCore bidirectional streaming via WebSocket enables real-time two-way voice interactions.",
          "Strands BidiAgent integrates with Nova Sonic to handle interruptions and agent-to-agent collaboration.",
          "Workshop includes practical Python code examples and best practices for production-ready voice agents.",
          "Demo materials and code samples available on the official GitHub workshop link."
        ],
        "takeaways": [
          "1‑million token context windows imply increased memory and compute needs per session—plan capacity and provisioning accordingly.",
          "Bidirectional WebSocket streaming requires low‑latency, high‑availability networking for responsive voice interactions.",
          "Polyglot voice support and asynchronous tool calling expand multilingual and multi-service workflows—consider localization and integration testing.",
          "Provided workshop code can accelerate evaluation and proof‑of‑concept deployments, reducing integration time."
        ],
        "tags": [
          "Amazon Nova 2",
          "Nova Sonic",
          "AgentCore",
          "Amazon Bedrock",
          "Strands BidiAgent",
          "voice agents",
          "bidirectional streaming",
          "python"
        ]
      }
    },
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video shows how Rate Insurance boosts agent efficiency using Agentforce and Gemini. It also includes a link to learn more about the Google Cloud and Salesforce partnership.",
        "bullets": [
          "Showcases Rate Insurance improving agent efficiency with Agentforce and Gemini.",
          "Names the specific solutions: Agentforce and Gemini.",
          "References the Google Cloud and Salesforce partnership (link provided).",
          "Video format: a watchable demonstration (no transcript available)."
        ],
        "takeaways": [
          "The video highlights a use case where Agentforce and Gemini are used to boost agent efficiency for Rate Insurance.",
          "The content is framed within the context of a Google Cloud and Salesforce partnership (link provided).",
          "Decision-makers should note the cited cloud/CRM partnership and the named solutions when reviewing related infrastructure or integration needs."
        ],
        "tags": [
          "Google Cloud",
          "Salesforce",
          "Rate Insurance",
          "Agentforce",
          "Gemini",
          "agent-efficiency",
          "cloud-partnership",
          "demo"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Charly Stoever, a 35-year-old financial coach, has spent the last 18 months living out of two suitcases while pet sitting full time in Portland, Oregon. She lives rent-free through pet sitting and brings in $60,000 a year; the profile is part of CNBC Make It's Millennial Money series.",
        "bullets": [
          "Charly Stoever, 35, is a financial coach.",
          "She lives rent-free in Portland by pet sitting full time.",
          "Has lived out of two suitcases for the past 18 months.",
          "Earns $60,000 per year from pet sitting.",
          "Feature appears in CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "This profile documents a person earning $60,000/year through a nontraditional, location-based service (full-time pet sitting).",
          "It presents an example of living rent-free in an urban area (Portland) by exchanging housing-related services for accommodation.",
          "The subject maintains a highly mobile, low-possessions lifestyle (living from two suitcases) while sustaining income.",
          "No additional operational or infrastructure implications for grid or data center management are provided in the description."
        ],
        "tags": [
          "pet-sitting",
          "rent-free",
          "Portland",
          "financial-coach",
          "Charly Stoever",
          "CNBC Make It",
          "Millennial Money",
          "travel",
          "60k-per-year"
        ]
      }
    },
    {
      "id": "wicD8G0rn1Y",
      "title": "New: AWS Lambda tenant isolation | Serverless Office Hours",
      "channel": "AWS Events",
      "published_at": "2026-01-20T15:40:24.000Z",
      "url": "https://www.youtube.com/watch?v=wicD8G0rn1Y",
      "thumbnail": "https://i.ytimg.com/vi/wicD8G0rn1Y/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AWS Lambda's new tenant isolation mode provides dedicated execution environments per tenant, ensuring cached data and execution contexts remain siloed to prevent cross-tenant data exposure. The feature aims to simplify infrastructure, enable faster scaling during traffic spikes while maintaining strong isolation guarantees, and includes built-in monitoring with automatic tenant identifier logging for easier tenant-specific debugging.",
        "bullets": [
          "Dedicated execution environments per tenant to silo cached data and execution contexts.",
          "Prevents cross-tenant data exposure by enforcing isolation boundaries.",
          "Reduces infrastructure complexity for multi-tenant SaaS deployments.",
          "Enables faster scaling during traffic spikes while preserving isolation guarantees.",
          "Built-in monitoring with automatic tenant identifier logging for easier debugging."
        ],
        "takeaways": [
          "Strengthens tenant-level security by eliminating shared cached execution contexts.",
          "Simplifies multi-tenant architecture and operational management by reducing infrastructure complexity.",
          "Improves resilience and responsiveness during traffic spikes through faster scaling with maintained isolation.",
          "Streamlines troubleshooting of tenant-specific issues via automatic tenant identifier logging."
        ],
        "tags": [
          "aws",
          "aws-lambda",
          "tenant-isolation",
          "serverless",
          "multi-tenant",
          "security",
          "monitoring",
          "scaling"
        ]
      }
    },
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Dr. Anna Chacon, 39, is a Miami-based dermatologist who runs a private practice and reportedly earns $900,000 a year. Her net worth is about $6 million, consisting of $3.2 million in investments, a $1.9 million home, and a $1.1 million office building.",
        "bullets": [
          "Dr. Anna Chacon, age 39, is a dermatologist in Miami, FL.",
          "She operates her own private dermatology practice.",
          "Reported annual earnings: $900,000.",
          "Estimated net worth: approximately $6 million.",
          "Net worth breakdown: $3.2M investments, $1.9M home, $1.1M office building."
        ],
        "takeaways": [
          "The description focuses solely on personal earnings and asset allocation, not on facility or infrastructure details.",
          "No information is provided about energy use, power requirements, or operational infrastructure that would inform grid or data center planning.",
          "For grid/data center decision-makers, this content offers no actionable technical or capacity insights and should not be used for infrastructure planning."
        ],
        "tags": [
          "dermatologist",
          "private practice",
          "earnings",
          "net worth",
          "investments",
          "Miami",
          "real estate",
          "CNBC Make It",
          "personal finance",
          "high income"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This giant bubble of carbon dioxide can store 20 megawatts of energy. The description frames the CO2 battery as a way to buffer fluctuating renewable generation and help power the global shift to clean energy.",
        "bullets": [
          "Giant carbon dioxide bubble stores 20 megawatts of energy.",
          "Designed to address fluctuations in renewable energy supply.",
          "Presented as a battery technology to support the clean-energy transition.",
          "Positioned for impact across the globe."
        ],
        "takeaways": [
          "20 MW storage capacity is a scale metric to compare against grid or data-center needs.",
          "Described purpose is smoothing renewable intermittency—consider integration with variable renewables.",
          "Framed as a globally relevant clean-energy solution—monitor availability and deployment for long-term planning."
        ],
        "tags": [
          "ieee",
          "tech",
          "ieeespectrum",
          "innovation",
          "future",
          "futuristic",
          "energy",
          "battery"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI is already reshaping transfer pricing workflows—supporting profitability monitoring, comparative benchmarking and automation of transfer pricing documentation. The podcast discussion also covers that AI should augment tax advisors (not replace them), highlights data/security and GDPR challenges, and outlines practical implementation steps such as ERP integration, secure environments (Digital Gateway) and process reorganization.",
        "bullets": [
          "AI use cases: monitoring rentowności, benchmarking porównawcze, automatyzacja dokumentacji cen transferowych.",
          "AI as an augmenting tool: wspiera doradców podatkowych i rozwój młodszych pracowników, ale ich nie zastąpi.",
          "Główne ryzyka: dane, bezpieczeństwo, RODO oraz problem halucynacji modelu.",
          "Bezpieczne środowisko pracy z AI: Digital Gateway i uwzględnienie regulacji (RODO).",
          "Wdrożenie: integracja z ERP, uporządkowanie procesów i definiowanie pierwszych kroków/pilotów."
        ],
        "takeaways": [
          "Rozważ automatyzację monitoringu rentowności i dokumentacji cen transferowych, by zredukować ręczne obciążenia operacyjne.",
          "Priorytet: silna governance danych i zgodność z RODO — zabezpieczone środowisko (np. Digital Gateway) przed wdrożeniem AI.",
          "Plan integrację AI z ERP i inteligentnymi benchmarkami, by uzyskać spójne, skalowalne raportowanie transfer pricing.",
          "Zacznij od uporządkowania procesów i pilotażowych implementacji oraz inwestuj w rozwój kompetencji zespołu podatkowego."
        ],
        "tags": [
          "podatki",
          "AI",
          "ceny transferowe",
          "transfer-pricing",
          "automatyzacja",
          "RODO",
          "bezpieczeństwo",
          "ERP",
          "KPMG",
          "Digital Gateway"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video encourages stacking small wins to keep momentum using Microsoft Copilot. It presents Copilot as a companion for a range of activities—workouts, projects, and personal goals—to help users maintain progress.",
        "bullets": [
          "Encourages stacking small wins to maintain momentum.",
          "Positions Microsoft Copilot as a companion for workouts, projects, and personal goals.",
          "Frames Copilot as a tool for sustaining progress across tasks.",
          "Short, motivational message rather than a technical overview.",
          "Focuses on practical, everyday productivity and goal support."
        ],
        "takeaways": [
          "So what: Copilot is presented as a tool to sustain momentum on projects—consider its positioning when evaluating productivity solutions.",
          "So what: Its cross-domain framing (workouts, projects, personal goals) highlights a user-focused, flexible approach worth assessing for staff adoption.",
          "So what: Emphasis on keeping progress suggests tracking actual impact on task completion and timelines if integrating similar tools."
        ],
        "tags": [
          "Microsoft Copilot",
          "productivity",
          "momentum",
          "stack small wins",
          "goals",
          "projects",
          "workouts",
          "personal productivity",
          "AI assistant",
          "motivation"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights how the Dell PowerEdge R770AP server powered by Intel® Xeon® 6 processors delivers the precision and speed needed for high-frequency trading, enabling hundreds of trades in seconds. It presents Intel Xeon 6 CPUs' high-performance expertise as a defining factor for the future of finance.",
        "bullets": [
          "Focus on speed and precision for high-frequency trading (HFT).",
          "Dell PowerEdge R770AP server featured with Intel® Xeon® 6 processors.",
          "Claims ability to perform hundreds of trades in seconds.",
          "Aims to maximize gains and minimize losses via hardware performance.",
          "Positions Intel Xeon 6 CPUs as shaping the future of finance."
        ],
        "takeaways": [
          "Prioritize evaluating CPU performance (Intel Xeon 6) when selecting HFT server hardware.",
          "Assess server platforms like the Dell PowerEdge R770AP for low-latency, high-throughput trading workloads.",
          "Hardware speed and precision can directly impact trading outcomes—consider this in procurement decisions.",
          "Design data-center capacity and networking to support the high transaction rates implied by HFT use cases."
        ],
        "tags": [
          "high-frequency-trading",
          "HFT",
          "Dell",
          "PowerEdge R770AP",
          "Intel Xeon 6",
          "finance",
          "low-latency",
          "servers",
          "data-center",
          "performance"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video states that “the creative spark was out” and that Copilot “brought it back to life.” It ends with a call-to-action to download Copilot via the link in the bio.",
        "bullets": [
          "Message: Copilot restored creativity.",
          "Short promotional format with a clear CTA.",
          "Directs viewers to download via the link in bio.",
          "No transcript available; description is the sole source."
        ],
        "takeaways": [
          "The marketing positions Copilot as a creativity-focused solution—track how this messaging may influence user expectations.",
          "A clear download CTA suggests emphasis on end-user adoption; align support and onboarding communications accordingly.",
          "Awareness of this positioning can inform internal stakeholder messaging about user-facing features and capabilities."
        ],
        "tags": [
          "Copilot",
          "creativity",
          "download",
          "link in bio",
          "Microsoft Copilot",
          "promo",
          "creative tools",
          "spark",
          "advertisement"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video showcases the open-world martial arts RPG Where Winds Meet running with NVIDIA DLSS 4 and Multi Frame Generation enabled. It highlights the game's RTX-enabled visuals and credits video capture to @DigitalDreamsyt.",
        "bullets": [
          "Showcases Where Winds Meet, an open-world martial arts RPG",
          "Demonstrates DLSS 4 with Multi Frame Generation",
          "Emphasizes #RTXOn visuals",
          "Video capture credited to @DigitalDreamsyt"
        ],
        "takeaways": [
          "The feature set centers on DLSS 4 with Multi Frame Generation, so ensure infrastructure supports the DLSS 4 SDK and compatible NVIDIA drivers.",
          "RTX-enabled visuals are highlighted, indicating a need for NVIDIA RTX-capable GPUs in test, demo, and deployment systems.",
          "Reproducing or distributing similar demos will require GPU resources for rendering and capture workflows to maintain visual fidelity.",
          "Coordinate software and driver versions to remain compatible with DLSS 4 and RTX feature requirements."
        ],
        "tags": [
          "WhereWindsMeet",
          "DLSS4",
          "MultiFrameGeneration",
          "RTXOn",
          "OpenWorld",
          "MartialArtsRPG",
          "NVIDIA",
          "GeForce",
          "DigitalDreamsyt"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description…This video is listed on the Intel Business channel and is titled with Taha Khalifa (Intel). The channel positions itself as a source of IT information — covering topics from data centers to devices — and offers resources, guidance, and expert insights to help complete IT projects.",
        "bullets": [
          "Title identifies Taha Khalifa (Intel).",
          "Channel focuses on IT topics ranging from data centers to devices.",
          "Offers resources, guidance, and expert insights to support IT projects.",
          "Description includes subscribe link and channel URL.",
          "Provides connections to Intel Business website and social profiles (X, LinkedIn, Facebook)."
        ],
        "takeaways": [
          "Intel Business presents itself as a centralized resource for data center and device decision-makers.",
          "Subscribe and follow the channel’s social links to receive ongoing guidance and expert insights.",
          "Visit the Intel Business website for additional IT-center resources to support project planning and execution.",
          "Content is positioned to help get IT projects done right, from strategy to implementation."
        ],
        "tags": [
          "Intel",
          "Intel Business",
          "Taha Khalifa",
          "IT",
          "Data Centers",
          "Devices",
          "IT resources",
          "IT projects",
          "IntelBusiness",
          "YouTube"
        ]
      }
    }
  ]
}