{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-30T15:03:48.999Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "z-X9MYi1Rr0",
      "title": "Leveraging tax credits and incentives for sustainability projects",
      "channel": "PwC US",
      "published_at": "2026-01-30T13:27:25.000Z",
      "url": "https://www.youtube.com/watch?v=z-X9MYi1Rr0",
      "thumbnail": "https://i.ytimg.com/vi/z-X9MYi1Rr0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Randa Barsoum, Tax Partner at PwC US, explains that while energy tax credits are the most obvious, a wider set of tax credits and incentives can support sustainability efforts. She highlights state and local abatements, location-based incentives, and R&D tax credits tied to innovation in areas like packaging or processes, and urges leaders to view sustainability investments through a broader tax lens.",
        "bullets": [
          "Energy incentives are common but not the only tax levers for sustainability.",
          "State and local abatements can provide meaningful tax relief for projects.",
          "Location-based incentives may influence site and investment decisions.",
          "R&D tax credits can apply to innovation tied to sustainability (e.g., reimagined packaging or processes).",
          "Framing sustainability investments broadly can unlock additional tax value."
        ],
        "takeaways": [
          "Don’t limit project tax planning to energy credits—assess state/local abatements and location-based incentives for new builds or upgrades.",
          "Include R&D credit screening for sustainability-driven innovation in processes or materials to capture additional tax benefits.",
          "Treat sustainability investments as potential tax-advantaged opportunities by broadening the incentive review early in project planning."
        ],
        "tags": [
          "sustainability",
          "tax credits",
          "incentives",
          "R&D tax credit",
          "state abatements",
          "location-based incentives",
          "energy incentives",
          "PwC",
          "sustainability strategy",
          "corporate tax"
        ]
      }
    },
    {
      "id": "PxnMl4M2pww",
      "title": "Why data is critical to sustainable supply chains",
      "channel": "PwC US",
      "published_at": "2026-01-30T13:24:27.000Z",
      "url": "https://www.youtube.com/watch?v=PxnMl4M2pww",
      "thumbnail": "https://i.ytimg.com/vi/PxnMl4M2pww/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, David Linich of PwC US argues that reliable, high-quality data is essential for organizations to scenario plan, protect margins, and deliver sustainable, high-quality products at the right place and time. He emphasizes that with conditions changing week by week, data-driven decision-making is critical to building resilient, modern supply chains.",
        "bullets": [
          "Reliable, high-quality data enables effective scenario planning.",
          "Data helps protect margins amid shifting tariffs and margin pressure.",
          "Data supports delivering sustainable, high-quality products on time.",
          "Rapidly changing conditions make frequent, data-driven decisions necessary.",
          "Focus on data underpins resilient, modern supply chain operations."
        ],
        "takeaways": [
          "Prioritize collecting and validating supply-chain data to support scenario planning and continuity for grid and data center projects.",
          "Use high-quality data to anticipate cost pressures and protect margins in procurement and operations.",
          "Leverage data to ensure sustainable sourcing and on-time delivery of critical components for infrastructure builds.",
          "Implement processes for frequent data refreshes so decisions reflect week-to-week changes in supply conditions."
        ],
        "tags": [
          "supply chain",
          "sustainability",
          "data-driven",
          "scenario planning",
          "resilience",
          "PwC",
          "operational resilience",
          "supply chain data"
        ]
      }
    },
    {
      "id": "gv6zK265OUE",
      "title": "Build your first GraphRAG Powered Agent! (No Graph Expert Required) | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-30T06:40:49.000Z",
      "url": "https://www.youtube.com/watch?v=gv6zK265OUE",
      "thumbnail": "https://i.ytimg.com/vi/gv6zK265OUE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This session demonstrates how to build a GraphRAG (knowledge graph–powered) agent in an afternoon using the same AI tools teams already use, with a live demo on real documents. It emphasizes that creating a knowledge graph need not be a long, six-month project and provides sample code to follow along.",
        "bullets": [
          "Shows how to unlock knowledge trapped in docs, PDFs, and wikis using knowledge graphs.",
          "Promises a build-in-an-afternoon workflow rather than a lengthy project.",
          "Live demo using real documents to illustrate the approach.",
          "Uses the same AI toolchain teams are already using—no graph expertise required.",
          "Sample code provided: https://aws-neptune-customer-samples-us-east-1.s3.us-east-1.amazonaws.com/sample-notebooks/graphrag-powered-agent/Build_your_first_GraphRAG_Powered_Agent.ipynb"
        ],
        "takeaways": [
          "Faster access to institutional knowledge can improve operational decision support by making documentation queryable.",
          "Shorter deployment timelines reduce upfront project risk and resource commitments for AI-driven knowledge systems.",
          "Reusing existing AI toolchains lowers integration friction and speeds adoption across teams.",
          "Hands-on sample code and a live demo accelerate internal pilots and proof-of-concept work."
        ],
        "tags": [
          "knowledge-graph",
          "GraphRAG",
          "databases-for-AI",
          "RAG",
          "AI-integration",
          "live-demo",
          "sample-code",
          "document-search",
          "enterprise-AI"
        ]
      }
    },
    {
      "id": "azzmtqcIeCU",
      "title": "Cloud Cost Efficiency I The Keys to AWS Optimization | S16 E2",
      "channel": "AWS Events",
      "published_at": "2026-01-30T05:12:30.000Z",
      "url": "https://www.youtube.com/watch?v=azzmtqcIeCU",
      "thumbnail": "https://i.ytimg.com/vi/azzmtqcIeCU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This livestream explains the key KPIs that drive AWS cost efficiency, including cost per transaction, resource utilization rates, and ROI calculations. It also covers practical frameworks for measuring, tracking, benchmarking, and building dashboards to communicate cloud cost optimization opportunities to stakeholders.",
        "bullets": [
          "Focus on essential KPIs: cost per transaction, resource utilization, and ROI.",
          "Guidance on how to measure and track AWS spending with metrics frameworks.",
          "Practical approaches to benchmarking cloud efficiency and spotting optimization opportunities.",
          "Advice on building dashboards that communicate value to stakeholders.",
          "Intended for cloud engineers, FinOps teams, and technical leaders."
        ],
        "takeaways": [
          "Track cost-per-transaction and utilization to quantify cloud efficiency versus alternatives.",
          "Use ROI calculations and metrics frameworks to justify optimization or investment decisions.",
          "Benchmarking uncovers opportunities to reduce waste and improve capacity planning.",
          "Dashboards are essential to translate technical metrics into business value for stakeholders."
        ],
        "tags": [
          "AWS",
          "CloudCost",
          "FinOps",
          "CostOptimization",
          "CloudMetrics",
          "AWSCostManagement",
          "CloudEfficiency",
          "Benchmarks",
          "Dashboards",
          "ResourceUtilization"
        ]
      }
    },
    {
      "id": "oQtkaHzUYlY",
      "title": "Copilot helps Christa find her inner star 🌟",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-29T18:33:49.000Z",
      "url": "https://www.youtube.com/watch?v=oQtkaHzUYlY",
      "thumbnail": "https://i.ytimg.com/vi/oQtkaHzUYlY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video shows Copilot helping Christa \"find the star within\" against a starry sky and invites viewers to download and try Copilot via the link in the bio. It's a short, uplifting promotional clip emphasizing personal discovery and the Copilot brand.",
        "bullets": [
          "Promotional short video featuring Christa with a starry-sky motif.",
          "Theme centers on finding one's \"inner star\"—uplifting and personal.",
          "Clear call to action: download and try Copilot via the link in bio.",
          "Branded Microsoft Copilot content.",
          "Optimized for social distribution (explicit mention of 'link in bio')."
        ],
        "takeaways": [
          "Download-focused CTAs can drive spikes in app download and backend traffic—plan for capacity and scaling.",
          "Social-format promotional posts ('link in bio') may create concentrated traffic surges—ensure CDN and ingress resilience.",
          "Consumer-facing branding signals continued user-growth efforts—align monitoring and autoscaling policies with marketing cadence."
        ],
        "tags": [
          "Microsoft Copilot",
          "Copilot",
          "Christa",
          "self-discovery",
          "stars",
          "promo",
          "download",
          "link in bio",
          "short video",
          "social"
        ]
      }
    },
    {
      "id": "BYtYm-xyKR8",
      "title": "Bringing In $251K A Year With 3 Jobs In The Bay Area",
      "channel": "CNBC Make It",
      "published_at": "2026-01-29T17:47:46.000Z",
      "url": "https://www.youtube.com/watch?v=BYtYm-xyKR8",
      "thumbnail": "https://i.ytimg.com/vi/BYtYm-xyKR8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description…Naseema McElroy, 44, is a labor and delivery nurse in Brentwood, California who started the personal finance brand Financially Intentional to document her money journey. She carried nearly $1 million in debt in 2015, became debt-free by 2017, and the video title reports she now brings in $251K a year across three jobs in the Bay Area.",
        "bullets": [
          "Naseema McElroy, 44, is a labor and delivery nurse and founder of Financially Intentional in Brentwood, CA.",
          "She accumulated nearly $1 million in debt in 2015 and learned to manage her money.",
          "McElroy documented her debt-payoff journey through her business and was debt-free by 2017.",
          "Video title states she earns $251K per year through three jobs in the Bay Area.",
          "This profile is part of CNBC Make It's Millennial Money series; produced by Valentina Duarte and team."
        ],
        "takeaways": [
          "Employees may pursue multiple income streams (three jobs) — workforce planning should consider nontraditional work arrangements.",
          "High personal debt levels can exist even among skilled professionals — financial-wellness support may improve employee stability.",
          "Documenting personal finance journeys can build a brand and alternative revenue — staff side projects can create retention or PR opportunities.",
          "Profiles like this highlight practical debt-recovery timelines (2015 debt to 2017 debt-free) that can inform realistic employee financial-education programs."
        ],
        "tags": [
          "CNBCMakeIt",
          "MillennialMoney",
          "NaseemaMcElroy",
          "FinanciallyIntentional",
          "debt-payoff",
          "side-hustle",
          "BayArea",
          "labor-and-delivery"
        ]
      }
    },
    {
      "id": "t6y2cVNjCAw",
      "title": "GeForce Garage - Summer of RTX Community Build",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-29T14:01:25.000Z",
      "url": "https://www.youtube.com/watch?v=t6y2cVNjCAw",
      "thumbnail": "https://i.ytimg.com/vi/t6y2cVNjCAw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, GeForce Garage spotlights the Summer of RTX r/buildapc Community Build winner u/JeffersonPutnam, showcasing a small-form-factor GeForce RTX 5090 system built in a Fractal Design Era 2. The description lists full parts (PCPartPicker link), the host (Dwight), and social links for GeForce.",
        "bullets": [
          "Winner: u/JeffersonPutnam from the Summer of RTX community build contest.",
          "Chassis: Fractal Design Era 2 small-form-factor; GPU: GeForce RTX 5090 Founders Edition.",
          "CPU/RAM: Ryzen 7 9800X3D with 32GB Teamgroup T-Create Expert DDR5-6000.",
          "Power and cooling: Corsair SF1000 SFX PSU and Corsair Nautilus 240 RS AIO.",
          "PCPartPicker list and GeForce host (Dwight) linked in the description."
        ],
        "takeaways": [
          "Compact SFF chassis housing an RTX 5090 shows high-end GPUs can be integrated into small enclosures—plan for thermal and spatial constraints when density matters.",
          "Use of a 1000W SFX PSU indicates significant power provisioning is required even in compact builds—account for power delivery and connector compatibility.",
          "A 240mm AIO cooler in an SFF build highlights the need for robust cooling solutions for high-performance components in tight enclosures.",
          "Pairing a high-end consumer GPU with a high-performance CPU and DDR5-6000 RAM suggests balanced system design is important when specifying nodes for GPU-accelerated workloads.",
          "Published parts list (PCPartPicker) and community build visibility support reproducibility and transparent procurement for similar configurations."
        ],
        "tags": [
          "GeForceGarage",
          "RTX5090",
          "SFF",
          "NVIDIA",
          "GeForce",
          "Ryzen9800X3D",
          "DDR5-6000",
          "Corsair",
          "FractalEra2"
        ]
      }
    },
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy GenAI solutions, unlocking new revenue streams. By leveraging Google Cloud's robust infrastructure and consulting expertise, TTEC streamlined operations, boosted developer productivity, and compressed its digital transformation timeline.",
        "bullets": [
          "Partnership focused on rapid prototyping and deployment of AI solutions.",
          "GenAI plus Google Cloud infrastructure used to streamline operations.",
          "Effort unlocked entirely new revenue streams for TTEC.",
          "Consulting engagement boosted developer productivity and sped transformation.",
          "Project expanded the company’s strategic ambitions for AI-driven CX."
        ],
        "takeaways": [
          "Cloud consulting can accelerate AI deployment timelines—use external expertise to compress transformation schedules.",
          "Robust cloud infrastructure is key for GenAI initiatives to improve operations and developer productivity.",
          "Rapid prototyping of AI can reveal new revenue opportunities—prioritize fast iteration capabilities.",
          "Engage consulting partners to broaden strategic possibilities and scale AI efforts more confidently."
        ],
        "tags": [
          "google-cloud",
          "ttec",
          "genai",
          "ai-deployment",
          "operational-efficiency",
          "customer-experience",
          "consulting",
          "developer-productivity",
          "digital-transformation"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description…Jo discovers the power of Copilot Groups, with the video framing route planning as made easy. The clip centers on Microsoft Copilot and its AI-driven group planning capabilities.",
        "bullets": [
          "Core message: route planning made easy",
          "Highlighted feature: Copilot Groups",
          "Central figure: Jo discovers the capability",
          "Branding: Microsoft Copilot, AI"
        ],
        "takeaways": [
          "If Copilot Groups simplifies route planning, consider evaluating it for technician routing and maintenance logistics in grid/data center operations.",
          "Streamlined route planning could reduce travel time and improve coordination for field teams supporting infrastructure.",
          "Assess how Copilot Groups might integrate with existing operations and scheduling tools to centralize planning workflows.",
          "Validate data access, security, and compliance controls before deploying AI-driven group planning for critical sites."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "copilot-groups",
          "route-planning",
          "logistics",
          "field-ops",
          "demo"
        ]
      }
    }
  ]
}