{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-31T13:56:34.182Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "ZSzEg7bYlAI",
      "title": "Caroline Harvey on the Cam",
      "channel": "Team USA",
      "published_at": "2026-01-31T13:22:24.000Z",
      "url": "https://www.youtube.com/watch?v=ZSzEg7bYlAI",
      "thumbnail": "https://i.ytimg.com/vi/ZSzEg7bYlAI/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the post reads \"This is so Caroline Harvey coded 😂\" and includes the #WinterOlympics hashtag. The tone is playful and centered on Caroline Harvey.",
        "bullets": [
          "Caption: \"This is so Caroline Harvey coded 😂\"",
          "Includes hashtag: #WinterOlympics",
          "Playful, humorous tone",
          "Focused on Caroline Harvey",
          "No transcript available"
        ],
        "takeaways": [
          "The description contains no technical, streaming, or operational details—no immediate infrastructure actions can be derived.",
          "There is insufficient information to assess audience size, timing, or potential CDN/load impacts.",
          "To evaluate any grid/CDN implications, obtain viewing metrics, live vs. recorded status, and distribution details."
        ],
        "tags": [
          "Caroline Harvey",
          "coded",
          "funny",
          "emoji",
          "WinterOlympics",
          "caption",
          "athlete",
          "social",
          "post"
        ]
      }
    },
    {
      "id": "6B29VDvPPzc",
      "title": "Build Knowledge Graph-powered AI Agents For Your Use Case | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-31T06:10:50.000Z",
      "url": "https://www.youtube.com/watch?v=6B29VDvPPzc",
      "thumbnail": "https://i.ytimg.com/vi/6B29VDvPPzc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This session demonstrates building a knowledge graph automatically from raw documents and connecting it to an AI agent so the agent understands your company’s data. The end-to-end build is shown with no graph expertise required.",
        "bullets": [
          "Knowledge graphs address AI agents' lack of company-specific understanding.",
          "The session shows automated construction of a knowledge graph from raw documents.",
          "The graph is connected to an AI agent so it can understand your business.",
          "No graph theory or graph-query expertise is required.",
          "An end-to-end demonstration is provided (link to a related episode included)."
        ],
        "takeaways": [
          "Expect interest in pipelines that convert raw documents into knowledge graphs for agent use.",
          "Decision-makers should assess infrastructure readiness to host automated graph-building and agent integration workflows.",
          "Operational planning should account for end-to-end data ingestion, storage, and connectivity between graph DBs and AI agents.",
          "Lower barriers to graph expertise could accelerate internal adoption of agent-driven, company-specific AI capabilities."
        ],
        "tags": [
          "knowledge-graph",
          "AI-agent",
          "Databases-for-AI",
          "AWS-Events",
          "GraphDB",
          "VectorDB",
          "automation",
          "enterprise-knowledge",
          "end-to-end",
          "agent-integration"
        ]
      }
    },
    {
      "id": "z-X9MYi1Rr0",
      "title": "Leveraging tax credits and incentives for sustainability projects",
      "channel": "PwC US",
      "published_at": "2026-01-30T13:27:25.000Z",
      "url": "https://www.youtube.com/watch?v=z-X9MYi1Rr0",
      "thumbnail": "https://i.ytimg.com/vi/z-X9MYi1Rr0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Randa Barsoum of PwC US explains that energy tax incentives are just one piece of the sustainability tax picture. She highlights less obvious opportunities—like state and local abatements, location-based incentives, and R&D tax credits tied to innovation—that can add meaningful tax value to sustainability investments.",
        "bullets": [
          "Energy incentives are common but not the only tax opportunity for sustainability projects.",
          "State and local abatements can provide additional tax relief for sustainability investments.",
          "Location-based incentives may influence where to site projects for tax benefits.",
          "R&D tax credits can apply to innovation efforts, such as reimagining packaging or processes.",
          "Viewing sustainability through a broader tax lens can unlock meaningful tax value."
        ],
        "takeaways": [
          "Evaluate site selection for data centers with location-based incentives and local abatements in mind to reduce tax burden.",
          "Include tax-credit screening in sustainability project planning to capture value beyond energy incentives.",
          "Consider qualifying operational or design innovations (e.g., process changes) for R&D tax credits when pursuing efficiency upgrades."
        ],
        "tags": [
          "tax credits",
          "sustainability",
          "energy incentives",
          "state abatements",
          "location incentives",
          "R&D tax credit",
          "innovation",
          "PwC"
        ]
      }
    },
    {
      "id": "oQtkaHzUYlY",
      "title": "Copilot helps Christa find her inner star 🌟",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-29T18:33:49.000Z",
      "url": "https://www.youtube.com/watch?v=oQtkaHzUYlY",
      "thumbnail": "https://i.ytimg.com/vi/oQtkaHzUYlY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The video is a short, uplifting Copilot promo showing Copilot helping Christa \"find the star within\" using a sky-full-of-stars metaphor. Viewers are invited to download and try Copilot via the link in the creator's bio.",
        "bullets": [
          "Promo from Microsoft Copilot featuring Christa.",
          "Uses a starry-sky metaphor to convey inspiration.",
          "Message: Copilot helps people discover their potential.",
          "Call-to-action to download and try Copilot.",
          "Link to download provided in the bio."
        ],
        "takeaways": [
          "Consider piloting Copilot with small teams to explore potential productivity or creativity benefits.",
          "Short, inspirational promos can help raise awareness and drive user adoption among staff.",
          "Provide easy access (clear download links/instructions) to lower friction for trials and onboarding.",
          "Track early user feedback from pilots to assess relevance for operational workflows."
        ],
        "tags": [
          "Microsoft Copilot",
          "Copilot",
          "Christa",
          "AI assistant",
          "Productivity",
          "Inspiration",
          "Download",
          "Promo",
          "Star"
        ]
      }
    },
    {
      "id": "BYtYm-xyKR8",
      "title": "Bringing In $251K A Year With 3 Jobs In The Bay Area",
      "channel": "CNBC Make It",
      "published_at": "2026-01-29T17:47:46.000Z",
      "url": "https://www.youtube.com/watch?v=BYtYm-xyKR8",
      "thumbnail": "https://i.ytimg.com/vi/BYtYm-xyKR8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Naseema McElroy is a 44-year-old labor and delivery nurse in Brentwood, California who earns $251K a year across three jobs and runs a personal finance brand. After accumulating nearly $1 million in debt by 2015, she documented her debt-payoff journey through her business Financially Intentional and became debt-free by 2017.",
        "bullets": [
          "Naseema McElroy is a labor and delivery nurse and founder of Financially Intentional.",
          "She brings in $251K per year by working three jobs.",
          "In 2015 she amassed nearly $1 million in debt.",
          "By 2017 she had paid off all her debt and documented the process via her business.",
          "This profile is part of CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "Multiple income streams can improve individual financial resilience—parallel to designing infrastructure with redundancy for reliability.",
          "The rise of creator-led businesses (e.g., a personal finance brand) suggests ongoing demand for dependable digital and hosting services.",
          "Customers recovering from high liabilities may favor scalable, cost-effective solutions—consider flexible pricing and capacity scaling.",
          "High-earning professionals concentrated in regions like the Bay Area indicate localized demand; factor regional usage patterns into capacity planning."
        ],
        "tags": [
          "personal finance",
          "debt payoff",
          "side business",
          "labor and delivery nurse",
          "Bay Area",
          "multiple income streams",
          "financial independence",
          "CNBC Make It",
          "Millennial Money"
        ]
      }
    },
    {
      "id": "t6y2cVNjCAw",
      "title": "GeForce Garage - Summer of RTX Community Build",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-29T14:01:25.000Z",
      "url": "https://www.youtube.com/watch?v=t6y2cVNjCAw",
      "thumbnail": "https://i.ytimg.com/vi/t6y2cVNjCAw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, NVIDIA GeForce presents the winning entry from the Summer of RTX r/buildapc Community Build Contest, a small-form-factor GeForce RTX 5090 system built by u/JeffersonPutnam. The video lists the complete parts and highlights the compact Fractal Design Era 2 chassis housing high-end components including an RTX 5090 Founders Edition and a Ryzen 7 9800X3D.",
        "bullets": [
          "Contest winner: u/JeffersonPutnam’s SFF GeForce RTX 5090 build.",
          "Chassis: Fractal Design Era 2 (small-form-factor).",
          "Key components: GeForce RTX 5090 Founders Edition, Ryzen 7 9800X3D, MSI MPG B850I Edge motherboard, 32GB DDR5-6000 RAM.",
          "Power and cooling: Corsair SF1000 PSU and Corsair Nautilus 240 RS AIO.",
          "PCPartPicker parts list and GeForce social links provided; host credited as Dwight (_MightyPotato)."
        ],
        "takeaways": [
          "High-end GPUs (RTX 5090 FE) can be integrated into compact SFF chassis, indicating density considerations for workstation or edge deployments.",
          "Use of a 1000W SFX PSU (Corsair SF1000) underscores power delivery planning needed when packing top-tier GPUs into small builds.",
          "A 240mm AIO (Corsair Nautilus 240 RS) is used for cooling, highlighting thermal management choices for confined enclosures.",
          "Mini-ITX platforms (MSI MPG B850I Edge) can support modern CPU/GPU pairings and high-speed DDR5 memory in compact form factors."
        ],
        "tags": [
          "GeForceGarage",
          "RTX5090",
          "SFF",
          "Ryzen9800X3D",
          "DDR5-6000",
          "FractalEra2",
          "CorsairSF1000",
          "Nautilus240",
          "GeForce",
          "BuildAPC"
        ]
      }
    },
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy AI solutions that unlocked new revenue streams. Sreeni Alakappan says TTEC leveraged GenAI and Google Cloud's infrastructure to streamline operations, boost developer productivity, and compress their digital transformation timeline.",
        "bullets": [
          "TTEC worked with Google Cloud Consulting to accelerate AI prototyping and deployment.",
          "GenAI was leveraged alongside Google Cloud's robust infrastructure.",
          "The partnership aimed to streamline operations and increase developer productivity.",
          "Google Cloud Consulting helped compress TTEC's digital transformation timeline.",
          "Efforts expanded business ambitions and opened entirely new revenue streams."
        ],
        "takeaways": [
          "So what: Scalable cloud infrastructure is key to rapidly deploying GenAI workloads and enabling new revenue models.",
          "So what: Engaging cloud consulting can shorten transformation timelines and reduce internal resource strain.",
          "So what: Boosting developer productivity speeds time-to-market for AI-driven services.",
          "So what: Ensure infrastructure readiness for GenAI to improve operational efficiency and support business expansion."
        ],
        "tags": [
          "googlecloud",
          "ttec",
          "genai",
          "aideployment",
          "operationalefficiency",
          "customerexperience",
          "googlecloudplatform",
          "generativeai",
          "consulting",
          "digitaltransformation"
        ]
      }
    }
  ]
}