{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-29T13:37:50.080Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "yUpQ9pWA9WE",
      "title": "Watch: Fed Chair Jerome Powell's Full News Conference | WSJ",
      "channel": "WSJ News",
      "published_at": "2026-01-29T08:28:54.000Z",
      "url": "https://www.youtube.com/watch?v=yUpQ9pWA9WE",
      "thumbnail": "https://i.ytimg.com/vi/yUpQ9pWA9WE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Federal Reserve Chair Jerome Powell speaks to reporters following the Federal Reserve's two-day policy-setting meeting. The WSJ News video presents the full news conference; no transcript is available in the description.",
        "bullets": [
          "Federal Reserve Chair Jerome Powell addresses reporters.",
          "Remarks occur after the Fed's two-day policy-setting meeting.",
          "Full news conference video published by WSJ News.",
          "Published 2026-01-29 on the WSJ News channel.",
          "No transcript included in the video's description."
        ],
        "takeaways": [
          "Watch the full press conference to hear Fed guidance that could influence interest rates, funding costs, or economic outlook relevant to planning.",
          "Coordinate with finance/treasury teams to reassess financing and liquidity strategies after reviewing the Fed's statements.",
          "Monitor market reaction following the conference for potential impacts on borrowing costs and investment valuations tied to grid and data center projects.",
          "Retain the recording and update scenario planning, risk assessments, and procurement timelines based on any new Fed commentary."
        ],
        "tags": [
          "JeromePowell",
          "FederalReserve",
          "Fed",
          "WSJ",
          "newsconference",
          "policymeeting",
          "monetarypolicy",
          "finance",
          "markets",
          "2026-01-29"
        ]
      }
    },
    {
      "id": "feL4GUiP7Ws",
      "title": "Building Prior Authorization Systems for Healthcare Payors with Amazon Bedrock",
      "channel": "AWS Events",
      "published_at": "2026-01-29T05:43:38.000Z",
      "url": "https://www.youtube.com/watch?v=feL4GUiP7Ws",
      "thumbnail": "https://i.ytimg.com/vi/feL4GUiP7Ws/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this technical session shows how to use Amazon Bedrock foundation models to build an intelligent prior authorization system for healthcare payors that adheres to CMS regulatory requirements. AWS Engineers and the AWS Generative AI Innovation Center outline an architecture that combines advanced NLP with healthcare workflows to automate Local Coverage Determinations (LCDs), analyze medical documentation, and produce explainable prior authorization recommendations to help meet CMS-0057-F timelines while maintaining compliance and accuracy.",
        "bullets": [
          "Demonstrates leveraging Amazon Bedrock foundation models for prior authorization workflows.",
          "Presents a comprehensive architecture integrating advanced NLP with healthcare-specific workflows.",
          "Shows automated processing of Local Coverage Determinations (LCDs) and analysis of complex medical documentation.",
          "Generates explainable prior authorization recommendations to support compliance.",
          "Focuses on helping payors meet CMS-0057-F timelines while improving operational efficiency and accuracy."
        ],
        "takeaways": [
          "Regulatory compliance (CMS-0057-F) is a central design driver for prior authorization AI systems.",
          "Adoption requires architectures that integrate foundation models with healthcare-specific workflows (e.g., LCD processing).",
          "Explainability in recommendations is emphasized to maintain compliance and trust.",
          "Automating document analysis and LCD processing can materially improve operational efficiency for payors."
        ],
        "tags": [
          "Amazon Bedrock",
          "prior authorization",
          "CMS-0057-F",
          "Local Coverage Determinations",
          "NLP",
          "AWS",
          "Generative AI Innovation Center",
          "healthcare payors",
          "compliance",
          "explainability"
        ]
      }
    },
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy GenAI solutions, unlocking new revenue streams while streamlining operations. Sreeni Alakappan highlights that leveraging Google Cloud's infrastructure improved developer productivity and compressed the company's digital transformation timeline.",
        "bullets": [
          "TTEC worked with Google Cloud Consulting to accelerate AI prototyping and deployment.",
          "Generative AI and Google Cloud infrastructure were used to streamline operations.",
          "Efforts resulted in improved developer productivity.",
          "The partnership enabled new revenue opportunities for TTEC.",
          "Google Cloud Consulting helped shorten the digital transformation timeline."
        ],
        "takeaways": [
          "Ensure your infrastructure can support GenAI workloads to capture new revenue opportunities.",
          "Prioritize rapid prototyping and consulting partnerships to compress time-to-value.",
          "Invest in developer tooling and automation to measurably boost productivity.",
          "Use cloud-native services to streamline operations and scale AI deployments."
        ],
        "tags": [
          "googlecloud",
          "ttec",
          "genai",
          "aideployment",
          "operationalefficiency",
          "customerexperience",
          "cloudinfrastructure",
          "digitaltransformation"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights route planning made easy as Jo discovers the power of Copilot Groups. The short description positions the clip as a showcase of Copilot Groups from Microsoft Copilot and uses tags emphasizing copilot and AI.",
        "bullets": [
          "No transcript available; description is brief.",
          "Focus: route planning made easy.",
          "Featured subject: Jo discovers Copilot Groups.",
          "Published by: Microsoft Copilot.",
          "Includes hashtags: #copilot #microsoftcopilot #ai"
        ],
        "takeaways": [
          "The description presents Copilot Groups as a tool for simplifying route planning—decision-makers should note this positioning when tracking planning tools.",
          "The video appears to be a user-focused showcase (Jo discovering the feature), suggesting messaging aimed at practical use cases.",
          "Official Microsoft Copilot branding and AI tags indicate this is part of Microsoft’s Copilot communications—worth noting for vendor alignment.",
          "If route planning is relevant to operations, decision-makers may want to follow updates or demos of Copilot Groups for further evaluation."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "route-planning",
          "copilot-groups",
          "Jo",
          "demo"
        ]
      }
    }
  ]
}