{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-28T13:20:10.174Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "gv6zK265OUE",
      "title": "Build your first GraphRAG Powered Agent! (No Graph Expert Required) | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-27T20:55:49.000Z",
      "url": "https://www.youtube.com/watch?v=gv6zK265OUE",
      "thumbnail": "https://i.ytimg.com/vi/gv6zK265OUE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this session shows how to build a GraphRAG-powered knowledge graph to unlock information trapped in docs, PDFs, and wikis so AI models can reason over it. The presenters demonstrate a practical, hands-on approach—live demo with real documents—claiming you can build one in an afternoon using the AI tools you already use, with no six-month project or graph expert required.",
        "bullets": [
          "Explains how knowledge graphs can surface information hidden in text-based documents.",
          "Promises a live, practical demo using real documents rather than theory.",
          "Shows a workflow that uses existing AI tools you already have.",
          "Emphasizes speed—build a usable graph in an afternoon.",
          "Frames the approach as accessible without specialist graph expertise."
        ],
        "takeaways": [
          "Unlock institutional knowledge in internal docs, PDFs, and wikis so AI can reason over operational information.",
          "Low time-to-value: a proof-of-concept can be created in an afternoon, enabling faster evaluation and pilot deployments.",
          "No specialized graph expert needed reduces barriers to adoption for engineering and operations teams.",
          "A live-demo, real-docs approach helps quickly assess applicability to grid and data-center documentation needs."
        ],
        "tags": [
          "GraphRAG",
          "knowledge-graph",
          "RAG",
          "AI",
          "Databases-for-AI",
          "documents",
          "PDFs",
          "wikis",
          "live-demo",
          "AWS-Events"
        ]
      }
    },
    {
      "id": "yUpQ9pWA9WE",
      "title": "Watch Live: Fed Chair Jerome Powell Holds News Conference | WSJ",
      "channel": "WSJ News",
      "published_at": "2026-01-27T20:49:24.000Z",
      "url": "https://www.youtube.com/watch?v=yUpQ9pWA9WE",
      "thumbnail": "https://i.ytimg.com/vi/yUpQ9pWA9WE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Federal Reserve Chair Jerome Powell speaks to reporters following the Federal Reserve's two-day policy-setting meeting. The video is WSJ's live coverage of his post-meeting press conference.",
        "bullets": [
          "Live/recorded press conference with Fed Chair Jerome Powell.",
          "Takes place immediately after the Fed's two-day policy-setting meeting.",
          "Hosted/covered by WSJ News.",
          "No transcript available in the provided content."
        ],
        "takeaways": [
          "This is the official post-meeting briefing where the Fed communicates its policy decisions and rationale—consult the briefing for authoritative statements.",
          "Use WSJ's live coverage as a timely source to capture Fed comments as they are delivered.",
          "Obtain the full transcript or official Fed statements after the event for detailed guidance relevant to planning and compliance."
        ],
        "tags": [
          "JeromePowell",
          "FederalReserve",
          "Fed",
          "pressconference",
          "policymeeting",
          "WSJ",
          "centralbank",
          "livecoverage"
        ]
      }
    },
    {
      "id": "MuQmKCWjSYI",
      "title": "Deutsche Bank accelerates Cloud journeys with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-27T17:39:29.000Z",
      "url": "https://www.youtube.com/watch?v=MuQmKCWjSYI",
      "thumbnail": "https://i.ytimg.com/vi/MuQmKCWjSYI/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Google Cloud Consulting worked with Deutsche Bank to design novel learning experiences that helped thousands of engineers become fluent in cloud engineering. The program used Generative AI to create personalized, interactive training that blends on‑demand convenience with the effectiveness of instructor‑led sessions, and Google Cloud Consulting Learning Services provided the creative innovation and technical expertise to build the Deutsche Bank Cloud Engineering Program and accelerate their cloud journey.",
        "bullets": [
          "Designed novel learning experiences for thousands of engineers.",
          "Used Generative AI to create personalized, interactive training.",
          "Blended on‑demand learning with instructor‑led effectiveness.",
          "Google Cloud Consulting Learning Services provided creative and technical expertise.",
          "Built the Deutsche Bank Cloud Engineering Program to accelerate cloud adoption."
        ],
        "takeaways": [
          "Scalable, tailored training can speed workforce cloud fluency and support large migrations.",
          "Generative AI enables personalized, interactive learning that can reach thousands efficiently.",
          "Blended delivery (on‑demand + instructor‑led) balances convenience with instructional effectiveness.",
          "Partnering with cloud consulting brings both creative innovation and technical know‑how for program buildout."
        ],
        "tags": [
          "Deutsche Bank",
          "Google Cloud Consulting",
          "Generative AI",
          "cloud engineering",
          "training",
          "learning services",
          "cloud adoption",
          "personalized learning"
        ]
      }
    },
    {
      "id": "5CyVBSbHmbA",
      "title": "Year-end toolkit: Strengthening audit committee collaboration",
      "channel": "PwC US",
      "published_at": "2026-01-27T17:20:31.000Z",
      "url": "https://www.youtube.com/watch?v=5CyVBSbHmbA",
      "thumbnail": "https://i.ytimg.com/vi/5CyVBSbHmbA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this episode covers how finance teams can strengthen collaboration with audit committees during the year-end accounting and reporting process. It highlights streamlining reporting and preparing to address emerging oversight areas such as AI, enterprise risk management, cyber risk, transformation initiatives, and proxy disclosures.",
        "bullets": [
          "Strengthening management/audit committee communication and collaboration",
          "Key year‑end accounting and reporting issues finance should be ready to address",
          "Oversight of AI: risks, opportunities, and controls",
          "Enhancing enterprise risk management and audit committee oversight",
          "Evolving cyber risk in the age of AI and elevating proxy disclosures"
        ],
        "takeaways": [
          "Engage proactively with your audit committee on AI-related risks, controls, and how AI affects financial reporting and operations.",
          "Coordinate closely with finance to streamline year‑end reporting and ensure documentation meets audit and governance expectations.",
          "Embed AI and cyber risk considerations into your enterprise risk management discussions to support audit committee oversight.",
          "Be prepared for increased scrutiny in proxy disclosures and governance reporting related to transformation initiatives and emerging technology risks."
        ],
        "tags": [
          "audit committee",
          "year-end",
          "accounting",
          "reporting",
          "AI oversight",
          "enterprise risk management",
          "cyber risk",
          "proxy disclosures",
          "finance",
          "governance"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video shows Jo discovering the power of Copilot Groups for route planning. It presents Copilot Groups as a tool that makes route planning easier.",
        "bullets": [
          "Focus: route planning made easy",
          "Feature highlighted: Copilot Groups",
          "Protagonist: Jo discovers the tool's power",
          "Tags in description: #copilot #microsoftcopilot #ai"
        ],
        "takeaways": [
          "Highlights an AI use case: Copilot Groups applied to route planning.",
          "Signals a potential fit for operational planning and coordination of field teams.",
          "Encourages decision-makers to explore Copilot Groups when evaluating planning/collaboration tools."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "route-planning",
          "copilot-groups",
          "productivity",
          "field-operations",
          "navigation"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… In the KPMG ON AIR podcast episode Katarzyna Chojniak and Alicja Barska explain practical AI uses in audit, including full-population analysis, conversational assistants (Clara AI), transaction-scoring tools and the KPMG Clara platform for real-time audit management. They also discuss how these technologies change the auditor’s role, necessary competencies, implementation challenges, data security/regulatory issues and future risks and benefits.",
        "bullets": [
          "AI is already embedded in audit workflows to handle repetitive tasks and analyze large datasets.",
          "Tools highlighted include AI Transaction Scoring, Clara AI (conversational assistant and specialized agents) and the KPMG Clara platform.",
          "Shift from sampling to full-population analysis and real-time audit management via Clara/Clara for Clients.",
          "Discussion covers changing auditor roles, key competencies, adoption challenges and potential AI risks.",
          "Data security and the regulatory environment are emphasized as important considerations."
        ],
        "takeaways": [
          "Prepare systems to provide secure, accessible full-population data extracts to support AI-driven audit analytics.",
          "Prioritize data security and regulatory compliance when integrating with auditors’ AI platforms and workflows.",
          "Expect more real-time interactions with auditors—plan for integration points with platforms like KPMG Clara.",
          "Invest in staff skills and documentation to support collaboration with AI tools and evolving audit processes."
        ],
        "tags": [
          "audit",
          "AI",
          "KPMG Clara",
          "Clara AI",
          "transaction scoring",
          "audit automation",
          "data security",
          "regulation",
          "audit innovation",
          "full-population analytics"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield has officially launched and the trailer highlights NVIDIA DLSS 4 with Multi Frame Generation. The footage was captured on a GeForce RTX 5080 at 4K Ultra settings (DLSS 4 Multi Frame Generation 4X Mode); the game is a 3D real-time strategy RPG where the player is the Endministrator exploring Talos-II.",
        "bullets": [
          "Official launch of Arknights: Endfield announced.",
          "Trailer showcases NVIDIA DLSS 4 with Multi Frame Generation (MFG).",
          "Captured on GeForce RTX 5080 at 4K Ultra settings using DLSS 4 MFG 4X Mode.",
          "Game described as a 3D real-time strategy RPG with exploration on Talos-II.",
          "Links provided to official game site and multiple social channels."
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is being used for 4K real-time capture—note for procurement: support for the latest NVIDIA SDKs may be required for similar workloads.",
          "Footage captured on an RTX 5080 indicates high-end consumer GPU hardware used for 4K real-time rendering tasks.",
          "Content creators and services delivering 4K real-time gameplay should validate driver, SDK and hardware compatibility for DLSS 4/MFG workflows.",
          "Plan for GPU capacity and cooling/power needs if supporting on-prem or colocated systems to handle sustained 4K real-time rendering and capture."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "RTX5080",
          "4K",
          "real-time-rendering",
          "NVIDIA",
          "gaming",
          "launch"
        ]
      }
    }
  ]
}