{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-31T16:54:29.920Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "6dvtsIIrN3Q",
      "title": "Would you go to an in-person dating app event?",
      "channel": "CNBC Make It",
      "published_at": "2026-01-31T15:00:23.000Z",
      "url": "https://www.youtube.com/watch?v=6dvtsIIrN3Q",
      "thumbnail": "https://i.ytimg.com/vi/6dvtsIIrN3Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, dating app Hinge announced a $1 million fund to support social groups in New York, Los Angeles and London to host free or affordable social events for young people. This is presented as a global expansion of Hinge’s One More Hour social impact initiative aimed at addressing Gen Z loneliness.",
        "bullets": [
          "Hinge commits $1 million to fund social groups.",
          "Funds will support free or affordable events in New York, Los Angeles and London.",
          "Target audience: Gen Z and young people experiencing loneliness.",
          "Part of Hinge’s One More Hour social impact program and a global expansion."
        ],
        "takeaways": [
          "Be aware the initiative will operate in New York, Los Angeles and London.",
          "The program is funded at $1 million and focuses on youth-focused in-person events.",
          "Hinge positions this as a social impact expansion addressing Gen Z loneliness."
        ],
        "tags": [
          "Hinge",
          "One More Hour",
          "Gen Z",
          "loneliness",
          "social events",
          "dating apps",
          "New York",
          "Los Angeles",
          "London",
          "social impact"
        ]
      }
    },
    {
      "id": "ZSzEg7bYlAI",
      "title": "Caroline Harvey on the Cam",
      "channel": "Team USA",
      "published_at": "2026-01-31T13:22:24.000Z",
      "url": "https://www.youtube.com/watch?v=ZSzEg7bYlAI",
      "thumbnail": "https://i.ytimg.com/vi/ZSzEg7bYlAI/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This short Team USA clip appears to feature Caroline Harvey on camera with a playful tone ('This is so Caroline Harvey coded 😂') and is tagged #WinterOlympics. No transcript is available for further detail.",
        "bullets": [
          "Video from Team USA titled 'Caroline Harvey on the Cam'.",
          "Description uses a laughing emoji and informal phrasing.",
          "Tagged with #WinterOlympics.",
          "No transcript provided in the video metadata.",
          "Published 2026-01-31 on the Team USA channel."
        ],
        "takeaways": [
          "Description suggests a short, informal social clip — likely low bandwidth/storage impact compared with long-form content.",
          "Expect minimal production complexity; content may not require heavy transcoding or specialized delivery pipelines.",
          "Tagged #WinterOlympics — aggregate traffic for related content can spike during event windows, so CDN scaling should account for event-driven demand.",
          "Absence of a transcript/closed captions may have accessibility and compliance implications when serving content at scale."
        ],
        "tags": [
          "Caroline Harvey",
          "Team USA",
          "WinterOlympics",
          "Cam",
          "Athlete",
          "Short clip",
          "Social media",
          "2026",
          "Humor"
        ]
      }
    },
    {
      "id": "6B29VDvPPzc",
      "title": "Build Knowledge Graph-powered AI Agents For Your Use Case | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-31T06:10:50.000Z",
      "url": "https://www.youtube.com/watch?v=6B29VDvPPzc",
      "thumbnail": "https://i.ytimg.com/vi/6B29VDvPPzc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This session demonstrates how to build a knowledge graph automatically from raw documents and connect it to an AI agent so the agent can understand company-specific information. The presenter shows an end-to-end build with no graph expertise required.",
        "bullets": [
          "General-purpose agents lack company-specific knowledge.",
          "Knowledge graphs are presented as the solution to that gap.",
          "Session builds a knowledge graph automatically from raw documents.",
          "The graph is connected to an AI agent so it understands your business.",
          "No graph queries or graph-theory expertise required; an end-to-end demo is shown."
        ],
        "takeaways": [
          "If you need AI agents that understand your organization, knowledge graphs are the recommended approach shown here.",
          "Automatic KG construction from documents lowers the skill barrier to adopting graph-backed agents.",
          "The end-to-end demo outlines a practical pipeline: document ingestion → knowledge graph → connected agent.",
          "With no graph expertise required, focus shifts to integrating pipelines and operationalizing the solution rather than hiring graph specialists."
        ],
        "tags": [
          "knowledge-graph",
          "AI-agent",
          "enterprise-AI",
          "document-ingestion",
          "graphdb",
          "end-to-end",
          "no-code",
          "AWS Events"
        ]
      }
    },
    {
      "id": "z-X9MYi1Rr0",
      "title": "Leveraging tax credits and incentives for sustainability projects",
      "channel": "PwC US",
      "published_at": "2026-01-30T13:27:25.000Z",
      "url": "https://www.youtube.com/watch?v=z-X9MYi1Rr0",
      "thumbnail": "https://i.ytimg.com/vi/z-X9MYi1Rr0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Randa Barsoum of PwC US highlights tax credits and incentives for sustainability that extend beyond commonly cited energy incentives. She calls out state and local abatements, location-based incentives, and R&D tax credits tied to innovation (for example, reimagining packaging or processes) and advises leaders to view sustainability investments through a broader lens to unlock tax value.",
        "bullets": [
          "Energy incentives are important but not the only tax lever for sustainability.",
          "State and local abatements can support sustainability projects.",
          "Location-based incentives matter for site and expansion decisions.",
          "R&D tax credits may apply to innovation in packaging or processes.",
          "Viewing sustainability investments broadly can unlock meaningful tax value."
        ],
        "takeaways": [
          "Don’t limit incentive searches to energy credits—include state/local abatements and location-based incentives when planning sites or expansions.",
          "Investigate R&D tax credits for process innovations that improve operational sustainability.",
          "Treat sustainability investments as potential sources of tax value by broadening your incentive strategy."
        ],
        "tags": [
          "sustainability",
          "tax-credits",
          "incentives",
          "R&D-tax-credit",
          "state-and-local",
          "location-incentives",
          "PwC",
          "sustainability-investments",
          "energy-incentives"
        ]
      }
    },
    {
      "id": "oQtkaHzUYlY",
      "title": "Copilot helps Christa find her inner star 🌟",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-29T18:33:49.000Z",
      "url": "https://www.youtube.com/watch?v=oQtkaHzUYlY",
      "thumbnail": "https://i.ytimg.com/vi/oQtkaHzUYlY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video shows Copilot helping Christa \"find the star within,\" using star-filled imagery and an uplifting tone. Viewers are prompted to download and try Copilot via the link in the bio.",
        "bullets": [
          "Uplifting, star-themed message: Copilot helps Christa \"find the star within\"",
          "Simple, inspirational creative framing",
          "Clear call to action to download and try Copilot (link in bio)",
          "Published by Microsoft Copilot"
        ],
        "takeaways": [
          "Messaging emphasizes user empowerment—consider how Copilot might aid adoption among operational staff",
          "Clear CTA suggests trial availability—verify provisioning and access paths for pilot deployments",
          "Concise, visual storytelling can support internal communication—use similar brief demos for stakeholder buy-in"
        ],
        "tags": [
          "Copilot",
          "Microsoft",
          "Christa",
          "AI",
          "inspiration",
          "star",
          "download",
          "link-in-bio",
          "short-video"
        ]
      }
    },
    {
      "id": "BYtYm-xyKR8",
      "title": "Bringing In $251K A Year With 3 Jobs In The Bay Area",
      "channel": "CNBC Make It",
      "published_at": "2026-01-29T17:47:46.000Z",
      "url": "https://www.youtube.com/watch?v=BYtYm-xyKR8",
      "thumbnail": "https://i.ytimg.com/vi/BYtYm-xyKR8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Naseema McElroy, a 44-year-old labor and delivery nurse in Brentwood, California, started a personal finance brand after accumulating nearly $1 million in debt in 2015. She launched Financially Intentional to document her debt-payoff journey, became debt-free by 2017, and the video (titled \"Bringing In $251K A Year With 3 Jobs In The Bay Area\") is part of CNBC Make It's Millennial Money series.",
        "bullets": [
          "Naseema McElroy is a 44-year-old labor and delivery nurse and founder of Financially Intentional.",
          "She carried nearly $1 million in debt in 2015 and learned to manage her money to tackle it.",
          "Naseema documented her debt payoff publicly and was debt-free by 2017.",
          "The video title highlights earning $251K a year with three jobs in the Bay Area.",
          "This story is featured in CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "Multiple income streams can generate substantial annual revenue (title notes $251K from three jobs), suggesting diversification as a resilience strategy.",
          "Documenting financial progress can catalyze a personal brand and create additional income or outreach opportunities, as shown by Financially Intentional.",
          "Focused financial education and disciplined planning enabled rapid debt reduction (nearly $1M to debt-free by 2017), freeing resources for other priorities.",
          "Earnings targets in high-cost regions like the Bay Area may be higher; benchmarking local income levels can inform financial planning and staffing cost models."
        ],
        "tags": [
          "Naseema McElroy",
          "Financially Intentional",
          "debt payoff",
          "labor and delivery nurse",
          "Brentwood CA",
          "CNBC Make It",
          "Millennial Money",
          "$251K a year",
          "three jobs",
          "personal finance"
        ]
      }
    },
    {
      "id": "t6y2cVNjCAw",
      "title": "GeForce Garage - Summer of RTX Community Build",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-29T14:01:25.000Z",
      "url": "https://www.youtube.com/watch?v=t6y2cVNjCAw",
      "thumbnail": "https://i.ytimg.com/vi/t6y2cVNjCAw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video announces the winner of the Summer of RTX r/buildapc Community Build contest, u/JeffersonPutnam, who assembled a small-form-factor GeForce RTX 5090 system. The build is showcased by GeForce host Dwight and the description lists the full component breakdown and links to the PCPartPicker build.",
        "bullets": [
          "Contest winner: u/JeffersonPutnam’s SFF GeForce RTX 5090 build featured as the Summer of RTX community build winner.",
          "Chassis: Fractal Design Era 2 small-form-factor case housing the components.",
          "GPU: GeForce RTX 5090 Founders Edition paired with a Ryzen 7 9800X3D CPU.",
          "Support components: MSI MPG B850I Edge motherboard, 32GB Teamgroup T-Create Expert DDR5-6000 RAM, Corsair SF1000 PSU, Corsair Nautilus 240 RS AIO.",
          "Video hosted by GeForce host Dwight; PCPartPicker link to full system provided in the description."
        ],
        "takeaways": [
          "A high-end consumer GPU (RTX 5090 Founders Edition) has been fitted into a small-form-factor chassis—power and cooling constraints are critical when integrating similar GPUs into compact deployments.",
          "The build uses a 1000W SFX-class PSU (Corsair SF1000), highlighting that top-tier GPUs may require substantial power delivery even in compact systems.",
          "A 240mm AIO cooler was used in the SFF build, underscoring the need for robust thermal solutions when packing high-performance components into limited volumes.",
          "Mini-ITX motherboard and DDR5 memory were used, so platform form factor and modern memory support should be considered for compatibility and density planning."
        ],
        "tags": [
          "GeForceGarage",
          "RTX5090",
          "SFF",
          "BuildAPC",
          "Ryzen7",
          "FractalEra2",
          "CorsairSF1000",
          "PCBuild",
          "CommunityBuild"
        ]
      }
    },
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy GenAI solutions that unlocked new revenue streams while streamlining operations. Sreeni Alakappan highlights that leveraging Google Cloud's infrastructure compressed TTEC's digital transformation timeline and boosted developer productivity.",
        "bullets": [
          "TTEC used Google Cloud Consulting to accelerate AI prototyping and deployment.",
          "Generative AI and Google Cloud infrastructure were central to the effort.",
          "The project aimed to streamline operations and increase developer productivity.",
          "TTEC reports the partnership enabled entirely new revenue streams.",
          "Google Cloud Consulting helped compress the company’s digital transformation timeline."
        ],
        "takeaways": [
          "Ensure infrastructure can support GenAI workloads—cloud platforms can accelerate deployment timelines.",
          "Partnering with cloud consulting services can compress transformation schedules and reduce internal lift.",
          "Improved developer productivity from cloud tools and platforms can speed time-to-value for AI initiatives.",
          "Successful AI initiatives can create new revenue opportunities while also streamlining operations."
        ],
        "tags": [
          "google-cloud",
          "ttec",
          "genai",
          "ai-deployment",
          "operational-efficiency",
          "customer-experience",
          "consulting",
          "developer-productivity",
          "digital-transformation",
          "revenue-growth"
        ]
      }
    }
  ]
}