{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-22T08:59:00.882Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "IKkVWKdumHw",
      "title": "re:Invent 2025 - Chalk Talk - Origin management for multi-region applications with Amazon CloudFront",
      "channel": "AWS Events",
      "published_at": "2026-01-22T08:10:48.000Z",
      "url": "https://www.youtube.com/watch?v=IKkVWKdumHw",
      "thumbnail": "https://i.ytimg.com/vi/IKkVWKdumHw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… this session covers comprehensive origin management with Amazon CloudFront to build secure, resilient content delivery systems. It explains automatic failover with CloudFront and Route 53, granular origin routing via CloudFront Functions, securing origins with S3 Origin Access Control and VPC private origins, integrating on-premises via AWS Direct Connect, and using Origin Shield to optimize cache performance and reduce origin load.",
        "bullets": [
          "Automatic failover using CloudFront combined with Route 53",
          "Granular origin routing implemented with CloudFront Functions",
          "Secure origins via S3 Origin Access Control (OAC) and VPC private origins",
          "Hybrid integration through AWS Direct Connect for on‑prem connectivity",
          "Origin Shield to improve caching efficiency and lower origin load"
        ],
        "takeaways": [
          "Automated failover and routing give operators a way to maintain service continuity across regions during outages",
          "Origin Shield and CloudFront caching can reduce origin load and bandwidth requirements, easing pressure on core infrastructure",
          "Using S3 OAC and VPC private origins enables stricter access controls and better protection of origin resources",
          "Direct Connect supports predictable, high‑throughput hybrid links for integrating on‑prem systems into multi‑region delivery"
        ],
        "tags": [
          "Amazon CloudFront",
          "Origin Shield",
          "Route53",
          "CloudFront Functions",
          "S3 Origin Access Control",
          "VPC private origins",
          "AWS Direct Connect",
          "multi-region",
          "failover",
          "hybrid-architecture"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This KPMG ON AIR podcast with Katarzyna Chojniak and Alicja Barska outlines how AI is already integrated into audit work, describing tools (AI Transaction Scoring, Clara AI, KPMG Clara) that enable full-population analysis, conversational assistance and real-time engagement with clients. The episode also covers benefits for clients, changes to the auditor role, implementation challenges, data security and regulatory considerations, risks, and future directions for AI in audit.",
        "bullets": [
          "AI tools move audit from sampling to analysis of full populations (AI Transaction Scoring).",
          "Clara AI provides conversational assistant capabilities and specialized agents to support auditors.",
          "KPMG Clara platform enables real-time management of audits and Clara for Clients improves client communication.",
          "Discussion includes how AI supports documentation, disclosure analysis and decision-making.",
          "Episode addresses implementation challenges, data security/regulatory environment and potential AI-related risks."
        ],
        "takeaways": [
          "Ensure infrastructure can handle large-scale data analysis since audits are moving from sampling to full‑population review.",
          "Prioritise strong data security and regulatory compliance when deploying AI-driven audit tools.",
          "Support real-time, platform-based workflows and secure client communication to align with modern audit practices.",
          "Invest in staff upskilling on AI tools and new audit competencies as roles evolve with technology."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMGClara",
          "audit",
          "data-security",
          "regulacje",
          "innowacje",
          "automatyzacja",
          "full-population-analysis"
        ]
      }
    },
    {
      "id": "t33Fh1JZVgA",
      "title": "AI at Speed: From Investment to Performance",
      "channel": "PwC US",
      "published_at": "2026-01-21T22:48:29.000Z",
      "url": "https://www.youtube.com/watch?v=t33Fh1JZVgA",
      "thumbnail": "https://i.ytimg.com/vi/t33Fh1JZVgA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… At the 2026 World Economic Forum in Davos, PwC US Senior Partner and CEO Paul Griggs spoke with CNBC’s Emma Crosby about how organizations are shifting from AI exploration to execution, assessing initiatives through investment discipline, performance, and measurable value. The discussion highlights that leading firms move early, invest with intent, and design operating models that preserve resilience while driving measurable outcomes today and enabling future transformation.",
        "bullets": [
          "Conversation took place at WEF 2026 in Davos between Paul Griggs (PwC US) and CNBC’s Emma Crosby.",
          "Focus is on transitioning from AI exploration to execution with investment discipline.",
          "Emphasis on evaluating AI by performance and measurable value.",
          "Leading organizations place capital intentionally and move early.",
          "Operating models should stay resilient without sacrificing performance as AI scales."
        ],
        "takeaways": [
          "Prioritize AI investments with clear metrics and ROI to justify capital allocation in grid and data center projects.",
          "Move early on strategic AI initiatives to capture performance advantages and avoid lagging operationally.",
          "Design operating models that maintain resilience (uptime, stability) while integrating AI-driven optimizations.",
          "Require measurable outcomes from AI pilots before wider rollout to inform capacity planning and infrastructure upgrades."
        ],
        "tags": [
          "AI investment",
          "performance",
          "measurable value",
          "operating models",
          "resilience",
          "Davos 2026",
          "PwC",
          "Paul Griggs",
          "CNBC",
          "enterprise AI"
        ]
      }
    },
    {
      "id": "6hu7hYLiu08",
      "title": "Get Step-By-Step Fixes with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-21T20:14:00.000Z",
      "url": "https://www.youtube.com/watch?v=6hu7hYLiu08",
      "thumbnail": "https://i.ytimg.com/vi/6hu7hYLiu08/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Copilot provides real-time visual support for home projects and repairs. It can see what you see and deliver step-by-step instructions for issues such as leaky pipes and overflowing washing machines, offering clear, actionable guidance.",
        "bullets": [
          "Real-time support for home projects and repairs.",
          "Copilot can 'see what you see' to assess issues visually.",
          "Delivers step-by-step instructions for tasks.",
          "Examples given: leaky pipes and overflowing washing machines.",
          "Emphasis on clear, actionable guidance."
        ],
        "takeaways": [
          "Real-time visual guidance can speed troubleshooting and reduce equipment downtime.",
          "Step-by-step instructions may allow less-specialized staff to perform routine repairs safely.",
          "Remote visual support can reduce the need for specialist on-site visits and associated costs.",
          "Clear guided workflows can help standardize maintenance procedures and improve consistency."
        ],
        "tags": [
          "Copilot",
          "real-time support",
          "visual assistance",
          "step-by-step",
          "home repairs",
          "plumbing",
          "appliances",
          "remote troubleshooting"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer - Launching January 22!",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield launches worldwide on January 22 and features NVIDIA DLSS 4 with Multi Frame Generation. The 3D real-time strategy RPG trailer was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 Multi Frame Generation 4X Mode.",
        "bullets": [
          "Worldwide release date: January 22.",
          "Game: Arknights: Endfield — a 3D real-time strategy RPG set on Talos-II; player role: Endministrator of Endfield Industries.",
          "Features NVIDIA DLSS 4 with Multi Frame Generation (link provided in description).",
          "Footage captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 Multi Frame Generation 4X Mode.",
          "Official game site and developer/social links included for more information."
        ],
        "takeaways": [
          "The trailer highlights NVIDIA DLSS 4 with Multi Frame Generation — note compatibility/testing requirements for DLSS 4-enabled workloads.",
          "Capture used a GeForce RTX 5080 at 4K Ultra settings — reproducing similar demonstrations in-house will require high-end GPU resources.",
          "4K Ultra capture with DLSS 4 implies higher GPU and encoding throughput when hosting or streaming similar content; plan capacity accordingly.",
          "Worldwide launch date (Jan 22) is a fixed milestone for any coordinated demos, validation, or rollout activities."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "RTX5080",
          "4K",
          "NVIDIAGeForce",
          "Launch",
          "RealTimeStrategy",
          "January22"
        ]
      }
    },
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video shows how Rate Insurance boosts agent efficiency using Agentforce and Gemini. It is presented in the context of the Google Cloud and Salesforce partnership, with a link provided for more information.",
        "bullets": [
          "Showcases Rate Insurance improving agent efficiency.",
          "Highlights the use of Agentforce and Gemini.",
          "Tied to the Google Cloud and Salesforce partnership (link included).",
          "Presented as a demo-style video to watch."
        ],
        "takeaways": [
          "If your organization uses Google Cloud and Salesforce, this demo may be relevant for understanding partner solutions aimed at agent efficiency.",
          "Agentforce and Gemini are featured—verify compatibility and support for these platforms when assessing infrastructure needs.",
          "Refer to the partnership link for details before making data center or grid capacity decisions related to these solutions.",
          "Consider integration and scalability implications for cloud-hosted agent/AI platforms when planning resources."
        ],
        "tags": [
          "Rate Insurance",
          "Agentforce",
          "Gemini",
          "Google Cloud",
          "Salesforce",
          "agent efficiency",
          "partnership",
          "demo",
          "cloud AI"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Charly Stoever, 35, is a financial coach who has been pet sitting full time to live rent-free in Portland, Oregon. Over the past 18 months she’s lived out of two suitcases while earning about $60,000 a year, as featured in CNBC Make It’s Millennial Money series.",
        "bullets": [
          "Charly Stoever, 35, is a financial coach who pet sits full time to avoid rent.",
          "Lives in Portland, Oregon and has spent 18 months living out of two suitcases.",
          "Brings in approximately $60,000 per year from this arrangement.",
          "Profiled in CNBC Make It's Millennial Money series.",
          "Video produced by Lauren Shamo; reporter Ryan Ermey; editor Marisa Forziati."
        ],
        "takeaways": [
          "Example of a full-time, mobile income model ($60K/year) that supports a rent-free lifestyle — a data point on nontraditional employment and residency patterns.",
          "Demonstrates how in-person service roles (pet sitting) can replace conventional housing costs, relevant when considering shifts in local occupancy and service demand.",
          "Highlights workforce mobility and minimal-possessions living (18 months, two suitcases) as a behavioral trend to track when assessing variable demand scenarios.",
          "Anecdotal case from CNBC Make It’s Millennial Money series — useful as qualitative input when modeling social trends that may affect space and capacity planning."
        ],
        "tags": [
          "Charly Stoever",
          "pet sitting",
          "rent-free",
          "Portland",
          "60K",
          "Millennial Money",
          "CNBC Make It",
          "financial coach",
          "mobile lifestyle",
          "travel"
        ]
      }
    },
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Dr. Anna Chacon, 39, is a Miami-based dermatologist who runs her own private practice and earns $900,000 a year. Her reported net worth is about $6 million, made up of $3.2 million in investments, a $1.9 million home and a $1.1 million office building.",
        "bullets": [
          "39-year-old dermatologist in Miami with a private practice",
          "Annual income: $900,000",
          "Total net worth: approximately $6 million",
          "Investments: $3.2 million",
          "Real estate holdings: $1.9M home and $1.1M office building"
        ],
        "takeaways": [
          "Private medical practices that generate high revenue and own office buildings can represent stable commercial customers for power and connectivity services.",
          "High-net-worth practitioners may have capacity to pay for premium backup power, uptime guarantees, or managed services for their clinical offices.",
          "Concentration of medical commercial real estate in urban areas like Miami highlights potential localized demand for reliable infrastructure and service-level commitments."
        ],
        "tags": [
          "dermatologist",
          "private practice",
          "Miami",
          "high income",
          "net worth",
          "investments",
          "real estate",
          "office building",
          "CNBC Make It",
          "2026"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this giant bubble of carbon dioxide is described as a battery that can store 20 megawatts of energy. The video frames the technology as a way to address renewable energy fluctuations and to help drive a global shift to clean energy.",
        "bullets": [
          "Giant bubble of carbon dioxide used as an energy storage device",
          "Reported storage capacity of 20 megawatts",
          "Presented as a battery/energy-storage solution",
          "Designed to address fluctuations in renewable generation",
          "Framed as supporting a global shift to clean energy"
        ],
        "takeaways": [
          "A 20 MW CO2-based storage device is positioned as a utility-scale option relevant to grid planners",
          "The technology is presented specifically to manage renewable intermittency, a key operational concern",
          "Framing around enabling a clean-energy shift aligns with sustainability and decarbonization priorities",
          "Description lacks technical and operational details—seek full specifications and performance data before evaluation"
        ],
        "tags": [
          "co2",
          "carbon-dioxide",
          "energy-storage",
          "battery",
          "renewable-energy",
          "grid",
          "clean-energy",
          "innovation",
          "ieee",
          "technology"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The KPMG ON AIR podcast episode examines how AI is already affecting transfer pricing — from monitoring profitability and comparative analyses to automating documentation — and discusses practical implementation steps. It also covers risks and safeguards (data security, RODO, hallucinations), the role of secure environments like Digital Gateway, and how AI can augment advisors and support staff development.",
        "bullets": [
          "AI use cases: monitoring rentowności, benchmarky porównawcze i automatyzacja dokumentacji cen transferowych.",
          "AI ma wzmacniać pracę doradców podatkowych, nie zastępować ich; wspiera też rozwój młodszych pracowników.",
          "Główne ryzyka: dane, bezpieczeństwo, RODO oraz zjawisko „halucynacji” AI.",
          "Digital Gateway wymieniony jako bezpieczne środowisko do pracy z AI.",
          "Praktyczne kroki: integracja AI z ERP, inteligentne benchmarki i uporządkowanie procesów przed wdrożeniem."
        ],
        "takeaways": [
          "Zabezpiecz środowisko pracy z AI (np. rozwiązania typu Digital Gateway) — bezpieczeństwo danych to priorytet.",
          "Zapewnij zgodność z RODO i mechanizmy przeciwdziałające halucynacjom AI przed produkcyjnym użyciem.",
          "Planuj integrację AI z ERP i wykorzystanie inteligentnych benchmarków dla lepszego monitorowania rentowności.",
          "Uporządkuj procesy i zainwestuj w rozwój kompetencji zespołu, by maksymalnie wykorzystać automatyzację i analitykę AI.",
          "Automatyzacja dokumentacji może odciążyć zasoby operacyjne i poprawić spójność raportowania cen transferowych."
        ],
        "tags": [
          "podatki",
          "AI",
          "ceny transferowe",
          "transfer-pricing",
          "automatyzacja",
          "RODO",
          "ERP",
          "bezpieczeństwo danych"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Copilot is presented as a tool to help you keep momentum by stacking small wins across activities. Whether for workouts, projects, or personal goals, the message emphasizes sustaining progress with Copilot.",
        "bullets": [
          "Focus on stacking small wins to maintain momentum.",
          "Applies across workouts, projects, and personal goals.",
          "Positions Copilot as a companion for ongoing progress.",
          "Emphasizes consistency over single large breakthroughs."
        ],
        "takeaways": [
          "Based on the description, Copilot is framed to help sustain momentum on projects—consider it for keeping long-term initiatives moving.",
          "For operations teams, the emphasis on small wins suggests value in using Copilot to support incremental progress and team continuity.",
          "Use Copilot to reinforce routine tasks and goal-tracking that contribute to larger outcomes over time."
        ],
        "tags": [
          "Microsoft Copilot",
          "productivity",
          "momentum",
          "small wins",
          "goals",
          "projects",
          "workouts",
          "personal development",
          "AI assistant"
        ]
      }
    }
  ]
}