{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-18T20:44:15.537Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "6L86-OnOXV0",
      "title": "How I Built A $1M/Year Business - And Helped My Parents Retire",
      "channel": "CNBC Make It",
      "published_at": "2026-01-17T15:00:09.000Z",
      "url": "https://www.youtube.com/watch?v=6L86-OnOXV0",
      "thumbnail": "https://i.ytimg.com/vi/6L86-OnOXV0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Tuan Le vowed at 15 to help his parents retire after his family emigrated from Vietnam to Toronto in 2015. Ten years later his social video production company, ShortsCut, brings in over $1 million USD per year, and he now pays his parents' rent and living expenses so they no longer work full time.",
        "bullets": [
          "Tuan Le promised at age 15 to help his parents retire after emigrating from Vietnam to Toronto in 2015.",
          "His company, ShortsCut, is a social video production firm generating over $1M USD annually.",
          "Tuan now covers his parents' rent and living expenses so they no longer work full time.",
          "Video produced by CNBC Make It; production and crew credits listed in the description."
        ],
        "takeaways": [
          "A single successful digital media company can scale to >$1M/year, indicating substantial demand for content-related infrastructure.",
          "Growing video production businesses drive needs for reliable storage, processing, and bandwidth—consider capacity planning for creator workloads.",
          "High-revenue creator companies represent opportunity for tailored hosting, CDN, and managed services to support scalable media distribution."
        ],
        "tags": [
          "Tuan Le",
          "ShortsCut",
          "social video",
          "entrepreneurship",
          "CNBC Make It",
          "Vietnam",
          "Toronto",
          "1M/year",
          "parents retire",
          "video production"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The video describes a giant bubble of carbon dioxide that can store 20 megawatts of energy. It frames these CO2 batteries as a way to manage renewable energy fluctuations and help accelerate the global shift to clean energy.",
        "bullets": [
          "Giant bubble of carbon dioxide used as an energy storage medium",
          "Storage capacity cited as 20 megawatts",
          "Positioned to address fluctuations in renewable generation",
          "Presented as a technology to support global clean-energy transition"
        ],
        "takeaways": [
          "A 20 MW storage option could be relevant for balancing renewable intermittency at grid scale or for large facilities.",
          "Decision-makers should evaluate whether a CO2-based storage system matches their capacity and integration needs.",
          "Such storage solutions may support decarbonization goals by smoothing variable renewable output.",
          "Assess potential operational and deployment implications for grid or data center resilience planning."
        ],
        "tags": [
          "ieee",
          "tech",
          "ieeespectrum",
          "innovation",
          "future",
          "futuristic",
          "energy",
          "battery"
        ]
      }
    },
    {
      "id": "OINppmPan0o",
      "title": "Figure Skating | Making Team USA presented by Xfinity with Apolo Ohno",
      "channel": "Team USA",
      "published_at": "2026-01-16T19:30:36.000Z",
      "url": "https://www.youtube.com/watch?v=OINppmPan0o",
      "thumbnail": "https://i.ytimg.com/vi/OINppmPan0o/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, figure skating duo Vadym Kolesnik and Emilia Zingas sit down with Apolo Ohno on this week's episode of Making Team USA presented by Xfinity ahead of the Winter Olympics. The episode highlights the pair's partnership, described as \"built on trust.\"",
        "bullets": [
          "Features ice dance partners Vadym Kolesnik and Emilia Zingas.",
          "Interview conducted by Olympian Apolo Ohno.",
          "Episode of Making Team USA, presented by Xfinity.",
          "Released ahead of the Winter Olympics and emphasizes trust.",
          "Includes calls to subscribe and follow Team USA across multiple social platforms."
        ],
        "takeaways": [
          "Xfinity sponsorship underscores opportunities for infrastructure providers to gain visibility through sports media partnerships.",
          "Olympics-timed content can drive predictable spikes in demand—plan for scalable streaming capacity and CDN readiness.",
          "Promotion across YouTube, website, and major social channels indicates a need to support multi-platform delivery and analytics.",
          "Athlete-focused storytelling relies on high-quality, reliable streaming to maintain audience engagement and brand trust—prioritize uptime and low-latency delivery."
        ],
        "tags": [
          "figure skating",
          "Vadym Kolesnik",
          "Emilia Zingas",
          "Apolo Ohno",
          "Making Team USA",
          "Xfinity",
          "Winter Olympics",
          "Team USA",
          "interview",
          "trust"
        ]
      }
    },
    {
      "id": "RalzsofAYHM",
      "title": "29-year-old spent $20,000 to open a store in New York — now it brings in $1.6 million a year",
      "channel": "CNBC Make It",
      "published_at": "2026-01-16T17:00:48.000Z",
      "url": "https://www.youtube.com/watch?v=RalzsofAYHM",
      "thumbnail": "https://i.ytimg.com/vi/RalzsofAYHM/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Abby Price started Abbode as a Parsons graduate student, selling dried floral arrangements to New Yorkers via Facebook in 2019. By March 2022 she had a Nolita storefront selling bouquets and home decor and used the shop’s cashflow to buy a $15,000 embroidery machine she purchased “on a total whim,” after a key item sat covered in dust in the basement for a year.",
        "bullets": [
          "Abbode founded by Abby Price while at Parsons School of Design.",
          "Started selling dried floral arrangements on Facebook in 2019.",
          "Opened a Nolita storefront by March 2022 selling bouquets and home decor.",
          "Store cashflow financed a $15,000 embroidery machine purchase.",
          "An important piece of the business was unused in the shop basement for a year."
        ],
        "takeaways": [
          "Small retail businesses can transition from online sales to physical storefronts, affecting local infrastructure needs.",
          "Mid-range capital equipment purchases (e.g., $15K embroidery machine) can be financed from operating cashflow and may introduce new on-site power or space requirements.",
          "Unpredictable timing of equipment adoption suggests planning for flexible electrical capacity and easy interconnection for small urban businesses."
        ],
        "tags": [
          "Abby Price",
          "Abbode",
          "Parsons School of Design",
          "dried florals",
          "Facebook sales",
          "Nolita",
          "storefront",
          "home decor",
          "embroidery machine",
          "small business"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI już teraz zmienia podejście do cen transferowych — od monitorowania rentowności i benchmarków po automatyzację dokumentacji. W podcaście eksperci KPMG (Monika Palmowska, Jakub Roszkiewicz) omawiają korzyści, ryzyka związane z danymi i bezpieczeństwem, integrację z ERP oraz praktyczne kroki i filary wdrożenia AI.",
        "bullets": [
          "Omówienie zastosowań AI w monitorowaniu rentowności i analizach porównawczych.",
          "Automatyzacja dokumentacji cen transferowych jako praktyczne zastosowanie.",
          "Dyskusja o roli doradców — AI jako wsparcie, nie zastępstwo.",
          "Ryzyka: ochrona danych, bezpieczeństwo, RODO i problem halucynacji AI.",
          "Rozwiązania bezpieczne (Digital Gateway), integracja z ERP i pierwsze kroki wdrożeniowe."
        ],
        "takeaways": [
          "Zadbaj o uporządkowanie procesów i danych przed wdrożeniem AI — to fundament transformacji.",
          "Planuj integrację AI z ERP i systemami finansowymi, by wykorzystać inteligentne benchmarki i monitorowanie rentowności.",
          "Uwzględnij wymagania bezpieczeństwa i RODO — używaj bezpiecznych środowisk (np. Digital Gateway) do pracy z AI.",
          "Traktuj AI jako narzędzie wspierające pracowników i rozwój kompetencji, nie jako pełne zastępstwo doradców."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "podatki",
          "automatyzacja",
          "ERP",
          "bezpieczeństwo danych",
          "RODO",
          "Digital Gateway",
          "monitorowanie rentowności"
        ]
      }
    },
    {
      "id": "dGfcT63U7Mo",
      "title": "The 2026 U.S. Olympic Figure Skating Team 🇺🇸",
      "channel": "Team USA",
      "published_at": "2026-01-15T20:43:24.000Z",
      "url": "https://www.youtube.com/watch?v=dGfcT63U7Mo",
      "thumbnail": "https://i.ytimg.com/vi/dGfcT63U7Mo/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video announces the U.S. Olympic figure skating lineup with an enthusiastic tone. The description is brief and highlights the Winter Olympics via a hashtag and emoji.",
        "bullets": [
          "Announces a U.S. Olympic figure skating lineup",
          "Description uses an excited tone (fire emoji)",
          "Includes the hashtag #WinterOlympics",
          "No athlete names or lineup details provided in the description",
          "Transcript is not available"
        ],
        "takeaways": [
          "Minimal description means metadata enrichment (titles, tags, thumbnails) will be important for discoverability",
          "Presence of #WinterOlympics suggests indexing by event-related tags should be prioritized",
          "No transcript available — generating or attaching a transcript will improve accessibility and searchability"
        ],
        "tags": [
          "U.S. Olympic",
          "Figure Skating",
          "Lineup",
          "WinterOlympics",
          "Olympic Team",
          "Skating",
          "Winter Sports",
          "Olympics"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video encourages keeping momentum on workouts, projects, and personal goals by stacking small wins with Copilot. It emphasizes using Copilot to sustain consistent progress over time.",
        "bullets": [
          "Promotes stacking small wins to maintain momentum.",
          "Applies to workouts, projects, and personal goals.",
          "Positions Microsoft Copilot as a companion for steady progress.",
          "Focuses on consistency and incremental improvement."
        ],
        "takeaways": [
          "Break large infrastructure or migration efforts into small, trackable wins to keep projects moving with Copilot support.",
          "Encourage teams to adopt incremental improvements so long-term operations and upgrades don’t lose momentum.",
          "Use Copilot in pilot workflows to demonstrate steady progress before scaling across data center projects.",
          "Prioritize repeatable, small tasks that show regular progress to maintain stakeholder confidence during multi-phase initiatives."
        ],
        "tags": [
          "Microsoft Copilot",
          "momentum",
          "small wins",
          "productivity",
          "projects",
          "workouts",
          "personal goals",
          "incremental improvement"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights how precision and speed in high-frequency trading rely on the Dell PowerEdge R770AP server powered by Intel® Xeon® 6 processors. It states these CPUs enable hundreds of trades in seconds, helping maximize gains and minimize losses and positioning Intel Xeon 6 as an influence on the future of finance.",
        "bullets": [
          "Topic: high-frequency trading (HFT) emphasizes precision and speed.",
          "Hardware: Dell PowerEdge R770AP server powered by Intel Xeon 6 processors.",
          "Claimed benefit: performs hundreds of trades in seconds to maximize gains and minimize losses.",
          "Positioning: Intel Xeon 6 CPUs framed as defining the future of finance.",
          "Intel Business offers IT resources, guidance, and expert insights for deployments."
        ],
        "takeaways": [
          "Evaluate servers like the Dell PowerEdge R770AP with Intel Xeon 6 for latency-sensitive trading workloads.",
          "Prioritize CPU performance and precision when selecting hardware for high-frequency trading to support rapid execution and risk control.",
          "Ensure data center infrastructure can sustain the rapid trade throughput described (hundreds of trades in seconds).",
          "Use Intel Business resources and vendor guidance when planning and deploying high-performance finance infrastructure."
        ],
        "tags": [
          "high-frequency-trading",
          "HFT",
          "Dell-PowerEdge-R770AP",
          "Intel-Xeon-6",
          "low-latency",
          "finance",
          "data-center",
          "servers",
          "high-performance",
          "trading"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video says the creative spark was out and Copilot brought it back to life. It invites viewers to download Copilot and try it for themselves via the link in the bio.",
        "bullets": [
          "Message: Copilot revived lost creativity.",
          "Call to action: Download Copilot and try it via the link in bio.",
          "Short promotional format with no transcript provided."
        ],
        "takeaways": [
          "The clip positions Copilot as a creativity/productivity aid—note its marketing focus on creative support.",
          "A direct invitation to download suggests Microsoft expects practical trials; consider a hands-on evaluation to judge relevance.",
          "Limited promo detail means decision-makers should test Copilot directly to determine applicability for grid or data center tasks."
        ],
        "tags": [
          "Copilot",
          "Microsoft Copilot",
          "creativity",
          "AI assistant",
          "download",
          "try it",
          "promo",
          "call-to-action"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video highlights Where Winds Meet, an open-world martial arts RPG presented with DLSS 4 and Multi Frame Generation to showcase #RTXOn visuals. The clip is credited to DigitalDreamsyt.",
        "bullets": [
          "Game: Where Winds Meet — open-world martial arts RPG",
          "Feature showcased: DLSS 4 with Multi Frame Generation",
          "Visual emphasis: #RTXOn",
          "Video credit: @DigitalDreamsyt"
        ],
        "takeaways": [
          "The content highlights usage of DLSS 4 and RTX features, so infrastructure should support NVIDIA RTX-enabled GPU capabilities.",
          "Ensure driver and software stack compatibility for DLSS 4 and Multi Frame Generation when deploying or demoing such graphics workloads.",
          "Plan GPU capacity and resource allocation to handle advanced rendering/acceleration features showcased in promotional content.",
          "Account for content ingestion, licensing, and attribution workflows when incorporating third-party creator footage into demos or showcases."
        ],
        "tags": [
          "WhereWindsMeet",
          "DLSS4",
          "MultiFrameGeneration",
          "RTXOn",
          "OpenWorld",
          "MartialArts",
          "NVIDIAGeForce",
          "DigitalDreamsyt",
          "Gaming",
          "Graphics"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this YouTube video is titled \"Taha Khalifa (Intel) | Intel Business\" and is published on the Intel Business channel. The description directs viewers to subscribe and to Intel Business resources (website and social channels) for IT guidance across data centers and devices; no transcript is available.",
        "bullets": [
          "Video title: \"Taha Khalifa (Intel) | Intel Business\" on the Intel Business channel",
          "No transcript available for the video",
          "Subscribe link provided in the description",
          "Intel Business positions itself as a resource for IT, from data centers to devices",
          "Links to website and social channels (X, LinkedIn, Facebook) are included"
        ],
        "takeaways": [
          "Subscribe to Intel Business to receive updates and access their IT/data-center guidance",
          "Visit the Intel Business website for resources and expert insights to support IT projects",
          "Follow Intel Business on social channels to stay connected to timely IT and data-center content",
          "Because no transcript is provided, review the video and linked resources directly for technical details"
        ],
        "tags": [
          "Taha Khalifa",
          "Intel",
          "Intel Business",
          "data centers",
          "IT",
          "devices",
          "IT resources",
          "YouTube",
          "subscribe",
          "enterprise IT"
        ]
      }
    },
    {
      "id": "kSocjh8PZnQ",
      "title": "Rynek dóbr luksusowych w obliczu transformacji | Andrzej Marczak, Tomasz Wiśniewski",
      "channel": "KPMG Poland",
      "published_at": "2026-01-13T10:23:31.000Z",
      "url": "https://www.youtube.com/watch?v=kSocjh8PZnQ",
      "thumbnail": "https://i.ytimg.com/vi/kSocjh8PZnQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Podcast KPMG ON AIR omawia zmiany na rynku dóbr luksusowych: od nacisku na doświadczenia i personalizację, przez znaczenie ESG i „affordable luxury”, po rolę pokolenia Z, rozwój rynku w Polsce oraz przyszłość napędzaną AI i rzemiosłem. Ekspertami są Andrzej Marczak i Tomasz Wiśniewski; w opisie dostępny jest też raport KPMG „Luxury in the Midst of Change 2025”.",
        "bullets": [
          "Globalne trendy: „luxury fatigue” i koncentracja popytu (2% klientów = 40% rynku).",
          "Rosnące znaczenie doświadczeń, personalizacji i aspirujących konsumentów (w tym Gen Z).",
          "ESG i odpowiedzialny luksus: ekoskóry oraz certyfikacje jako ważne elementy oferty.",
          "Polska: rosnący, lecz rozproszony rynek; rozwój sztuki, młodych artystów i turystyki luksusowej (Bałtyk, hotele, spa).",
          "Przyszłość: technologie (AI) oraz rzemiosło i ludzki wymiar jako kluczowe aspekty rozwoju sektora."
        ],
        "takeaways": [
          "ESG w centrum uwagi oznacza dla centrów danych konieczność planowania energooszczędnej infrastruktury i uwzględniania certyfikacji środowiskowych.",
          "Wzmianka o AI sugeruje rosnące zapotrzebowanie na moc obliczeniową i rozwiązania gotowe na przetwarzanie danych w czasie rzeczywistym.",
          "Personalizacja i doświadczenia klienta zwiększają potrzebę niskich opóźnień i wysokiej dostępności usług cyfrowych — warto rozważyć redundancję i sieci o niskiej latencji.",
          "Rozwój turystyki luksusowej i hotelarstwa w Polsce może przekładać się na lokalne zapotrzebowanie na pojemność i łączność — planuj skalowalność i lokalne zasoby."
        ],
        "tags": [
          "luksus",
          "ESG",
          "AI",
          "personalizacja",
          "rynek polski",
          "turystyka luksusowa",
          "raport KPMG",
          "sztuka"
        ]
      }
    }
  ]
}