{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-19T22:46:30.517Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Dr. Anna Chacon, 39, is a Miami-based dermatologist who runs her own private practice and earns $900,000 a year. Her reported net worth is about $6 million, made up of $3.2 million in investments, a $1.9 million home, and a $1.1 million office building.",
        "bullets": [
          "Dr. Anna Chacon, 39, lives in Miami, FL.",
          "She is a dermatologist with her own private practice.",
          "Annual earnings reported: $900,000.",
          "Total net worth: ~$6 million.",
          "Net worth breakdown: $3.2M investments, $1.9M home, $1.1M office building."
        ],
        "takeaways": [
          "Private-practice medical professionals can be high-income and hold significant investable assets.",
          "Some healthcare providers directly own commercial office buildings, representing commercial real-estate stakeholders.",
          "Ownership of medical offices implies potential demand for reliable infrastructure and services tied to commercial properties.",
          "Affluent practitioners with sizable investments may be able to finance or prioritize upgrades to facility infrastructure."
        ],
        "tags": [
          "dermatologist",
          "private practice",
          "high income",
          "net worth",
          "real estate",
          "investments",
          "Miami",
          "office building",
          "CNBC Make It"
        ]
      }
    },
    {
      "id": "6L86-OnOXV0",
      "title": "How I Built A $1M/Year Business - And Helped My Parents Retire",
      "channel": "CNBC Make It",
      "published_at": "2026-01-17T15:00:09.000Z",
      "url": "https://www.youtube.com/watch?v=6L86-OnOXV0",
      "thumbnail": "https://i.ytimg.com/vi/6L86-OnOXV0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Tuan Le vowed at 15 to help his parents retire after his family emigrated from Vietnam to Toronto in 2015, and a decade later his social video production company, ShortsCut, is generating over $1 million USD a year. He now pays his parents' rent and living expenses so they no longer have to work full time.",
        "bullets": [
          "Tuan Le promised to help his parents retire after emigrating from Vietnam to Toronto in 2015.",
          "He founded ShortsCut, a social video production company.",
          "ShortsCut brings in over $1 million USD in annual sales as of 10 years after the vow.",
          "Tuan now financially supports his parents' rent and living expenses so they can stop full-time work.",
          "Video produced by CNBC Make It; published January 17, 2026."
        ],
        "takeaways": [
          "High-revenue potential exists within social video production companies—consider them as potential enterprise customers.",
          "Growing, revenue-generating media firms may require reliable hosting and delivery services; evaluate whether your offerings meet that market's needs.",
          "Success of small-to-medium production businesses can indicate steady demand for digital media capacity—plan capacity and service levels accordingly.",
          "Customer segments driven by video content creation may value predictable, scalable infrastructure and billing arrangements."
        ],
        "tags": [
          "Tuan Le",
          "ShortsCut",
          "social video",
          "entrepreneurship",
          "CNBC Make It",
          "1M USD",
          "parents retirement",
          "media production"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, a giant bubble of carbon dioxide is being used as a battery that can store 20 megawatts of energy. The description says these new batteries can help manage fluctuations in renewable generation and support the global transition to clean energy.",
        "bullets": [
          "Giant carbon dioxide bubble functions as an energy storage device.",
          "Described capacity: stores 20 megawatts of energy.",
          "Aimed at addressing fluctuations in renewable energy supply.",
          "Presented as a technology to support the shift to clean energy globally."
        ],
        "takeaways": [
          "20 MW storage capacity indicates potential for meaningful short-term buffering of variable renewable output—consider implications for capacity planning.",
          "Could be useful for grid balancing and improving resilience of critical loads such as data centers by smoothing renewables' intermittency.",
          "Decision-makers should evaluate integration requirements with existing infrastructure and interconnection points.",
          "Track pilot results and vendor details to assess scalability, reliability, and fit for specific operational needs."
        ],
        "tags": [
          "CO2",
          "battery",
          "energy-storage",
          "renewable",
          "clean-energy",
          "ieee",
          "tech",
          "innovation"
        ]
      }
    },
    {
      "id": "OINppmPan0o",
      "title": "Figure Skating | Making Team USA presented by Xfinity with Apolo Ohno",
      "channel": "Team USA",
      "published_at": "2026-01-16T19:30:36.000Z",
      "url": "https://www.youtube.com/watch?v=OINppmPan0o",
      "thumbnail": "https://i.ytimg.com/vi/OINppmPan0o/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, figure skating duo Vadym Kolesnik and Emilia Zingas sit down with Apolo Ohno on an episode of Making Team USA presented by Xfinity ahead of the Winter Olympics. The episode is framed around the partners' relationship and is described as \"Built on trust.\"",
        "bullets": [
          "Features pair skaters Vadym Kolesnik and Emilia Zingas.",
          "Interview conducted by Olympian Apolo Ohno.",
          "Part of the Making Team USA series, presented by Xfinity.",
          "Promoted as focusing on trust between the partners.",
          "Released by the Team USA YouTube channel ahead of the Winter Olympics."
        ],
        "takeaways": [
          "Trust and clear coordination between partners are essential—apply the same emphasis to cross-team collaboration in critical operations.",
          "Preparation for high-stakes events (like the Olympics) parallels readiness planning for major grid or data center incidents.",
          "Highlighting team stories through external channels can strengthen stakeholder confidence and internal morale.",
          "Regularly scheduled check-ins and rehearsals help ensure smooth performance under pressure."
        ],
        "tags": [
          "figure-skating",
          "Vadym Kolesnik",
          "Emilia Zingas",
          "Apolo Ohno",
          "Making Team USA",
          "Winter Olympics",
          "Team USA",
          "Xfinity",
          "pairs skating",
          "sports interview"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI is already reshaping transfer pricing workstreams—supporting monitoring of profitability, comparative analyses and automation of documentation. KPMG experts note AI is likely to strengthen advisors rather than replace them, while flagging risks (data security, RODO, hallucinations) and practical implementation steps like process cleanup, ERP integration and using secure environments such as Digital Gateway.",
        "bullets": [
          "AI use cases: rentability monitoring, benchmark analyses, and TP documentation automation.",
          "AI augments tax advisors' work but does not replace professional judgement.",
          "Key risks include data protection, security and AI hallucinations; compliance with RODO is highlighted.",
          "Digital Gateway presented as a secure environment for AI work.",
          "Implementation priorities: organise processes, integrate AI with ERP, and build intelligent benchmarks."
        ],
        "takeaways": [
          "Provide or enable secure, compliant environments (e.g., Digital Gateway) for AI workloads to protect sensitive tax data.",
          "Ensure strict data governance and RODO-compliant handling as a precondition for AI in transfer pricing.",
          "Support integration capabilities with ERP and benchmarking tools to enable AI-driven workflows and analyses.",
          "Prioritise process standardisation and clear data pipelines before AI rollout to reduce operational risk.",
          "Plan for upskilling and governance processes to manage AI outputs and mitigate hallucination risks."
        ],
        "tags": [
          "AI",
          "TransferPricing",
          "CenyTransferowe",
          "KPMG",
          "DigitalGateway",
          "ERP",
          "DataSecurity",
          "RODO",
          "Automation",
          "TaxAdvisors"
        ]
      }
    },
    {
      "id": "dGfcT63U7Mo",
      "title": "The 2026 U.S. Olympic Figure Skating Team 🇺🇸",
      "channel": "Team USA",
      "published_at": "2026-01-15T20:43:24.000Z",
      "url": "https://www.youtube.com/watch?v=dGfcT63U7Mo",
      "thumbnail": "https://i.ytimg.com/vi/dGfcT63U7Mo/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this Team USA video presents the U.S. Olympic Figure Skating lineup for the 2026 Winter Olympics. The brief description highlights the lineup and tags the content with #WinterOlympics.",
        "bullets": [
          "Title: The 2026 U.S. Olympic Figure Skating Team",
          "Channel: Team USA",
          "Published: 2026-01-15T20:43:24.000Z",
          "Description: \"This U.S. Olympic Figure Skating lineup. 🔥\" with #WinterOlympics",
          "No transcript available"
        ],
        "takeaways": [
          "If distributing or hosting this content, monitor traffic around the publish date and Olympic season to handle potential viewership increases.",
          "Ensure CDN and edge caching configurations are optimized for high-resolution sports video to reduce origin load.",
          "Validate streaming bitrates, adaptive delivery, and DRM settings ahead of peak demand windows for sports content.",
          "Keep analytics and logging enabled to capture audience metrics for sponsorship, rights, and capacity planning."
        ],
        "tags": [
          "FigureSkating",
          "TeamUSA",
          "WinterOlympics",
          "2026",
          "Olympics",
          "IceSkating",
          "USOlympicTeam",
          "SportsAnnouncement"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video encourages using Microsoft Copilot to keep momentum by stacking small wins. It positions Copilot as a way to sustain progress across workouts, projects, and personal goals.",
        "bullets": [
          "Central theme: 'Stack small wins' to build and sustain momentum.",
          "Highlights using Copilot to keep momentum going.",
          "Examples of contexts: workouts, projects, personal goals.",
          "Short, motivational framing rather than technical detail."
        ],
        "takeaways": [
          "Apply the 'small wins' approach to long-term infrastructure and migration projects to maintain steady progress.",
          "Use incremental milestones to keep operations and teams aligned and motivated.",
          "Consider adopting tools like Copilot to support consistent, repeatable progress across tasks and workflows."
        ],
        "tags": [
          "Microsoft Copilot",
          "productivity",
          "momentum",
          "small wins",
          "goal-setting",
          "workouts",
          "projects",
          "personal goals",
          "motivation",
          "workflow"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The video highlights how the Dell PowerEdge R770AP server, powered by Intel® Xeon® 6 processors, delivers the precision and speed needed for high-frequency trading. It emphasizes that these CPUs enable performing hundreds of trades in seconds to help maximize gains and minimize losses and positions Intel Xeon 6 as shaping the future of finance.",
        "bullets": [
          "Focus on high-frequency trading where every second matters.",
          "Showcases Dell PowerEdge R770AP server equipped with Intel Xeon 6 processors.",
          "Claims precision and speed enable hundreds of trades in seconds.",
          "Aims to help maximize gains and minimize losses in trading.",
          "Frames Intel Xeon 6 CPU performance as defining the future of finance."
        ],
        "takeaways": [
          "For trading operations, server and CPU choice is presented as critical to speed and precision.",
          "Dell PowerEdge R770AP with Intel Xeon 6 is highlighted as a solution for latency-sensitive trading workloads.",
          "Emphasis on hundreds of trades per second underscores the need for high-performance compute in finance.",
          "Decision-makers should weigh CPU performance when aiming to maximize gains and reduce trading losses."
        ],
        "tags": [
          "high-frequency trading",
          "HFT",
          "Intel Xeon 6",
          "Dell PowerEdge R770AP",
          "trading servers",
          "low-latency",
          "finance",
          "data center",
          "performance",
          "Intel Business"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the creative spark was out and Copilot brought it back to life. The video is a short promotional call to action inviting viewers to download Copilot and try it via the link in the bio.",
        "bullets": [
          "States Copilot revived a lost creative spark.",
          "Serves as a promotional CTA to download and try Copilot.",
          "Directs viewers to the link in the bio for the download.",
          "No transcript is available; message is concise and promotional."
        ],
        "takeaways": [
          "The message positions Copilot as a tool to restore creativity—decision-makers can treat the CTA as an invitation to evaluate it firsthand.",
          "Downloading and trying Copilot via the provided link offers a quick way to perform a hands-on assessment.",
          "Use the short promotional prompt as a trigger to run a brief internal trial to see if Copilot aligns with team content or workflow needs."
        ],
        "tags": [
          "Copilot",
          "creativity",
          "download",
          "call-to-action",
          "Microsoft",
          "promo",
          "try-now",
          "link-in-bio",
          "creative-spark",
          "short-video"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this clip highlights the open-world martial arts RPG Where Winds Meet using DLSS 4 with Multi Frame Generation and RTX features. The footage is credited to @DigitalDreamsyt and is presented with the #RTXOn tag.",
        "bullets": [
          "Showcases Where Winds Meet, an open-world martial arts RPG.",
          "Highlights NVIDIA DLSS 4 with Multi Frame Generation.",
          "Promotes visuals with the #RTXOn tag.",
          "Video credit: @DigitalDreamsyt."
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is featured — consider support for DLSS 4 SDKs and inference workflows.",
          "#RTXOn usage indicates RTX-dependent rendering features — plan for RTX-capable GPU provisioning if supporting similar demos.",
          "Adoption of NVIDIA rendering tech in this title suggests tracking compatibility and performance requirements for modern game workloads."
        ],
        "tags": [
          "WhereWindsMeet",
          "DLSS4",
          "MultiFrameGeneration",
          "RTXOn",
          "OpenWorld",
          "MartialArts",
          "DigitalDreamsyt",
          "NVIDIAGeForce"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this Intel Business video titled \"Taha Khalifa (Intel) | Intel Business\" directs viewers to the Intel Business channel and resource center. The description emphasizes that Intel Business provides resources, guidance, and expert insights for IT projects spanning data centers to devices, and includes links to subscribe and connect via website and social channels.",
        "bullets": [
          "Video title: Taha Khalifa (Intel) on the Intel Business channel",
          "Intel Business offers resources, guidance, and expert insights for IT projects",
          "Coverage scope cited: from data centers to devices",
          "Subscribe link included for the Intel Business YouTube channel",
          "Links provided to website and social channels (X, LinkedIn, Facebook)"
        ],
        "takeaways": [
          "Use Intel Business as a central resource hub for guidance relevant to data center projects",
          "Follow the Intel Business website and social channels to access expert insights and updates",
          "Leverage channel content to support IT project planning across both data center and device deployments"
        ],
        "tags": [
          "Intel",
          "Intel Business",
          "Taha Khalifa",
          "IT resources",
          "data center",
          "devices",
          "IT projects",
          "YouTube"
        ]
      }
    },
    {
      "id": "kSocjh8PZnQ",
      "title": "Rynek dóbr luksusowych w obliczu transformacji | Andrzej Marczak, Tomasz Wiśniewski",
      "channel": "KPMG Poland",
      "published_at": "2026-01-13T10:23:31.000Z",
      "url": "https://www.youtube.com/watch?v=kSocjh8PZnQ",
      "thumbnail": "https://i.ytimg.com/vi/kSocjh8PZnQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The KPMG ON AIR episode discusses current forces reshaping the luxury goods market: a shift toward experiences over ownership, rising importance of ESG and certification, the emergence of \"affordable luxury,\" and the role of personalization. Guests note that while global luxury demand softens, Poland's market continues to grow (though remains fragmented), with future drivers including AI, craftsmanship and luxury hospitality/tourism.",
        "bullets": [
          "Global trends: \"luxury fatigue,\" experiential focus, and \"affordable luxury\".",
          "High concentration of value: top 2% of clients account for ~40% of the market.",
          "Personalization, exclusive experiences, and Gen Z preference for experiences over possessions.",
          "ESG and responsible luxury (e.g., eco-leathers, certifications) are increasingly important.",
          "Poland: growing but fragmented market; luxury tourism, hotels, art and AI noted as future drivers."
        ],
        "takeaways": [
          "ESG emphasis in luxury suggests grid/data center operators should prioritize low‑carbon energy options and relevant certifications when courting premium/luxury-sector clients.",
          "Growth in Polish luxury hospitality and premium tourism implies potential localized demand for reliable, high‑quality power and connectivity in hotel, spa and event locations.",
          "Discussion of AI and personalization as future trends indicates rising need for compute capacity, low‑latency services and scalable infrastructure to support data‑driven customer experiences.",
          "Concentration of spending among a small wealthy segment points to demand profiles that value resilience, premium SLAs and bespoke service offerings rather than only volume-driven capacity."
        ],
        "tags": [
          "luksus",
          "luxury",
          "ESG",
          "Polska",
          "AI",
          "personalizacja",
          "hospitality",
          "affordable-luxury",
          "KPMG",
          "raport"
        ]
      }
    }
  ]
}