{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-27T07:01:32.683Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "WiPpgBvul5Q",
      "title": "Microsoft SQL Server Innovation on AWS | Let's Talk About Data",
      "channel": "AWS Events",
      "published_at": "2026-01-27T05:25:27.000Z",
      "url": "https://www.youtube.com/watch?v=WiPpgBvul5Q",
      "thumbnail": "https://i.ytimg.com/vi/WiPpgBvul5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This session reviews Microsoft SQL Server innovations on AWS announced at re:Invent 2025, including RDS for SQL Server Developer Edition support, M7i/R7i instance support, and expanded storage up to 256 TiB. It also highlights SQL Server 2025 on EC2, new cost, storage, compute and tooling features, and a demo of performance gains on the latest generation instances.",
        "bullets": [
          "RDS for SQL Server adds Developer Edition support",
          "New M7i and R7i instance support with optimized CPU",
          "Expanded RDS storage options up to 256 TiB",
          "SQL Server 2025 available on AWS EC2 with new cost, storage, compute and tooling features",
          "Demo showing SQL Server performance gains on latest-generation instances"
        ],
        "takeaways": [
          "Developer Edition on RDS enables lower-cost development and testing environments and can reduce Microsoft licensing expenses",
          "M7i/R7i instance support with optimized CPU offers improved performance potential for SQL Server workloads",
          "Expanded storage up to 256 TiB supports larger databases on RDS without moving to alternative storage platforms",
          "Availability of SQL Server 2025 on EC2 plus new cost and tooling features provides more options for migration, modernization, and optimization",
          "A live performance demo illustrates the benefits of adopting latest-generation instances for SQL Server"
        ],
        "tags": [
          "RDS for SQL Server",
          "SQL Server 2025",
          "AWS EC2",
          "M7i",
          "R7i",
          "Developer Edition",
          "256 TiB storage",
          "cost optimization",
          "re:Invent 2025",
          "performance"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI in audit is presented as a current, practical toolset that helps audit teams automate repetitive tasks, analyze entire data populations, and support decision-making. The speakers (Katarzyna Chojniak and Alicja Barska) outline specific tools (AI Transaction Scoring Tool, Clara AI, KPMG Clara), discuss changing auditor roles, and highlight implementation challenges like data security and regulatory issues.",
        "bullets": [
          "Praktyczne zastosowania: analiza pełnych populacji (AI Transaction Scoring Tool) i konwersacyjny asystent (Clara AI).",
          "KPMG Clara jako platforma do zarządzania badaniem i komunikacji z klientem w czasie rzeczywistym.",
          "Przejście z próbkowania na analizę pełnych populacji zmienia podejście do audytu.",
          "Zmiana roli audytora — więcej nadzoru analitycznego i wykorzystania technologii.",
          "Wyzwania: adaptacja audytorów, bezpieczeństwo danych, środowisko regulacyjne i potencjalne zagrożenia AI."
        ],
        "takeaways": [
          "Zadbaj o bezpieczeństwo i zgodność danych — wdrożenie AI w audycie stawia je w centrum wymagań.",
          "Real‑time audit platforms (np. KPMG Clara) mogą przyspieszyć weryfikację i raportowanie dotyczące infrastruktury centrum danych.",
          "Analiza pełnych populacji ułatwia kompleksową kontrolę logów i transakcji zamiast polegania na próbkowaniu.",
          "Automatyzacja rutynowych procesów pozwala audytorom skoncentrować się na ocenach ryzyka i krytycznych kontrolach systemowych.",
          "Inwestuj w kompetencje zespołu i bezpieczne integracje technologiczne, aby skutecznie wdrożyć rozwiązania AI."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMG Clara",
          "Clara AI",
          "analiza pełnych populacji",
          "bezpieczeństwo danych",
          "regulacje",
          "transformacja cyfrowa",
          "innowacje"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI is already reshaping transfer pricing by enabling profitability monitoring, comparative analyses, and automation of documentation. KPMG experts Monika Palmowska and Jakub Roszkiewicz discuss practical adoption steps, integration with ERP, data/security risks (including GDPR and hallucinations), and emphasize that AI will augment rather than replace advisors.",
        "bullets": [
          "Przykłady zastosowań: monitorowanie rentowności, inteligentne benchmarki, automatyzacja dokumentacji cen transferowych.",
          "AI wspiera doradców podatkowych — zwiększa efektywność i kompetencje młodszych pracowników, nie zastępuje ekspertów.",
          "Główne ryzyka: ochrona danych, bezpieczeństwo, zgodność z RODO oraz problem halucynacji modeli.",
          "Rozwiązania i zabezpieczenia: Digital Gateway jako bezpieczne środowisko do pracy z AI.",
          "Wdrożenie: zacząć od uporządkowania procesów, definiowania person i integracji z ERP; omówione filary transformacji."
        ],
        "takeaways": [
          "Zapewnij silne zarządzanie danymi i zgodność z RODO przed wdrożeniem AI w procesach finansowych/podatkowych.",
          "Priorytetem jest integracja AI z ERP — to umożliwia inteligentne benchmarki i automatyczne raportowanie.",
          "Uporządkowane, standaryzowane procesy są podstawą skutecznej i bezpiecznej transformacji AI.",
          "Wykorzystaj AI do automatyzacji monitoringu i dokumentacji, zachowując nadzór ekspertów dla krytycznych decyzji."
        ],
        "tags": [
          "podatki",
          "AI",
          "ceny transferowe",
          "transfer pricing",
          "ERP",
          "bezpieczeństwo danych",
          "RODO",
          "automatyzacja",
          "monitoring rentowności",
          "Digital Gateway"
        ]
      }
    }
  ]
}