{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-22T04:23:53.714Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "t33Fh1JZVgA",
      "title": "AI at Speed: From Investment to Performance",
      "channel": "PwC US",
      "published_at": "2026-01-21T22:48:29.000Z",
      "url": "https://www.youtube.com/watch?v=t33Fh1JZVgA",
      "thumbnail": "https://i.ytimg.com/vi/t33Fh1JZVgA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, PwC US Senior Partner and CEO Paul Griggs speaks with CNBC’s Emma Crosby at the 2026 World Economic Forum in Davos about how organizations are moving from AI exploration to execution, assessing initiatives through investment discipline, performance, and measurable value. They emphasize moving early, placing capital with intent, and designing operating models that remain resilient without sacrificing performance as AI delivers measurable outcomes today and supports future transformation.",
        "bullets": [
          "Organizations are shifting from AI exploration to execution.",
          "AI is being evaluated through investment discipline, performance, and measurable value.",
          "Leading organizations move early and place capital with intent.",
          "Operating models are being designed for resilience without sacrificing performance.",
          "AI is delivering measurable outcomes today while enabling future transformation."
        ],
        "takeaways": [
          "Apply investment discipline: evaluate AI initiatives by measurable value and performance.",
          "Move early and place capital with intent to support strategic AI efforts.",
          "Design operating models that prioritize resilience without sacrificing performance.",
          "Focus on measurable outcomes today while using AI to enable longer-term transformation."
        ],
        "tags": [
          "AI",
          "investment-discipline",
          "performance",
          "measurable-outcomes",
          "resilience",
          "operating-models",
          "Davos2026",
          "PwC",
          "Paul-Griggs",
          "CNBC"
        ]
      }
    },
    {
      "id": "6hu7hYLiu08",
      "title": "Get Step-By-Step Fixes with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-21T20:14:00.000Z",
      "url": "https://www.youtube.com/watch?v=6hu7hYLiu08",
      "thumbnail": "https://i.ytimg.com/vi/6hu7hYLiu08/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Copilot provides real-time support for home projects and repairs by seeing what you see and delivering step-by-step instructions. Examples include guidance for leaky pipes and overflowing washing machines, presented as clear, guided assistance.",
        "bullets": [
          "Real-time visual support: Copilot can see what you see.",
          "Step-by-step instructions for home repairs and projects.",
          "Handles issues like leaky pipes and overflowing washing machines.",
          "Aims to provide clear, guided assistance during fixes.",
          "Focused on practical, on-the-spot troubleshooting for homeowners."
        ],
        "takeaways": [
          "The described real-time visual and step-by-step guidance could support onsite technicians during facility repairs and maintenance.",
          "Clear, guided instructions may help improve consistency of repairs and speed up technician training.",
          "Faster, guided troubleshooting could reduce downtime for physical infrastructure if applied to facilities.",
          "Deploying such visual assistance in data centers would require careful handling of visual data, access controls, and operational policies."
        ],
        "tags": [
          "Microsoft Copilot",
          "Copilot",
          "home repairs",
          "real-time support",
          "visual troubleshooting",
          "step-by-step",
          "appliance repair",
          "plumbing"
        ]
      }
    },
    {
      "id": "IKkVWKdumHw",
      "title": "re:Invent 2025 - Chalk Talk - Origin management for multi-region applications with Amazon CloudFront",
      "channel": "AWS Events",
      "published_at": "2026-01-21T17:49:36.000Z",
      "url": "https://www.youtube.com/watch?v=IKkVWKdumHw",
      "thumbnail": "https://i.ytimg.com/vi/IKkVWKdumHw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This session covers origin management with Amazon CloudFront to build secure, resilient multi-region content delivery systems. Topics include automatic failover with CloudFront and Route53, granular origin routing via CloudFront Functions, origin security using S3 Origin Access Control and VPC private origins, hybrid integration with AWS Direct Connect, and deploying Origin Shield to optimize cache performance and reduce origin load.",
        "bullets": [
          "Automatic failover mechanisms using CloudFront combined with Route53",
          "Granular origin routing implemented with CloudFront Functions",
          "Origin security via S3 Origin Access Control (OAC) and VPC private origins",
          "Hybrid on-premises integration through AWS Direct Connect",
          "Origin Shield to optimize caching and reduce origin load"
        ],
        "takeaways": [
          "Automatic failover improves multi-region resilience and reduces outage impact",
          "Granular routing enables precise traffic steering for performance and locality",
          "S3 OAC and VPC private origins reduce exposure of origin infrastructure",
          "Direct Connect supports hybrid deployments and predictable network paths",
          "Origin Shield lowers origin load and improves cache efficiency"
        ],
        "tags": [
          "CloudFront",
          "Origin Management",
          "Route53",
          "CloudFront Functions",
          "S3 OAC",
          "VPC private origins",
          "AWS Direct Connect",
          "Origin Shield",
          "multi-region",
          "hybrid architectures"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer - Launching January 22!",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield launches worldwide on January 22 and the trailer highlights support for NVIDIA DLSS 4 with Multi Frame Generation. The game is a 3D real-time strategy RPG where you play as the Endministrator of Endfield Industries exploring Talos-II; the footage was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 Multi Frame Generation 4X Mode.",
        "bullets": [
          "Worldwide release date: January 22.",
          "Features NVIDIA DLSS 4 with Multi Frame Generation (MFG) 4X Mode.",
          "Captured on GeForce RTX 5080 at 4K Ultra settings.",
          "3D real-time strategy RPG — player is the Endministrator of Endfield Industries.",
          "Official links provided for game site and social channels."
        ],
        "takeaways": [
          "Showcases DLSS 4 MFG as a notable graphics optimization that could affect GPU workload profiles.",
          "Visual capture using an RTX 5080 at 4K Ultra suggests high-performance GPU requirements for native playback and benchmarking.",
          "Cloud or on-premise gaming/visualization services should consider support for DLSS 4-enabled hardware to deliver comparable user experiences.",
          "Marketing value for upgraded GPU fleets when promoting next-gen game features and high-resolution demos."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "RTX5080",
          "4K",
          "NVIDIA",
          "GeForce",
          "RealTimeStrategy",
          "Gaming"
        ]
      }
    },
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video shows how Rate Insurance boosts agent efficiency using Agentforce and Gemini. It also references the Google Cloud and Salesforce partnership and includes a link for more information.",
        "bullets": [
          "Highlights Rate Insurance improving agent efficiency",
          "Features Agentforce and Gemini as the enabling tools",
          "References Google Cloud and Salesforce partnership",
          "Includes a link to learn more about the partnership",
          "No transcript available"
        ],
        "takeaways": [
          "Presents an insurance use case for cloud/AI tools (Agentforce + Gemini) that may inform evaluations of customer-facing workloads",
          "Calls attention to the Google Cloud–Salesforce partnership, relevant for assessing vendor integration and support",
          "Provides a partnership link that decision-makers can use for procurement or architectural review"
        ],
        "tags": [
          "Rate Insurance",
          "Agentforce",
          "Gemini",
          "Google Cloud",
          "Salesforce",
          "agent efficiency",
          "cloud partnership",
          "insurance tech"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Charly Stoever, 35, is a financial coach who lives rent-free in Portland, Oregon by pet sitting full time. Over the past 18 months she has lived out of two suitcases while earning about $60,000 a year; the story is part of CNBC Make It's Millennial Money series.",
        "bullets": [
          "Charly Stoever, 35, works as a financial coach.",
          "She lives rent-free in Portland, OR by pet sitting full time.",
          "She has spent the last 18 months living out of two suitcases.",
          "Her reported annual income is $60,000.",
          "This profile is part of CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "Shows an example of a low-overhead, mobile lifestyle that can be sustained on a mid-six-figure household income ($60K/year), highlighting alternative cost-saving strategies.",
          "Demonstrates that some workers combine gig-style in-person roles (pet sitting) with professional services (financial coaching) to create flexible income streams.",
          "Implied workforce mobility and minimal housing needs suggest opportunities for flexible, geographically distributed staffing models.",
          "For operations planning, consider that a segment of talent may prioritize remote-friendly or nontraditional work arrangements when designing roles, benefits, and connectivity requirements."
        ],
        "tags": [
          "pet-sitting",
          "rent-free",
          "financial-coach",
          "Portland",
          "minimalism",
          "$60,000",
          "CNBC Make It",
          "Millennial Money",
          "mobile lifestyle",
          "remote work"
        ]
      }
    },
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Dr. Anna Chacon, 39, is a Miami-based dermatologist who runs her own private practice. Her net worth is reported at about $6 million, comprising $3.2 million in investments, a $1.9 million home, and a $1.1 million office building.",
        "bullets": [
          "Age/location: 39, Miami, FL",
          "Profession: dermatologist with a private practice",
          "Total net worth: approximately $6 million",
          "Investments: $3.2 million",
          "Property holdings: $1.9 million home and a $1.1 million office building"
        ],
        "takeaways": [
          "The description contains no information relevant to grid or data center operations, so it offers no direct operational insights.",
          "While financial and real-estate details are provided, there are no energy, infrastructure, or facility specifications to inform power or capacity planning.",
          "Decision-makers seeking facility-related implications would need building energy usage, server/load data, or infrastructure details not present here."
        ],
        "tags": [
          "dermatologist",
          "private practice",
          "Miami",
          "net worth",
          "investments",
          "real estate",
          "office building",
          "personal finance",
          "physician wealth"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this giant bubble of carbon dioxide is presented as a new battery concept that can store 20 megawatts of energy. The description says these batteries are intended to help manage renewable energy fluctuations and support the global shift to clean energy.",
        "bullets": [
          "Giant bubble of carbon dioxide used as an energy storage medium.",
          "Described storage capacity: 20 megawatts.",
          "Framed as a solution for fluctuating renewable energy sources.",
          "Positioned to support the global transition to clean energy.",
          "Presented by IEEE Spectrum (hashtags in description)."
        ],
        "takeaways": [
          "20 MW capacity indicates this targets utility-scale storage—consider for large renewable integration projects.",
          "Aims to address renewable variability, so it could reduce need for fossil-fuel balancing resources.",
          "Data centers should evaluate whether such large-scale storage complements existing backup and resilience strategies.",
          "Request technical details (duration, efficiency, deployment readiness, maintenance) before considering procurement or integration."
        ],
        "tags": [
          "CO2 battery",
          "carbon-dioxide",
          "energy-storage",
          "renewables",
          "grid-resilience",
          "IEEE Spectrum",
          "innovation",
          "battery-technology"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Eksperci KPMG w podcaście omawiają, jak AI już wpływa na obszar cen transferowych — m.in. monitorowanie rentowności, analizy porównawcze i automatyzację dokumentacji — oraz że technologia ta może wzmacniać pracę doradców, a nie ich zastępować. Poruszono też kluczowe wyzwania i wymagania wdrożeniowe: bezpieczeństwo danych, zgodność z RODO, ryzyko „halucynacji”, potrzeba integracji z ERP oraz stosowanie bezpiecznych środowisk (Digital Gateway) i uporządkowanie procesów jako pierwszy krok.",
        "bullets": [
          "AI wspiera monitorowanie rentowności, benchmarki i automatyzację dokumentacji cen transferowych.",
          "Technologia ma charakter wspierający doradców podatkowych, nie zastępujący ich.",
          "Główne ryzyka to bezpieczeństwo danych, zgodność z RODO i zjawisko halucynacji AI.",
          "Rekomendowane kroki wdrożeniowe: uporządkowanie procesów, integracja z ERP i wdrożenie bezpiecznego środowiska (Digital Gateway).",
          "Podcast podsumowuje filary wdrożenia AI i pierwsze praktyczne kroki do startu transformacji."
        ],
        "takeaways": [
          "Zabezpiecz przetwarzanie i przechowywanie danych używanych przez modele AI — to krytyczne dla zgodności z RODO i ograniczenia ryzyk.",
          "Zapewnij integrację AI z istniejącymi systemami ERP, by uzyskać wiarygodne, automatyzowane benchmarki i raporty.",
          "Przygotuj uporządkowane procesy i dane jako fundament — bez porządku wdrożenie AI daje ograniczone korzyści.",
          "Uwzględnij środowiska uruchomieniowe z podwyższonymi zabezpieczeniami (np. Digital Gateway) dla pracy z wrażliwymi danymi.",
          "Planuj wdrożenie jako uzupełnienie kompetencji zespołu (szkolenia, rozwój), nie jako ich zastępstwo."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "podatki",
          "automatyzacja",
          "bezpieczeństwo danych",
          "RODO",
          "ERP",
          "benchmarki",
          "Digital Gateway",
          "monitorowanie rentowności"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This video encourages using Microsoft Copilot to build and maintain momentum by stacking small wins. It frames Copilot as a companion for steady progress across workouts, projects, and personal goals.",
        "bullets": [
          "Focuses on stacking small wins to keep momentum.",
          "Applies to workouts, projects, and personal goals.",
          "Positions Copilot as a companion for steady progress.",
          "Short, motivational message about consistent effort."
        ],
        "takeaways": [
          "For grid/data center decision-makers, the emphasis on small wins highlights the value of tools that help teams sustain momentum on multi-step initiatives.",
          "Using a companion like Copilot can support consistent progress during deployments, upgrades, and operational projects by reinforcing incremental achievements.",
          "Framing work as a series of manageable wins may improve staff engagement and continuity across long-term programs.",
          "Prioritizing tools that encourage steady progress can aid adoption and reduce project fatigue in complex technical environments."
        ],
        "tags": [
          "Microsoft Copilot",
          "productivity",
          "momentum",
          "small-wins",
          "habit-building",
          "workouts",
          "projects",
          "personal-goals",
          "AI-assistant"
        ]
      }
    }
  ]
}