{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-22T19:43:54.327Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… KPMG's podcast episode describes practical zastosowania AI w audycie: narzędzia takie jak AI Transaction Scoring Tool, Clara AI oraz platforma KPMG Clara wspierają analizę pełnych populacji danych, dokumentację i komunikację z klientem. Rozmówczynie omawiają też wpływ tych technologii na rolę audytora, wyzwania wdrożeniowe, bezpieczeństwo danych oraz aspekty regulacyjne.",
        "bullets": [
          "AI wspiera powtarzalne czynności i analizę dużych zbiorów danych, umożliwiając przejście od próbkowania do analizy pełnych populacji.",
          "AI Transaction Scoring Tool realizuje analizę pełnych populacji transakcji.",
          "Clara AI to konwersacyjny asystent i wyspecjalizowani agenci wspomagający pracę audytową.",
          "Platforma KPMG Clara pozwala na zarządzanie badaniem w czasie rzeczywistym, a Clara for Clients usprawnia komunikację z klientem.",
          "W podcaście poruszono także wyzwania: adaptację audytorów, bezpieczeństwo danych, środowisko regulacyjne i potencjalne zagrożenia AI."
        ],
        "takeaways": [
          "Przygotuj pełne, uporządkowane zestawy danych — AI umożliwia audyt całych populacji, co wymaga dostępu do kompletnej i spójnej informacji.",
          "Zadbaj o bezpieczeństwo danych i zgodność z regulacjami — narzędzia AI w audycie zwiększają wagę kwestii ochrony danych i zgodności prawnej.",
          "Oczekuj szybszych i bardziej granularnych wniosków audytowych dzięki platformom działającym w czasie rzeczywistym.",
          "Inwestuj w kompetencje zespołu — zmianę narzędzi towarzyszy potrzeba adaptacji audytorów i współpracy z dostawcami technologii."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMG Clara",
          "Clara AI",
          "AI Transaction Scoring",
          "dane",
          "bezpieczeństwo danych",
          "innowacje",
          "dokumentacja audytu"
        ]
      }
    },
    {
      "id": "t33Fh1JZVgA",
      "title": "AI at Speed: From Investment to Performance",
      "channel": "PwC US",
      "published_at": "2026-01-21T22:48:29.000Z",
      "url": "https://www.youtube.com/watch?v=t33Fh1JZVgA",
      "thumbnail": "https://i.ytimg.com/vi/t33Fh1JZVgA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… PwC US Senior Partner and CEO Paul Griggs speaks with CNBC’s Emma Crosby at the 2026 World Economic Forum in Davos about how organizations are shifting from AI exploration to execution and assessing initiatives through investment discipline, performance, and measurable value. They emphasize moving early, placing capital with intent, and designing operating models that stay resilient without sacrificing performance as AI delivers measurable outcomes today and supports future transformation.",
        "bullets": [
          "Organizations are moving from AI exploration to execution.",
          "AI initiatives are being evaluated through investment discipline, performance, and measurable value.",
          "Leading organizations move early and allocate capital with clear intent.",
          "Operating models are being designed for resilience while maintaining performance.",
          "AI is already delivering measurable outcomes and enabling longer-term transformation."
        ],
        "takeaways": [
          "Insist on measurable ROI and performance metrics before scaling AI investments in data center projects.",
          "Prioritize capital allocation that aligns with clear, intent-driven AI use cases rather than exploratory spending.",
          "Design operating models and infrastructure for resilience without compromising performance SLAs.",
          "Focus on AI outcomes that both deliver near-term value and enable future transformation and scalability."
        ],
        "tags": [
          "AI",
          "investment",
          "performance",
          "operating-models",
          "resilience",
          "measurable-outcomes",
          "Davos2026",
          "PwC",
          "Paul Griggs",
          "CNBC"
        ]
      }
    },
    {
      "id": "6hu7hYLiu08",
      "title": "Get Step-By-Step Fixes with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-21T20:14:00.000Z",
      "url": "https://www.youtube.com/watch?v=6hu7hYLiu08",
      "thumbnail": "https://i.ytimg.com/vi/6hu7hYLiu08/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Copilot offers real-time visual support for home projects and repairs. It can 'see' what you see and provide step-by-step, clear instructions for issues like leaky pipes or overflowing washing machines.",
        "bullets": [
          "Real-time support for home projects and repairs",
          "Visual assistance: Copilot can view the user’s perspective",
          "Delivers step-by-step instructions for troubleshooting",
          "Examples cited: leaky pipes and overflowing washing machines",
          "Emphasis on clear, actionable guidance"
        ],
        "takeaways": [
          "Real-time visual guidance could help technicians diagnose issues faster by sharing live views while receiving step-by-step instructions",
          "Visual, stepwise instructions may allow less-experienced staff to perform guided repairs, potentially reducing specialist dispatches",
          "Clear, standardized guidance can reduce human error during urgent maintenance interventions",
          "Remote visual assistance could complement existing monitoring and remote-support workflows for on-site teams"
        ],
        "tags": [
          "Copilot",
          "real-time support",
          "visual assistance",
          "home repairs",
          "step-by-step",
          "troubleshooting",
          "remote guidance",
          "maintenance",
          "Microsoft Copilot"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield has officially launched and the game supports NVIDIA DLSS 4 with Multi Frame Generation. The title is a 3D real-time strategy RPG where you play the Endministrator exploring Talos-II; the trailer was captured on a GeForce RTX 5080 at 4K Ultra settings with DLSS 4 MFG 4X.",
        "bullets": [
          "Arknights: Endfield launch trailer highlights NVIDIA DLSS 4 with Multi Frame Generation.",
          "Game genre: 3D real-time strategy RPG; role: Endministrator of Endfield Industries on Talos-II.",
          "Trailer capture: GeForce RTX 5080, 4K Ultra Settings, DLSS 4 Multi Frame Generation 4X Mode.",
          "Description includes links to the official game site and NVIDIA DLSS 4 article.",
          "Social and GeForce community links provided for follow-up and updates."
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is being used in launch materials, demonstrating a production use case for advanced upscaling and frame-generation workflows.",
          "The trailer was produced on a GeForce RTX 5080 at 4K Ultra with DLSS4 MFG 4X, indicating such captures rely on high-performance GPUs.",
          "Grid/data center teams should ensure availability of RTX 50-series class hardware and up-to-date NVIDIA driver/DLSS support to reproduce or support similar high-resolution real-time rendering workloads.",
          "Provided links and official resources enable verification and further technical details from NVIDIA and the game developer."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "RTX5080",
          "4K",
          "GeForce",
          "LaunchTrailer",
          "RealTimeStrategy",
          "Gaming",
          "NVIDIA"
        ]
      }
    },
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this Google Cloud video shows how Rate Insurance boosts agent efficiency using Agentforce and Gemini. The description also links to information about the Google Cloud and Salesforce partnership for further details.",
        "bullets": [
          "Video focuses on Rate Insurance improving agent efficiency with Agentforce and Gemini.",
          "Published by Google Cloud.",
          "Description includes a link to the Google Cloud–Salesforce partnership.",
          "No transcript is available in the provided content."
        ],
        "takeaways": [
          "If you evaluate cloud-based tools for operational efficiency, this video could serve as a relevant case example to watch.",
          "The Google Cloud and Salesforce partnership is highlighted—review their joint resources when considering vendor integrations.",
          "Use the provided partnership link to gather more information before technical or procurement discussions.",
          "Because no transcript is provided, watch the video directly to capture technical, operational, or deployment details."
        ],
        "tags": [
          "Rate Insurance",
          "Agentforce",
          "Gemini",
          "Google Cloud",
          "Salesforce partnership",
          "agent efficiency",
          "case study",
          "cloud solutions",
          "customer service",
          "video"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Charly Stoever, 35, is a financial coach who has spent the last 18 months living out of two suitcases and living rent-free in Portland, Oregon by pet sitting full time while earning $60,000 a year. The story is part of CNBC Make It's Millennial Money series.",
        "bullets": [
          "Charly Stoever, 35, financial coach.",
          "Lives rent-free in Portland by pet sitting full time.",
          "Has traveled and lived out of two suitcases for 18 months.",
          "Brings in $60,000 per year from pet sitting.",
          "Segment is part of CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "Mobile, rent-free lifestyles (e.g., full-time pet sitters traveling with two suitcases) can create nontraditional residential occupancy patterns that may affect local electricity demand timing and distribution.",
          "Growth in income from gig or location-independent work (here, $60K via pet sitting) suggests some population segments may be less tied to fixed residences—consider this when forecasting long-term residential load and capacity needs.",
          "Infrastructure and capacity planning should account for demographic and lifestyle trends showcased in consumer media to capture potential shifts in where and when energy and connectivity are needed.",
          "Incorporate lifestyle-driven variability into resilience and demand-response modeling to better handle localized, temporal changes in energy use."
        ],
        "tags": [
          "pet sitting",
          "rent-free",
          "travel",
          "Portland",
          "financial coach",
          "60k",
          "Millennial Money",
          "CNBC Make It",
          "mobile-lifestyle",
          "full-time"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this giant bubble of carbon dioxide acts as a battery that can store 20 megawatts of energy for about 8 hours. The device is presented as a way to manage renewable energy fluctuations and to help power the global shift to clean energy.",
        "bullets": [
          "Stores 20 megawatts of energy.",
          "Provides roughly 8 hours of storage.",
          "Uses a large carbon dioxide 'bubble' as the storage medium.",
          "Aimed at addressing renewable energy intermittency.",
          "Framed as supporting the global transition to clean energy."
        ],
        "takeaways": [
          "Offers a clear capacity/duration metric (20 MW for ~8 hours) to compare against backup and load-shifting requirements.",
          "Explicitly targeted at smoothing renewable energy fluctuations, so it may be relevant when integrating wind/solar resources.",
          "Positioned as a tool for the clean-energy transition—consider including it in long-term decarbonization and capacity planning.",
          "The CO2 bubble approach defines a distinct technology and deployment profile to assess for procurement and site planning."
        ],
        "tags": [
          "ieee",
          "ieeespectrum",
          "tech",
          "innovation",
          "energy-storage",
          "battery",
          "co2",
          "clean-energy",
          "renewable-energy"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the KPMG ON AIR podcast episode explores how AI is changing transfer pricing—from monitoring profitability and benchmarking to automating documentation—and discusses practical implementation steps. Experts Monika Palmowska and Jakub Roszkiewicz cover AI’s role in augmenting, not replacing, advisors, data/security and RODO challenges, secure environments like Digital Gateway, ERP integration, and foundational process work needed for rollout.",
        "bullets": [
          "Praktyczne zastosowania AI: monitorowanie rentowności, inteligentne benchmarki i automatyzacja dokumentacji cen transferowych.",
          "AI jako wsparcie doradców podatkowych — nie zastąpi ludzi, ale wzmocni ich pracę i rozwój młodszych pracowników.",
          "Kluczowe ryzyka i wyzwania: dane, bezpieczeństwo, RODO oraz problem halucynacji modeli.",
          "Digital Gateway wskazany jako bezpieczne środowisko do pracy z AI i integracji z ERP.",
          "Wdrożenie: zacząć od uporządkowania procesów, definiowania person i stopniowej integracji rozwiązań AI."
        ],
        "takeaways": [
          "Bezpieczne środowiska (np. Digital Gateway) i zgodność z RODO wymuszają konkretne wymagania dotyczące infrastruktury i kontroli dostępu.",
          "Integracja AI z ERP i inteligentne benchmarki mogą zwiększyć zapotrzebowanie na przetwarzanie danych i interoperacyjność systemów.",
          "Automatyzacja monitorowania rentowności generuje stałe obciążenie analityczne — planuj zasoby obliczeniowe i transfer danych odpowiednio.",
          "Uporządkowanie procesów biznesowych to konieczny warunek udanej transformacji AI, wpływający na sposób projektowania systemów i operacji centrum danych."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "transfer pricing",
          "podatki",
          "automatyzacja",
          "bezpieczeństwo danych",
          "RODO",
          "ERP",
          "Digital Gateway",
          "monitorowanie rentowności"
        ]
      }
    }
  ]
}