{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-23T08:54:26.350Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI w audycie to już codzienność: narzędzia wspierające zespoły audytowe pomagają w powtarzalnych czynnościach, analizie dużych zbiorów danych i podejmowaniu decyzji. KPMG omawia praktyczne zastosowania (AI Transaction Scoring Tool, Clara AI, platforma KPMG Clara), przejście od próbkowania do analizy pełnych populacji oraz wyzwania związane z wdrożeniem, bezpieczeństwem danych i kompetencjami audytorów.",
        "bullets": [
          "AI Transaction Scoring Tool – analiza pełnych populacji transakcji zamiast próbkowania.",
          "Clara AI – konwersacyjny asystent i wyspecjalizowani agenci wspierający pracę audytową.",
          "Wsparcie AI w dokumentacji i analizie ujawnień oraz zarządzaniu badaniem w czasie rzeczywistym (KPMG Clara).",
          "Clara for Clients – nowoczesna, bardziej bezpośrednia komunikacja z klientem podczas badania.",
          "Omówione wyzwania: adaptacja audytorów, bezpieczeństwo danych, środowisko regulacyjne i potencjalne zagrożenia AI."
        ],
        "takeaways": [
          "Przygotuj pełne, ustrukturyzowane zbiory danych — audyt może analizować całą populację transakcji, nie tylko próbki.",
          "Spodziewaj się bardziej ciągłej i szybszej współpracy dzięki platformom do zarządzania badaniem w czasie rzeczywistym i klient‑portalom.",
          "Zadbaj o bezpieczeństwo danych i zgodność z regulacjami — to kluczowy wymóg przy wykorzystaniu narzędzi AI w audycie.",
          "Poprawa jakości dokumentacji i metadanych ułatwi automatyczną analizę ujawnień i przyspieszy proces audytu.",
          "Szkolenia i przygotowanie zespołów IT/operacyjnych są niezbędne do sprawnej integracji rozwiązań AI w procesie audytowym."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMG Clara",
          "analizadanych",
          "ClaraAI",
          "bezpieczeństwodanych",
          "automatyzacja",
          "próbkowanie",
          "innowacje"
        ]
      }
    },
    {
      "id": "6hu7hYLiu08",
      "title": "Get Step-By-Step Fixes with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-21T20:14:00.000Z",
      "url": "https://www.youtube.com/watch?v=6hu7hYLiu08",
      "thumbnail": "https://i.ytimg.com/vi/6hu7hYLiu08/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Copilot provides real-time visual support for home projects and repairs. It can see what you see and deliver step-by-step instructions with clear guidance for issues ranging from leaky pipes to overflowing washing machines.",
        "bullets": [
          "Real-time visual assistance: Copilot can view the problem as the user sees it.",
          "Step-by-step instructions to guide repairs and projects.",
          "Targets common household issues (examples: leaky pipes, overflowing washing machines).",
          "Aims to provide clear, actionable guidance for non-experts.",
          "Designed for on-the-spot troubleshooting and repair support."
        ],
        "takeaways": [
          "Visual, real-time guidance could be evaluated for remote troubleshooting of facility equipment and infrastructure.",
          "Step-by-step instructions may enable less-specialized staff to perform basic maintenance tasks safely.",
          "On-demand, camera-based support has potential to shorten diagnostic time and reduce need for in-person escalation.",
          "Consider exploring similar capabilities for routine data center or grid facility maintenance workflows to improve response and training."
        ],
        "tags": [
          "Copilot",
          "real-time support",
          "visual assistance",
          "step-by-step",
          "home repairs",
          "troubleshooting",
          "plumbing",
          "washing machine",
          "DIY",
          "Microsoft Copilot"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield has officially launched and the trailer spotlights NVIDIA DLSS 4 with Multi Frame Generation. The game is described as a 3D real-time strategy RPG where you play the Endministrator of Endfield Industries across Talos-II, and the footage was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 MFG 4X Mode.",
        "bullets": [
          "Official launch of Arknights: Endfield; trailer highlights NVIDIA DLSS 4 with Multi Frame Generation.",
          "Game genre: 3D real-time strategy RPG; player role is the Endministrator of Endfield Industries on Talos-II.",
          "Trailer capture specs: GeForce RTX 5080, 4K Ultra settings, DLSS 4 Multi Frame Generation 4X Mode.",
          "Description links to the DLSS 4 article and the official Arknights: Endfield site.",
          "NVIDIA GeForce and Arknights: Endfield social channels and subscription prompts provided."
        ],
        "takeaways": [
          "Trailer demonstrates DLSS 4 Multi Frame Generation applied in consumer-grade capture, with RTX 5080 used for 4K Ultra footage—useful when specifying hardware for real-time rendering or capture tasks.",
          "References to DLSS 4 and MFG 4X Mode indicate a software feature set to consider for performance/quality trade-offs in graphics workloads.",
          "Provided capture specs and links can inform compatibility checks and benchmarking targets for teams evaluating GPUs and drivers for similar 4K real-time workloads."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "NVIDIA",
          "GeForce",
          "RTX5080",
          "4K",
          "Gaming",
          "Launch"
        ]
      }
    },
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video shows how Rate Insurance boosts agent efficiency using Agentforce and Gemini. It references the Google Cloud and Salesforce partnership and includes a link for more information.",
        "bullets": [
          "Case example: Rate Insurance improving agent efficiency.",
          "Highlights two technologies: Agentforce and Gemini.",
          "Connects to the Google Cloud and Salesforce partnership (link provided).",
          "Presented as a short showcase/demo of solution capabilities."
        ],
        "takeaways": [
          "Illustrates enterprise use of Google Cloud and Salesforce integrations for customer-facing workflows.",
          "Suggests AI/CRM workloads (e.g., Gemini + Agentforce) may be relevant when planning capacity and performance.",
          "Reinforces evaluating cloud partnership offerings when assessing infrastructure needs and vendor strategy."
        ],
        "tags": [
          "Google Cloud",
          "Salesforce",
          "Agentforce",
          "Gemini",
          "Rate Insurance",
          "agent efficiency",
          "cloud partnership",
          "AI",
          "CRM",
          "case study"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Charly Stoever, a 35-year-old financial coach, lives rent-free in Portland, Oregon, by pet sitting full time. The profile says she has spent the last 18 months living out of two suitcases while earning about $60,000 a year; the piece is part of CNBC Make It's Millennial Money series.",
        "bullets": [
          "Charly Stoever, 35, is a financial coach.",
          "She lives rent-free in Portland, Oregon by pet sitting full time.",
          "Has lived out of two suitcases for the past 18 months.",
          "Earns about $60,000 per year from this lifestyle.",
          "Story produced for CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "The description contains no information about energy consumption, device connectivity, or data-center-related metrics, so no direct infrastructure implications can be drawn.",
          "For grid or data-center planning, this profile highlights a mobile, nontraditional-living demographic but provides no quantitative usage data.",
          "Decision-makers should gather device usage, connectivity, and location mobility data before considering any changes to capacity or service models.",
          "Use this piece as consumer-behavior context only; the content focuses on personal finance and lifestyle rather than technical or infrastructure details."
        ],
        "tags": [
          "Charly Stoever",
          "pet sitting",
          "rent-free",
          "Portland",
          "financial coach",
          "mobile living",
          "two suitcases",
          "60k",
          "CNBC Make It",
          "Millennial Money"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video describes a giant bubble of carbon dioxide that can store 20 megawatts of energy. It says these new batteries can help manage fluctuating renewable generation and power a global shift to clean energy.",
        "bullets": [
          "Uses a giant bubble of carbon dioxide as the storage medium.",
          "Stores 20 megawatts of energy.",
          "Framed as a solution for fluctuating renewable resources.",
          "Positioned to support the global transition to clean energy.",
          "Presented in a tech/innovation context (hashtags reference IEEE, tech, energy, battery)."
        ],
        "takeaways": [
          "Note the stated 20 MW storage scale—consider whether that nominal capacity aligns with grid segments or data-center backup needs.",
          "The solution is presented as targeting renewable variability—potential relevance for integrating intermittent generation.",
          "Framed as enabling a global clean-energy shift—factor potential strategic implications for long-term energy sourcing and resilience."
        ],
        "tags": [
          "carbon-dioxide",
          "co2",
          "20mw",
          "energy-storage",
          "renewables",
          "grid",
          "battery",
          "innovation",
          "ieee",
          "tech"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… W podcaście eksperci KPMG omawiają, jak AI już dziś zmienia podejście do cen transferowych — od monitorowania rentowności, przez automatyzację dokumentacji, po integrację z systemami ERP. Poruszane są też ryzyka związane z danymi i bezpieczeństwem, potrzeba uporządkowania procesów oraz rola bezpiecznych środowisk pracy z AI.",
        "bullets": [
          "AI wspiera monitorowanie rentowności, analizy porównawcze i automatyzację dokumentacji cen transferowych.",
          "Eksperci podkreślają, że AI wzmacnia pracę doradców podatkowych, ale ich nie zastąpi.",
          "Omówione są ryzyka: ochrona danych, bezpieczeństwo i zjawisko halucynacji AI.",
          "Digital Gateway przedstawiony jako bezpieczne środowisko do pracy z AI.",
          "Wdrożenie AI wymaga integracji z ERP i uporządkowania procesów jako fundamentu transformacji."
        ],
        "takeaways": [
          "Zadbaj o bezpieczne, kontrolowane środowisko do pracy z AI (np. rozwiązania typu Digital Gateway) z powodu wymagań dotyczących danych i bezpieczeństwa.",
          "Planuj integrację AI z istniejącymi systemami ERP, by uzyskać inteligentne benchmarki i automatyczne raporty finansowe.",
          "Uporządkowanie procesów i danych jest konieczne przed wdrożeniem AI, aby uniknąć błędów i ograniczyć ryzyko halucynacji modelu."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "transfer pricing",
          "podatki",
          "automatyzacja",
          "bezpieczeństwo danych",
          "ERP",
          "Digital Gateway",
          "benchmarki",
          "dokumentacja"
        ]
      }
    }
  ]
}