{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-22T13:20:50.689Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "IKkVWKdumHw",
      "title": "re:Invent 2025 - Chalk Talk - Origin management for multi-region applications with Amazon CloudFront",
      "channel": "AWS Events",
      "published_at": "2026-01-22T08:10:48.000Z",
      "url": "https://www.youtube.com/watch?v=IKkVWKdumHw",
      "thumbnail": "https://i.ytimg.com/vi/IKkVWKdumHw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This session covers origin management with Amazon CloudFront to build secure, resilient multi-region content delivery systems. Topics include automatic failover with CloudFront and Route 53, granular origin routing via CloudFront Functions, origin security using S3 Origin Access Control and VPC private origins, hybrid integration with AWS Direct Connect, and using Origin Shield to optimize cache performance and reduce origin load.",
        "bullets": [
          "Automatic failover configured with CloudFront and Route 53",
          "Granular origin routing using CloudFront Functions",
          "Secure origins via S3 Origin Access Control (OAC) and VPC private origins",
          "Hybrid connectivity through AWS Direct Connect",
          "Origin Shield to improve caching and lower origin load"
        ],
        "takeaways": [
          "Automatic failover improves resiliency and reduces downtime risk for multi-region content delivery",
          "Granular routing gives control to route users to optimal origins for performance and capacity management",
          "S3 OAC and VPC private origins enhance origin security and limit direct exposure",
          "Origin Shield and CloudFront caching can lower origin load and associated infrastructure/network strain",
          "AWS Direct Connect enables predictable, secure hybrid integration with on‑premises infrastructure"
        ],
        "tags": [
          "Amazon CloudFront",
          "Origin Management",
          "Route 53",
          "CloudFront Functions",
          "Origin Shield",
          "S3 OAC",
          "VPC Private Origins",
          "AWS Direct Connect",
          "Multi-region",
          "Hybrid Architecture"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The podcast discusses how AI is already integrated into modern audit practice, showcasing tools like AI Transaction Scoring, Clara AI conversational assistants and the KPMG Clara platform to enable full-population analysis and real-time audit management. It also covers benefits for clients, changing auditor competencies, data security and regulatory challenges, potential AI-related risks, and the future outlook of AI in audit.",
        "bullets": [
          "AI tools (Transaction Scoring, Clara AI, specialized agents) support repetitive tasks and analysis of large datasets.",
          "KPMG Clara platform enables real-time management of the audit and Clara for Clients improves client communication.",
          "Shift from sampling to full-population analysis increases audit coverage and insight.",
          "Adoption requires new auditor competencies and raises data security and regulatory considerations.",
          "Discussion includes potential risks of AI in audit and perspectives on future developments."
        ],
        "takeaways": [
          "Ensure data is accessible, complete and well-structured to support full-population AI-driven audits.",
          "Prioritize robust data security, logging and compliance controls to meet audit and regulatory expectations.",
          "Provide APIs and integration capabilities so audit platforms (e.g., KPMG Clara) can ingest necessary datasets.",
          "Invest in staff skills for data management and basic AI literacy to facilitate collaboration with auditors.",
          "Maintain clear data retention, provenance and metadata practices to simplify AI-based audit work."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMG",
          "KPMG Clara",
          "Clara AI",
          "transaction scoring",
          "data security",
          "regulatory compliance",
          "audit innovation"
        ]
      }
    },
    {
      "id": "t33Fh1JZVgA",
      "title": "AI at Speed: From Investment to Performance",
      "channel": "PwC US",
      "published_at": "2026-01-21T22:48:29.000Z",
      "url": "https://www.youtube.com/watch?v=t33Fh1JZVgA",
      "thumbnail": "https://i.ytimg.com/vi/t33Fh1JZVgA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… PwC US Senior Partner and CEO Paul Griggs and CNBC’s Emma Crosby discuss at Davos how organizations are moving from exploration to execution by evaluating AI through investment discipline, performance, and measurable value. They emphasize moving early, placing capital with intent, and designing operating models that stay resilient without sacrificing performance as AI delivers measurable outcomes and supports transformation.",
        "bullets": [
          "Focus shifts from experimentation to execution, with AI judged by investment discipline and measurable value.",
          "Leaders are moving early and allocating capital intentionally to AI initiatives.",
          "Operating models are being redesigned to preserve resilience while maintaining performance.",
          "AI is already delivering measurable outcomes that help organizations transform.",
          "Conversation originates from the 2026 World Economic Forum in Davos (PwC and CNBC discussion)."
        ],
        "takeaways": [
          "Prioritize AI investments with clear performance metrics to justify capital allocation.",
          "Move early on high-impact AI use cases to capture value rather than delaying for certainty.",
          "Design operations to be resilient but not overly conservative—maintain performance SLAs while integrating AI.",
          "Track measurable outcomes from AI pilots to scale interventions that improve efficiency and capacity planning."
        ],
        "tags": [
          "AI",
          "investment",
          "performance",
          "operating models",
          "resilience",
          "measurable outcomes",
          "Davos2026",
          "PwC",
          "enterprise AI"
        ]
      }
    },
    {
      "id": "6hu7hYLiu08",
      "title": "Get Step-By-Step Fixes with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-21T20:14:00.000Z",
      "url": "https://www.youtube.com/watch?v=6hu7hYLiu08",
      "thumbnail": "https://i.ytimg.com/vi/6hu7hYLiu08/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Copilot provides real-time support for home projects and repairs by visually analyzing what you see and delivering step-by-step instructions. The tool is described as offering clear, actionable guidance for issues such as leaky pipes and overflowing washing machines.",
        "bullets": [
          "Real-time support for home projects and repairs.",
          "Copilot can 'see what you see' to gain visual context.",
          "Delivers step-by-step instructions for hands-on fixes.",
          "Examples in the description: leaky pipes and overflowing washing machines.",
          "Emphasis on clear, actionable guidance for users."
        ],
        "takeaways": [
          "The described real-time, visual, step-by-step guidance is a capability to evaluate for on-site maintenance workflows.",
          "‘See what you see’ functionality implies the need to assess device integration, secure visual telemetry, and bandwidth requirements for field use.",
          "Clear procedural instructions could support standardizing repairs and aligning with training and documentation practices.",
          "Because the description focuses on consumer repairs, determine what adaptations would be required for industrial or data center equipment and procedures."
        ],
        "tags": [
          "Copilot",
          "real-time support",
          "visual troubleshooting",
          "step-by-step instructions",
          "home repairs",
          "plumbing",
          "appliance repair",
          "remote assistance",
          "AI assistant",
          "guidance"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer - Launching January 22!",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield launches worldwide on January 22 and features NVIDIA DLSS 4 with Multi Frame Generation. The game is a 3D real-time strategy RPG where you play the Endministrator of Endfield Industries on Talos-II; the trailer was captured on a GeForce RTX 5080 at 4K Ultra Settings using DLSS 4 Multi Frame Generation 4X Mode.",
        "bullets": [
          "Worldwide release date: January 22.",
          "Launch trailer highlights NVIDIA DLSS 4 with Multi Frame Generation (link provided).",
          "Game genre/premise: 3D real-time strategy RPG; player is the Endministrator of Endfield Industries on Talos-II.",
          "Trailer capture specifics: GeForce RTX 5080, 4K Ultra Settings, DLSS 4 MFG 4X Mode.",
          "Official links included for the game website and multiple social channels (NVIDIA GeForce and Arknights: Endfield)."
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is part of the launch messaging — DLSS 4 support is a featured technical capability in this release.",
          "Trailer captured on a GeForce RTX 5080 at 4K Ultra indicates demonstration targeting high-end GPU hardware.",
          "January 22 launch date is specified — coordinate any release-day capacity or delivery plans accordingly.",
          "Official NVIDIA and game channels/website are provided for further technical or compatibility details."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "RTX5080",
          "GeForce",
          "4K",
          "NVIDIA",
          "RTS",
          "GamingTrailer"
        ]
      }
    },
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video showcases how Rate Insurance boosts agent efficiency using Agentforce and Gemini. It also points viewers to the Google Cloud and Salesforce partnership via a provided link.",
        "bullets": [
          "Customer spotlight: Rate Insurance improving agent efficiency",
          "Technologies featured: Agentforce and Gemini",
          "Video published by Google Cloud",
          "References Google Cloud–Salesforce partnership (link included)",
          "No transcript available"
        ],
        "takeaways": [
          "Provides a cloud/AI customer use case (Rate Insurance) leveraging Agentforce and Gemini—useful context when evaluating similar integrations",
          "Highlights an active Google Cloud and Salesforce partnership—factor partnerships into platform and vendor assessments",
          "Includes a link to partnership details for further technical or commercial review"
        ],
        "tags": [
          "Rate Insurance",
          "Agentforce",
          "Gemini",
          "Google Cloud",
          "Salesforce",
          "agent efficiency",
          "partnership",
          "cloud",
          "AI",
          "customer case"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Charly Stoever, 35, is a financial coach who has spent the last 18 months living out of two suitcases while pet sitting full time to live rent-free in Portland, Oregon. She brings in about $60,000 a year, and her story is profiled as part of CNBC Make It's Millennial Money series.",
        "bullets": [
          "Charly Stoever, 35, is a financial coach.",
          "Lives rent-free in Portland, Oregon by pet sitting full time.",
          "Has lived out of two suitcases for the past 18 months.",
          "Earns roughly $60,000 per year from this lifestyle.",
          "Profiled in CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "Shows that individuals can sustain a substantial income ($60K/yr) through nontraditional, mobile work—expect users who are location-independent and require reliable connectivity.",
          "An 18-month, highly mobile lifestyle implies prolonged reliance on lightweight devices and continuous remote access—data and service availability should be prioritized for distributed users.",
          "Mainstream coverage of gig-based, nomadic incomes suggests growing visibility and potential scale of such user segments—plan for scalable, secure backend services that support platform-driven, mobile work patterns."
        ],
        "tags": [
          "Charly Stoever",
          "pet sitting",
          "rent-free",
          "Portland",
          "financial coach",
          "mobile lifestyle",
          "Millennial Money",
          "CNBC Make It",
          "side hustle",
          "travel"
        ]
      }
    },
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Dr. Anna Chacon, 39, is a Miami-based dermatologist who runs a private practice and reportedly earns $900,000 a year. Her net worth is about $6 million, made up of $3.2 million in investments, a $1.9 million home and a $1.1 million office building.",
        "bullets": [
          "Dr. Anna Chacon, age 39, dermatologist in Miami, FL.",
          "Runs her own private practice.",
          "Reported annual earnings: $900,000.",
          "Estimated net worth: approximately $6 million.",
          "Net worth breakdown: $3.2M investments, $1.9M home, $1.1M office building."
        ],
        "takeaways": [
          "Owned office building ($1.1M) indicates medical practices can represent small-scale commercial real estate holdings.",
          "Reported high annual income ($900K) provides a datapoint on individual/practice financial capacity.",
          "Asset allocation (investments, primary residence, commercial property) offers a concrete example for customer segmentation.",
          "Location in Miami, FL is a regional datapoint for market or capacity planning."
        ],
        "tags": [
          "dermatologist",
          "private practice",
          "net worth",
          "investments",
          "real estate",
          "office building",
          "Miami",
          "high income",
          "CNBC Make It",
          "2026"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video describes a giant bubble of carbon dioxide that can store 20 megawatts of energy and provides about 8 hours of storage. The technology is presented as a way to smooth renewable energy fluctuations and help power the global shift to clean energy.",
        "bullets": [
          "Giant carbon-dioxide bubble acts as a battery storing 20 megawatts.",
          "Provides approximately 8 hours of energy storage (per the video title).",
          "Aimed at smoothing fluctuations from renewable energy sources.",
          "Framed as a tool to support the global transition to clean energy.",
          "Covered by IEEE Spectrum (tags emphasize tech and innovation)."
        ],
        "takeaways": [
          "20 MW and ~8 hours of storage are the core technical claims to consider for capacity planning.",
          "Positioned to address renewable variability, so it may be relevant for grid balancing strategies.",
          "Presented as a clean-energy support technology, making it of interest for long-term infrastructure and resilience planning."
        ],
        "tags": [
          "ieee",
          "tech",
          "ieeespectrum",
          "innovation",
          "future",
          "futuristic",
          "energy",
          "battery",
          "carbon-dioxide",
          "storage"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The podcast discusses how AI is already reshaping transfer pricing—monitoring rentability, comparative analyses and automating documentation—presented by KPMG transfer pricing experts Monika Palmowska and Jakub Roszkiewicz. They address practical deployment topics such as personas, ERP integration, data/security risks, GDPR and hallucinations, a secure Digital Gateway environment, staff development, and the initial steps and pillars for implementing AI.",
        "bullets": [
          "AI applications covered: monitoring profitability, intelligent benchmarks and automation of transfer-pricing documentation.",
          "AI is positioned as a tool to strengthen advisors’ work rather than replace them.",
          "Key risks discussed include data security, GDPR compliance and model hallucinations.",
          "Digital Gateway highlighted as a secure environment for working with AI.",
          "Implementation advice: start by ordering processes, define personas, integrate with ERP and plan staff upskilling."
        ],
        "takeaways": [
          "Ensure secure, compliant environments (like Digital Gateway) for processing sensitive tax and transfer-pricing data.",
          "Prioritise GDPR and data-security controls when enabling AI workflows.",
          "Prepare infrastructure to support ERP integration and AI-driven benchmarking/monitoring.",
          "Focus on process standardisation and staff competence development before large-scale AI rollouts."
        ],
        "tags": [
          "AI",
          "cenytransferowe",
          "transferpricing",
          "podatki",
          "automatyzacja",
          "RODO",
          "DigitalGateway",
          "ERP",
          "bezpieczeństwo"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Copilot helps you build and maintain momentum by stacking small wins across workouts, projects, and personal goals. The video encourages using Copilot to keep progress consistent and forward-moving.",
        "bullets": [
          "Promotes stacking small wins to sustain momentum.",
          "Applies across workouts, projects, and personal goals.",
          "Frames Copilot as a tool to keep progress going.",
          "Focuses on consistency and incremental progress."
        ],
        "takeaways": [
          "Encourage breaking large operational objectives into small, achievable steps to maintain momentum in grid/data center initiatives.",
          "Use Copilot to help teams sustain steady progress on ongoing projects and tasks.",
          "Prioritize consistent, repeatable actions to improve follow-through on strategic goals.",
          "Treat incremental wins as measurable milestones to keep staff engaged and projects moving forward."
        ],
        "tags": [
          "copilot",
          "momentum",
          "productivity",
          "small-wins",
          "workouts",
          "projects",
          "personal-goals",
          "microsoft-copilot",
          "consistency"
        ]
      }
    }
  ]
}