{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-28T14:56:55.371Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "gv6zK265OUE",
      "title": "Build your first GraphRAG Powered Agent! (No Graph Expert Required) | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-27T20:55:49.000Z",
      "url": "https://www.youtube.com/watch?v=gv6zK265OUE",
      "thumbnail": "https://i.ytimg.com/vi/gv6zK265OUE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this session demonstrates how to build a knowledge graph (GraphRAG) from existing docs, PDFs, and wikis to make AI models smarter. It includes a live demo using real documents and familiar AI tools, emphasizing that the build can be done in an afternoon rather than a six-month project.",
        "bullets": [
          "Existing knowledge in docs, PDFs, and wikis is often trapped and underused.",
          "Knowledge graphs are presented as the solution to unlock that knowledge.",
          "Many teams avoid building graphs because they seem complex or time-consuming.",
          "The talk shows a practical, afternoon-long approach using the AI tools teams already use.",
          "Includes a live demo with real documents—no long, six-month project required."
        ],
        "takeaways": [
          "Faster deployment: converting documentation to a knowledge graph can be done in an afternoon, reducing project timelines.",
          "Lower barrier to adoption: uses existing AI tools, minimizing the need for new expertise or major platform changes.",
          "Cost and resource efficiency: shorter projects imply less upfront investment compared with lengthy initiatives.",
          "Practical validation: a live demo with real documents suggests a repeatable approach for operational teams."
        ],
        "tags": [
          "knowledge-graph",
          "GraphRAG",
          "RAG",
          "AI",
          "databases-for-AI",
          "documents",
          "live-demo",
          "AWS-Events"
        ]
      }
    },
    {
      "id": "yUpQ9pWA9WE",
      "title": "Watch Live: Fed Chair Jerome Powell Holds News Conference | WSJ",
      "channel": "WSJ News",
      "published_at": "2026-01-27T20:49:24.000Z",
      "url": "https://www.youtube.com/watch?v=yUpQ9pWA9WE",
      "thumbnail": "https://i.ytimg.com/vi/yUpQ9pWA9WE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Federal Reserve Chair Jerome Powell speaks to reporters following the Federal Reserve's two-day policy-setting meeting. WSJ News is streaming his live news conference.",
        "bullets": [
          "Live news conference with Fed Chair Jerome Powell.",
          "Follows a two-day Federal Reserve policy-setting meeting.",
          "Streamed by WSJ News.",
          "No transcript is available in the provided content.",
          "Description includes hashtags #JeromePowell, #Fed, #WSJ."
        ],
        "takeaways": [
          "Watch the conference for guidance from the Fed meeting that could influence financing conditions and market expectations.",
          "Be prepared to reassess timing for capital projects and financing plans if Fed commentary shifts market dynamics.",
          "Monitor Powell's remarks for signals about the economic outlook that could affect demand planning for grid and data center capacity.",
          "Have an internal summary ready for stakeholders to translate any Fed guidance into budgetary and procurement adjustments."
        ],
        "tags": [
          "JeromePowell",
          "Fed",
          "FederalReserve",
          "WSJ",
          "news",
          "live",
          "pressconference",
          "policy",
          "economy",
          "monetarypolicy"
        ]
      }
    },
    {
      "id": "MuQmKCWjSYI",
      "title": "Deutsche Bank accelerates Cloud journeys with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-27T17:39:29.000Z",
      "url": "https://www.youtube.com/watch?v=MuQmKCWjSYI",
      "thumbnail": "https://i.ytimg.com/vi/MuQmKCWjSYI/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Google Cloud Consulting designed novel learning experiences that helped thousands of Deutsche Bank engineers become fluent in cloud engineering. They used Generative AI to create personalized, interactive training that blends on‑demand convenience with instructor‑led effectiveness, and the Google Cloud Consulting Learning Services team supplied the creative innovation and technical expertise to build the Deutsche Bank Cloud Engineering Program and accelerate their cloud journey.",
        "bullets": [
          "Designed novel learning experiences for thousands of engineers.",
          "Used Generative AI to create personalized, interactive training.",
          "Training combines on‑demand convenience with instructor‑led effectiveness.",
          "Built the Deutsche Bank Cloud Engineering Program.",
          "Google Cloud Consulting Learning Services provided creative and technical expertise."
        ],
        "takeaways": [
          "Investing in scalable training can raise cloud engineering fluency across large teams.",
          "Generative AI enables personalized, interactive learning that complements traditional instruction.",
          "A hybrid on‑demand plus instructor‑led model can improve training effectiveness.",
          "Partnering with specialized consulting teams can provide the creativity and expertise to accelerate cloud adoption."
        ],
        "tags": [
          "Google Cloud",
          "Google Cloud Consulting",
          "Deutsche Bank",
          "Cloud Engineering",
          "Generative AI",
          "Learning Services",
          "Training",
          "Cloud Adoption",
          "Personalized Learning",
          "Cloud Journey"
        ]
      }
    },
    {
      "id": "5CyVBSbHmbA",
      "title": "Year-end toolkit: Strengthening audit committee collaboration",
      "channel": "PwC US",
      "published_at": "2026-01-27T17:20:31.000Z",
      "url": "https://www.youtube.com/watch?v=5CyVBSbHmbA",
      "thumbnail": "https://i.ytimg.com/vi/5CyVBSbHmbA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this PwC year-end toolkit episode focuses on strengthening collaboration between finance management and the audit committee during the year-end accounting and reporting process. It addresses improving communication and reporting, and covers emerging oversight areas including AI, enterprise risk management, cyber risk in the age of AI, and proxy disclosures.",
        "bullets": [
          "Strengthening management/audit committee communication and collaboration",
          "Key year‑end accounting and reporting issues finance teams should be prepared to address",
          "Oversight of AI: risks, opportunities, and controls",
          "Enhancing enterprise risk oversight and navigating cyber risk in the age of AI",
          "Elevating proxy disclosures"
        ],
        "takeaways": [
          "Engage the audit committee early and clearly on year‑end reporting matters, especially where operational changes affect financials",
          "Be prepared to explain AI initiatives to governance: expected benefits, risks, and controls to support oversight",
          "Elevate enterprise and cyber risk considerations (including AI‑related threats) to the audit committee for board‑level risk prioritization",
          "Ensure transformation initiatives and their accounting/reporting implications are reflected in year‑end disclosures and proxy materials"
        ],
        "tags": [
          "audit committee",
          "year-end reporting",
          "financial reporting",
          "AI oversight",
          "enterprise risk",
          "cyber risk",
          "proxy disclosures",
          "finance governance",
          "PwC",
          "audit"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video follows Jo discovering how Copilot Groups can make route planning easy. It highlights Microsoft Copilot and uses tags #copilot #microsoftcopilot #ai.",
        "bullets": [
          "Route planning made easy (per description).",
          "Jo discovers the power of Copilot Groups.",
          "Highlights Microsoft Copilot and AI via hashtags.",
          "No transcript or further details provided in the description."
        ],
        "takeaways": [
          "The description positions Copilot Groups as a route-planning aid—watch the video to judge relevance for your operations.",
          "The description contains no technical or integration details—seek additional information before making decisions.",
          "If route or field logistics are part of your operations, consider evaluating Copilot Groups' fit after reviewing full content.",
          "Use the video as a starting point to ask vendors or internal teams for specifics on capabilities, data requirements, and security."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "route-planning",
          "copilot-groups",
          "Jo"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This KPMG ON AIR episode features Katarzyna Chojniak and Alicja Barska explaining practical applications of AI in audit, including tools such as AI Transaction Scoring, Clara AI conversational assistants, and the KPMG Clara platform. They discuss benefits for clients, the move from sampling to full-population analysis, changing auditor competencies, implementation challenges, data security and regulatory concerns, and future prospects of AI in audit.",
        "bullets": [
          "AI tools assist auditors with repetitive tasks, large-data analysis and decision support.",
          "AI Transaction Scoring enables analysis of full populations instead of sampling.",
          "Clara AI provides conversational assistance and specialized agents; KPMG Clara manages audits in real time and supports client communication.",
          "Adoption changes auditors’ roles and demands new competencies and adaptation.",
          "Implementation raises challenges around data security, regulatory environment and potential AI-related risks."
        ],
        "takeaways": [
          "Expect higher infrastructure demands to support full-population analytics (storage, processing, availability).",
          "Prioritize robust data security, access controls and compliance features to meet regulatory expectations referenced in the discussion.",
          "Ensure integration capabilities with audit platforms (e.g., real-time management and client communication) for smoother workflows.",
          "Plan for training and talent development to support new AI-driven auditor roles and tool adoption.",
          "Incorporate risk controls and monitoring for AI tools to address the potential threats and governance issues highlighted."
        ],
        "tags": [
          "audit",
          "AI",
          "KPMG",
          "KPMG Clara",
          "Clara AI",
          "transaction-scoring",
          "data-security",
          "regulation",
          "auditor-skills"
        ]
      }
    }
  ]
}