{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-29T19:12:40.554Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "oQtkaHzUYlY",
      "title": "Copilot helps Christa find her inner star 🌟",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-29T18:33:49.000Z",
      "url": "https://www.youtube.com/watch?v=oQtkaHzUYlY",
      "thumbnail": "https://i.ytimg.com/vi/oQtkaHzUYlY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The sky is full of stars, and Copilot helps Christa find the star within. Viewers are invited to download and try Copilot via the link in the bio.",
        "bullets": [
          "No transcript available.",
          "Visual/metaphorical message: Copilot helps Christa 'find the star within.'",
          "Setting emphasizes a starry sky and personal inspiration.",
          "Clear call to action: download & try Copilot (link in bio).",
          "Short promotional format from Microsoft Copilot channel."
        ],
        "takeaways": [
          "Messaging centers on personal empowerment—consider how Copilot-style tools might be positioned for employee engagement rather than just technical features.",
          "Simple, emotive campaigns with a clear CTA can drive trials; apply similar approaches when promoting new internal tools or pilots.",
          "Creative storytelling can help non-technical stakeholders relate to AI offerings—use human-centered messaging for adoption efforts.",
          "Because the video provides no technical detail, decision-makers should request demos, specs, and compliance information to assess operational fit for grid/data-center contexts."
        ],
        "tags": [
          "Microsoft Copilot",
          "Copilot",
          "Christa",
          "stars",
          "inspiration",
          "download",
          "AI",
          "promo",
          "video"
        ]
      }
    },
    {
      "id": "2GZM7wOHFcg",
      "title": "Follow the carbon, find the money: Turning sustainability into financial value",
      "channel": "PwC US",
      "published_at": "2026-01-29T18:04:28.000Z",
      "url": "https://www.youtube.com/watch?v=2GZM7wOHFcg",
      "thumbnail": "https://i.ytimg.com/vi/2GZM7wOHFcg/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Rich Goode of PwC US explains that sustainability gains traction when carbon reduction is framed in financial terms that business leaders understand. Translating emissions outcomes into cost savings and business value helps move sustainability from ambition to action and drives alignment, investment, and results.",
        "bullets": [
          "Link carbon reduction to financial impact to engage leadership.",
          "A ton of carbon is abstract; dollars and cost savings are tangible.",
          "Translating emissions outcomes into business value accelerates action.",
          "Understand carbon accounting fundamentals to communicate effectively.",
          "Business-framed sustainability drives alignment, investment, and results."
        ],
        "takeaways": [
          "Ensure robust carbon accounting so emissions can be quantified in financial terms.",
          "Translate emissions reductions into cost savings and business value to justify investments in grid or data center upgrades.",
          "Communicate sustainability outcomes in business language to secure leadership buy-in and budget.",
          "Use financially framed emissions metrics to move from strategic ambition to operational decisions and results."
        ],
        "tags": [
          "sustainability",
          "carbon-accounting",
          "financial-impact",
          "cost-savings",
          "business-communication",
          "ESG",
          "strategy",
          "PwC",
          "operational-resilience",
          "leadership"
        ]
      }
    },
    {
      "id": "BYtYm-xyKR8",
      "title": "Bringing In $251K A Year With 3 Jobs In The Bay Area",
      "channel": "CNBC Make It",
      "published_at": "2026-01-29T17:47:46.000Z",
      "url": "https://www.youtube.com/watch?v=BYtYm-xyKR8",
      "thumbnail": "https://i.ytimg.com/vi/BYtYm-xyKR8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description…Naseema McElroy, 44, is a labor and delivery nurse in Brentwood, California who brings in $251K a year across three jobs and runs a personal finance brand. After accumulating nearly $1 million in debt in 2015, she launched Financially Intentional to document her debt-payoff journey and became debt-free by 2017.",
        "bullets": [
          "Earns $251,000 per year through three jobs in the Bay Area.",
          "Works as a labor and delivery nurse and operates a personal finance brand.",
          "Accumulated nearly $1 million in debt in 2015; paid it off by 2017.",
          "Started Financially Intentional to chronicle her debt-payoff process.",
          "This video is part of CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "Employees may combine multiple roles and side businesses—consider workforce policies that support scheduling flexibility.",
          "Financial stress and recovery (large debt then debt-free) highlight potential value of employee financial-wellness resources.",
          "Staff pursuing outside ventures may prioritize predictable hours and benefits that enable secondary income efforts."
        ],
        "tags": [
          "CNBC",
          "CNBCMakeIt",
          "MillennialMoney",
          "personal finance",
          "debt payoff",
          "Financially Intentional",
          "nurse",
          "Bay Area",
          "side hustle",
          "earnings"
        ]
      }
    },
    {
      "id": "t6y2cVNjCAw",
      "title": "GeForce Garage - Summer of RTX Community Build",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-29T14:01:25.000Z",
      "url": "https://www.youtube.com/watch?v=t6y2cVNjCAw",
      "thumbnail": "https://i.ytimg.com/vi/t6y2cVNjCAw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… NVIDIA's GeForce Garage showcases the winner of the Summer of RTX r/buildapc Community Build, u/JeffersonPutnam, who assembled a small-form-factor GeForce RTX 5090 system. The description provides the full winning spec list, a PCPartPicker link, the GeForce host (Dwight), and social/channel links.",
        "bullets": [
          "Contest winner: u/JeffersonPutnam built an SFF GeForce RTX 5090 rig.",
          "Host: GeForce host Dwight (Twitter: @_MightyPotato).",
          "Winning system highlights: Fractal Design Era 2 chassis, GeForce RTX 5090 Founders Edition, MSI MPG B850I Edge, Ryzen 7 9800X3D, 32GB DDR5-6000, Corsair SF1000, Corsair Nautilus 240 RS.",
          "Full parts list available via PCPartPicker (link provided in description).",
          "Video and channel social links and hashtags included (#GeForceGarage, #RTXOn, #GeForceRTX50)."
        ],
        "takeaways": [
          "The build highlights community interest in the GeForce RTX 5090 within small-form-factor consumer systems—relevant when tracking demand signals for procurement.",
          "A compact chassis (Fractal Era 2) paired with high-end GPU and components suggests attention to power and cooling trade-offs in tight enclosures (note listed Corsair SF1000 and Nautilus 240 RS).",
          "The platform uses modern components (MSI B850I, Ryzen 7 9800X3D, DDR5-6000), indicating current-generation compatibility considerations for system integration.",
          "The PCPartPicker link gives a complete bill of materials useful for cost estimation and component sourcing."
        ],
        "tags": [
          "GeForceGarage",
          "RTX5090",
          "GeForceRTX50",
          "r/buildapc",
          "SFF",
          "PCBuild",
          "NVIDIA",
          "Ryzen9800X3D"
        ]
      }
    },
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy GenAI solutions that unlocked new revenue streams and streamlined operations. Sreeni Alakappan highlights how Google Cloud's infrastructure boosted developer productivity and compressed TTEC's digital transformation timeline, expanding what the company can pursue.",
        "bullets": [
          "TTEC collaborated with Google Cloud Consulting to accelerate AI prototyping and deployment",
          "GenAI and Google Cloud infrastructure were used to streamline operations",
          "Efforts boosted developer productivity according to TTEC leadership",
          "The partnership enabled new revenue streams for TTEC",
          "Google Cloud Consulting helped compress the digital transformation timeline"
        ],
        "takeaways": [
          "Cloud consulting can speed AI prototyping and deployment—important for staying competitive",
          "Robust cloud infrastructure can materially improve developer productivity and time-to-market",
          "GenAI initiatives can create entirely new revenue opportunities, not just efficiency gains",
          "Engaging cloud consulting firms can compress transformation timelines and broaden strategic ambitions"
        ],
        "tags": [
          "TTEC",
          "Google Cloud",
          "GenAI",
          "AI deployment",
          "developer productivity",
          "digital transformation",
          "customer experience",
          "cloud consulting",
          "operational efficiency"
        ]
      }
    },
    {
      "id": "gv6zK265OUE",
      "title": "Build your first GraphRAG Powered Agent! (No Graph Expert Required) | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-27T20:55:49.000Z",
      "url": "https://www.youtube.com/watch?v=gv6zK265OUE",
      "thumbnail": "https://i.ytimg.com/vi/gv6zK265OUE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this AWS Events session shows how to build a GraphRAG-powered knowledge graph quickly using the same AI tools teams already use, with a live demo and real documents. The presenters emphasize that creating a useful knowledge graph is not a six-month project and provide sample code to follow along.",
        "bullets": [
          "Knowledge in docs, PDFs, and wikis is often inaccessible to models; knowledge graphs can unlock it.",
          "Many teams avoid building graphs because it seems like a massive undertaking—this session argues it isn't.",
          "Live demo using real documents to build a GraphRAG-powered agent in an afternoon.",
          "Uses the same AI tools teams already have; no long-term project required.",
          "Sample code notebook provided: https://aws-neptune-customer-samples-us-east-1.s3.us-east-1.amazonaws.com/sample-notebooks/graphrag-powered-agent/Build_your_first_GraphRAG_Powered_Agent.ipynb"
        ],
        "takeaways": [
          "Can accelerate internal knowledge access by making docs and wikis queryable via a knowledge graph.",
          "Shorter implementation timeline—demonstrated as doable in an afternoon rather than months.",
          "Leverages existing AI toolchains, reducing the need for large new technology investments.",
          "Live demo and provided sample code help speed proof-of-concept and lower early project risk."
        ],
        "tags": [
          "GraphRAG",
          "knowledge-graph",
          "RAG",
          "AI-agents",
          "databases-for-AI",
          "AWS-Neptune",
          "demo",
          "sample-code",
          "document-qa",
          "knowledge-management"
        ]
      }
    },
    {
      "id": "azzmtqcIeCU",
      "title": "Cloud Cost Efficiency I The Keys to AWS Optimization | S16 E2",
      "channel": "AWS Events",
      "published_at": "2026-01-27T10:14:44.000Z",
      "url": "https://www.youtube.com/watch?v=azzmtqcIeCU",
      "thumbnail": "https://i.ytimg.com/vi/azzmtqcIeCU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This livestream explores the key KPIs that drive AWS cost efficiency—such as cost per transaction, resource utilization rates, and ROI—and explains how to measure and track them. It also covers practical frameworks for benchmarking, identifying cost-optimization opportunities, and building dashboards to communicate value to stakeholders.",
        "bullets": [
          "Defines essential AWS cost KPIs: cost per transaction, utilization, ROI",
          "Shows how to measure and track cloud spending with proven metrics frameworks",
          "Covers benchmarking approaches to assess cloud efficiency",
          "Identifies opportunities for cost optimization",
          "Explains building dashboards to communicate value to stakeholders"
        ],
        "takeaways": [
          "Use clear KPIs (cost per transaction, utilization, ROI) to link infrastructure changes to business outcomes",
          "Benchmarking provides objective targets to prioritize optimization efforts and reclaim wasted spend",
          "Dashboards are essential for translating technical metrics into stakeholder-facing financial value",
          "Collaborate across engineering and FinOps to ensure optimization efforts are measurable and aligned with investment goals"
        ],
        "tags": [
          "AWS",
          "CloudCosts",
          "FinOps",
          "CostOptimization",
          "CloudMetrics",
          "AWSCostManagement",
          "CloudEfficiency",
          "KPIs",
          "CloudBenchmarking"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video shows Jo discovering how Copilot Groups make route planning easy. It highlights Copilot's role in simplifying routing tasks and is shared with tags emphasizing Copilot and AI.",
        "bullets": [
          "Emphasizes that route planning is made easy.",
          "Centers on Jo discovering Copilot Groups.",
          "Showcases Copilot Groups as a tool for routing and group coordination.",
          "Description includes hashtags: #copilot #microsoftcopilot #ai"
        ],
        "takeaways": [
          "Simplified route planning could help streamline dispatching of field crews and logistical movements.",
          "Copilot Groups may support coordination across teams handling grid or data center operations.",
          "Easier routing workflows could contribute to faster on-site responses and operational efficiency."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "copilot-groups",
          "route-planning",
          "logistics",
          "field-operations",
          "Jo"
        ]
      }
    }
  ]
}