{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-27T13:18:33.646Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "azzmtqcIeCU",
      "title": "AWS Cost Efficiency Metrics I The Keys to AWS Optimization | S16 E2",
      "channel": "AWS Events",
      "published_at": "2026-01-27T10:14:44.000Z",
      "url": "https://www.youtube.com/watch?v=azzmtqcIeCU",
      "thumbnail": "https://i.ytimg.com/vi/azzmtqcIeCU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this livestream breaks down the key KPIs for AWS cost efficiency—such as cost per transaction, resource utilization rates, and ROI—and explains how to measure, track, and optimize cloud spending. It also covers practical benchmarking approaches, identifying optimization opportunities, and building dashboards to communicate value to stakeholders.",
        "bullets": [
          "Explains core KPIs: cost per transaction, utilization rates, and ROI.",
          "Shows how to measure and track metrics that link technical performance to business outcomes.",
          "Covers benchmarking methods to evaluate cloud efficiency.",
          "Identifies cost optimization opportunities in AWS environments.",
          "Guides building dashboards to communicate value to stakeholders."
        ],
        "takeaways": [
          "Use cost-per-transaction and ROI metrics to prioritize where to optimize spend.",
          "Monitor resource utilization rates to right-size capacity and reduce waste.",
          "Benchmark workloads to reveal high-impact optimization targets.",
          "Create dashboards that translate technical metrics into business value for stakeholders."
        ],
        "tags": [
          "AWS",
          "FinOps",
          "CostOptimization",
          "CloudMetrics",
          "CloudCosts",
          "ROI",
          "ResourceUtilization",
          "Benchmarking",
          "Dashboards",
          "CloudEfficiency"
        ]
      }
    },
    {
      "id": "9vS5kvxbPMQ",
      "title": "My Porta-Potty Business Brings In $4.3M/Year",
      "channel": "CNBC Make It",
      "published_at": "2026-01-24T15:00:30.000Z",
      "url": "https://www.youtube.com/watch?v=9vS5kvxbPMQ",
      "thumbnail": "https://i.ytimg.com/vi/9vS5kvxbPMQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Daniel Tom, 31, owns Bay Area Sanitation, which operates almost 2,000 portable toilets servicing construction sites and events across the San Francisco Bay Area. The company reported $4.3 million in total income in 2025.",
        "bullets": [
          "Owner: Daniel Tom, 31",
          "Company: Bay Area Sanitation",
          "Fleet: nearly 2,000 portable toilets",
          "Service area: construction sites and events in the San Francisco Bay Area",
          "2025 total income: $4.3 million"
        ],
        "takeaways": [
          "Scale (nearly 2,000 units and $4.3M revenue) indicates a sizable, repeatable operations profile that may represent a meaningful B2B customer segment in the facilities/services space.",
          "Concentration in the San Francisco Bay Area suggests region-specific demand patterns and logistical intensity for urban service operations.",
          "A large, mobile field fleet implies ongoing needs for reliable scheduling, communications, and data management — factors relevant to infrastructure and service availability planning."
        ],
        "tags": [
          "Daniel Tom",
          "Bay Area Sanitation",
          "porta-potty",
          "portable toilets",
          "San Francisco Bay Area",
          "construction",
          "events",
          "2025 revenue",
          "CNBC Make It"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Route planning made easy — Jo discovers the power of Copilot Groups. The short Microsoft Copilot video highlights Copilot Groups as an AI-driven aid for planning routes.",
        "bullets": [
          "Focuses on route planning using Copilot Groups",
          "Features Jo discovering the capability",
          "Positions Microsoft Copilot as an AI tool for routing",
          "Short promotional/demo-style description"
        ],
        "takeaways": [
          "Easier route planning could help streamline technician and crew dispatch in grids and data centers",
          "Copilot Groups may support coordinating multiple routes or teams, improving operational organization",
          "Simplified routing tools could reduce travel time and response latency for maintenance tasks",
          "Decision-makers should consider evaluating Copilot Groups for operational route-planning pilots"
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "route-planning",
          "copilot-groups",
          "jo",
          "routing"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… W odcinku KPMG ON AIR Katarzyna Chojniak i Alicja Barska omawiają praktyczne zastosowania AI w audycie, przedstawiając narzędzia takie jak AI Transaction Scoring Tool, Clara AI oraz platformę KPMG Clara i Clara for Clients. Poruszają też zmiany w podejściu (przejście od próbkowania do analizy pełnych populacji), wpływ na rolę i kompetencje audytorów oraz wyzwania związane z wdrożeniem, bezpieczeństwem danych i regulacjami.",
        "bullets": [
          "Przykłady narzędzi: AI Transaction Scoring Tool, Clara AI, KPMG Clara i Clara for Clients.",
          "Przejście od próbkowania do analizy pełnych populacji w badaniu ksiąg i transakcji.",
          "AI wspiera dokumentację, analizę ujawnień oraz działa jako konwersacyjny asystent i wyspecjalizowani agenci.",
          "Technologie zmieniają rolę audytora i stawiają nowe wymagania kompetencyjne.",
          "Wskazane wyzwania: wdrożenie, bezpieczeństwo danych, środowisko regulacyjne i potencjalne zagrożenia AI."
        ],
        "takeaways": [
          "Skalowalna infrastruktura i zasoby obliczeniowe są kluczowe, gdy audyt przechodzi na analizę pełnych populacji dużych zbiorów danych.",
          "Zapewnienie zaawansowanych mechanizmów bezpieczeństwa i zgodności (kontrole dostępu, szyfrowanie, audyt) jest niezbędne przy udostępnianiu danych narzędziom AI.",
          "Integracja systemów i interfejsów (API/portale) wspierających real‑time management i komunikację z klientem ułatwi wykorzystanie platform takich jak KPMG Clara.",
          "Wsparcie dla szkoleń i rozwój kompetencji audytorów oraz współpraca IT/DevOps przy wdrożeniach modeli AI przyspieszy adaptację rozwiązań.",
          "Wprowadź procesy oceny ryzyka i mechanizmy nadzoru nad modelami AI, aby zminimalizować potencjalne zagrożenia i spełnić wymagania regulacyjne."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMG Clara",
          "automatyzacja",
          "analiza danych",
          "bezpieczeństwo danych",
          "regulacje",
          "innowacje"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield has officially launched and the release highlights support for NVIDIA DLSS 4 with Multi Frame Generation. The trailer was captured on a GeForce RTX 5080 at 4K Ultra settings (DLSS 4 Multi Frame Generation 4X Mode), and the game is described as a 3D real-time strategy RPG where you play the Endministrator exploring Talos-II.",
        "bullets": [
          "Arknights: Endfield launch trailer emphasizes NVIDIA DLSS 4 with Multi Frame Generation.",
          "Game genre: 3D real-time strategy RPG; player role: Endministrator of Endfield Industries on Talos-II.",
          "Trailer capture specs: GeForce RTX 5080, 4K Ultra settings, DLSS 4 Multi Frame Generation 4X Mode.",
          "Official links: DLSS 4 feature article, game site, and multiple social channels provided in description.",
          "Promotional tags: #ArknightsEndfield #RTXOn #DLSS4."
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is a highlighted feature—ensure hardware and software stacks support DLSS 4 if promoting or hosting the title.",
          "Trailer was produced on an RTX 5080 at 4K Ultra settings, indicating production and capture workflows used high-end GPU resources.",
          "4K captures and multi-platform promotion suggest storage, encoding, and delivery considerations for high-resolution assets and streaming."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "RTX5080",
          "4K",
          "RealTimeStrategy",
          "GameLaunch",
          "NVIDIA",
          "GeForce"
        ]
      }
    }
  ]
}