{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-25T21:36:29.517Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "9vS5kvxbPMQ",
      "title": "My Porta-Potty Business Brings In $4.3M/Year",
      "channel": "CNBC Make It",
      "published_at": "2026-01-24T15:00:30.000Z",
      "url": "https://www.youtube.com/watch?v=9vS5kvxbPMQ",
      "thumbnail": "https://i.ytimg.com/vi/9vS5kvxbPMQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Daniel Tom, 31, owns and operates Bay Area Sanitation, managing a fleet of almost 2,000 portable toilets that service construction sites and events across the San Francisco Bay Area. The company reported $4.3 million in total income in 2025.",
        "bullets": [
          "Owner/operator: Daniel Tom, 31",
          "Company: Bay Area Sanitation",
          "Fleet: nearly 2,000 portable toilets",
          "Markets served: construction sites and events in the San Francisco Bay Area",
          "Reported 2025 total income: $4.3 million"
        ],
        "takeaways": [
          "A nearly 2,000-unit fleet and $4.3M revenue indicate an operationally established local vendor for on-site sanitation needs.",
          "Experience serving construction sites suggests the company could support sanitation requirements during facility buildouts or maintenance.",
          "Regional coverage across the Bay Area implies potential availability for projects located in that geography.",
          "Event service experience may reflect the ability to scale temporary deployments up or down to match project timelines."
        ],
        "tags": [
          "portable toilets",
          "sanitation",
          "Bay Area",
          "Daniel Tom",
          "small business",
          "entrepreneurship",
          "construction services",
          "events",
          "2025 revenue",
          "CNBC Make It"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video shows Jo discovering how Copilot Groups can make route planning easy. It emphasizes the power of Copilot Groups in simplifying route-planning tasks.",
        "bullets": [
          "Video focuses on route planning being made easy.",
          "Jo is the person discovering the feature.",
          "Highlights the power of Copilot Groups.",
          "Emphasis on simplicity and efficiency.",
          "Includes hashtags: #copilot #microsoftcopilot #ai"
        ],
        "takeaways": [
          "If your operations involve route planning, the video suggests Copilot Groups may simplify those workflows.",
          "Consider evaluating Copilot Groups for coordination tasks that involve multiple teams or routed assets.",
          "The content signals Microsoft positions Copilot Groups as a tool to streamline planning and decision workflows."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "route-planning",
          "copilot-groups",
          "Jo",
          "productivity",
          "automation"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… KPMG auditors Katarzyna Chojniak and Alicja Barska discuss how AI is already integrated into audit work, enabling analysis of full populations, automating repetitive tasks, and supporting documentation and disclosure review. They highlight concrete tools (AI Transaction Scoring Tool, Clara AI, KPMG Clara and Clara for Clients), explain client benefits and changing auditor competencies, and address implementation challenges, data security and regulatory considerations.",
        "bullets": [
          "AI enables analysis of entire data populations (moving beyond traditional sampling).",
          "AI Transaction Scoring Tool and Clara AI (conversational assistants and specialized agents) are used to speed analysis and decision-making.",
          "KPMG Clara platform provides real-time audit management; Clara for Clients modernizes client communication.",
          "AI supports documentation and disclosure analysis while changing the auditor’s role and required skills.",
          "Discussion covers implementation challenges, data security, regulatory environment and potential AI-related risks."
        ],
        "takeaways": [
          "Expect audits to include full-population data analysis—ensure data accessibility, quality and structured formats to support AI-driven review.",
          "Secure data handling and compliance posture are critical as audits use AI and real-time platforms; reinforce access controls and logging.",
          "Modern audit communication platforms (e.g., Clara for Clients) may change interaction workflows—prepare for more frequent, digital exchanges with auditors.",
          "Auditors will rely on AI tools for repetitive analysis; be ready to provide clear metadata and documentation to support automated procedures.",
          "Adoption of AI in audits brings regulatory scrutiny—maintain traceability of data and processes to satisfy auditors and regulators."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMG",
          "KPMG Clara",
          "Clara AI",
          "transakcje",
          "audyt automatyzacja",
          "bezpieczeństwo danych",
          "pełna populacja",
          "innowacje w audycie"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield has officially launched and the trailer highlights NVIDIA DLSS 4 with Multi Frame Generation. The game is a 3D real-time strategy RPG where players act as the Endministrator exploring Talos-II; the footage was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 Multi Frame Generation 4X mode.",
        "bullets": [
          "Arknights: Endfield is officially launched and promoted in this trailer.",
          "Trailer emphasizes NVIDIA DLSS 4 with Multi Frame Generation.",
          "Game genre: 3D real-time strategy RPG; player role: Endministrator on Talos-II.",
          "Footage captured on GeForce RTX 5080 at 4K Ultra with DLSS 4 MFG 4X mode.",
          "Description includes links to game site and official social channels."
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is being adopted in new titles—validate support for DLSS 4 in your GPU fleet if offering cloud gaming or remote-rendering services for this game.",
          "The trailer was captured on an RTX 5080; consider testing and certifying similar high-end NVIDIA GPUs to ensure performance and compatibility.",
          "For 4K Ultra streaming or capture workflows, ensure your platform stack (drivers, runtimes, and virtualization) supports DLSS 4/MFG features used by the game.",
          "Track titles that advertise DLSS 4 adoption to prioritize hardware and software updates for improved client experience and resource planning."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "NVIDIA",
          "RTX5080",
          "4K",
          "Gaming",
          "Trailer"
        ]
      }
    }
  ]
}