{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-19T18:55:24.789Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Dr. Anna Chacon is a 39-year-old dermatologist in Miami who runs her own private practice and reportedly earns $900,000 a year. Her net worth is about $6 million, composed of $3.2 million in investments, a $1.9 million home, and a $1.1 million office building.",
        "bullets": [
          "39-year-old dermatologist with a private practice in Miami.",
          "Annual earnings reported at $900,000.",
          "Total net worth approximately $6 million.",
          "$3.2M in investments; $1.9M primary residence; $1.1M office building.",
          "Profile featured by CNBC Make It."
        ],
        "takeaways": [
          "Ownership of a medical office building suggests on-site commercial power and connectivity needs that may require resilient solutions.",
          "Private practices with significant investments and real estate holdings could be candidates for dedicated energy or data services.",
          "Concentration of high-earning healthcare professionals in markets like Miami can inform regional capacity and service planning."
        ],
        "tags": [
          "dermatologist",
          "private practice",
          "net worth",
          "investments",
          "real estate",
          "office building",
          "Miami",
          "CNBC Make It",
          "high income"
        ]
      }
    },
    {
      "id": "6L86-OnOXV0",
      "title": "How I Built A $1M/Year Business - And Helped My Parents Retire",
      "channel": "CNBC Make It",
      "published_at": "2026-01-17T15:00:09.000Z",
      "url": "https://www.youtube.com/watch?v=6L86-OnOXV0",
      "thumbnail": "https://i.ytimg.com/vi/6L86-OnOXV0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Tuan Le emigrated from Vietnam to Toronto in 2015 and vowed at 15 to help his parents retire. Ten years later his social video production company, ShortsCut, brings in over $1 million USD in annual sales, and he now pays his parents' rent and living expenses so they no longer have to work full time.",
        "bullets": [
          "Tuan Le emigrated from Vietnam to Toronto in 2015 and vowed at 15 to help his parents retire.",
          "He founded ShortsCut, a social video production company.",
          "ShortsCut generates over $1 million USD in annual sales.",
          "Tuan now covers his parents' rent and living expenses, enabling them to stop working full time.",
          "Video produced by CNBC Make It; no transcript available."
        ],
        "takeaways": [
          "ShortsCut’s >$1M annual sales demonstrate social video production can be a sizeable, revenue-generating business segment worth monitoring.",
          "The company’s financial ability to support the founder’s family suggests commercial stability among some content-production firms.",
          "Decision-makers should note geographic and demographic diversity in growing media startups (example: Toronto-based, immigrant founder) when assessing potential customer pools."
        ],
        "tags": [
          "Tuan Le",
          "ShortsCut",
          "social video",
          "entrepreneurship",
          "immigrant founder",
          "CNBC Make It",
          "Toronto",
          "family support",
          "1M USD"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This giant bubble of carbon dioxide can store 20 megawatts of energy. The description says these new batteries are intended to address renewable energy fluctuations and help power the shift to clean energy globally.",
        "bullets": [
          "Giant carbon dioxide \"bubble\" battery stores 20 megawatts of energy.",
          "Designed to address fluctuations in renewable energy sources.",
          "Positioned as a technology to support the global clean-energy transition.",
          "Presented as a new battery approach for energy storage."
        ],
        "takeaways": [
          "A 20 MW storage option could be relevant for grid-level or large-site backup and smoothing of renewable output.",
          "Decision-makers should consider carbon-dioxide-based batteries as a potential component in renewable integration strategies.",
          "Track this technology for possible inclusion in clean-energy transition plans and future procurement evaluations."
        ],
        "tags": [
          "ieee",
          "tech",
          "innovation",
          "energy",
          "battery",
          "carbon-dioxide",
          "renewables",
          "grid"
        ]
      }
    },
    {
      "id": "OINppmPan0o",
      "title": "Figure Skating | Making Team USA presented by Xfinity with Apolo Ohno",
      "channel": "Team USA",
      "published_at": "2026-01-16T19:30:36.000Z",
      "url": "https://www.youtube.com/watch?v=OINppmPan0o",
      "thumbnail": "https://i.ytimg.com/vi/OINppmPan0o/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, figure skating duo Vadym Kolesnik and Emilia Zingas sit down with Apolo Ohno in an episode of Making Team USA presented by Xfinity ahead of the Winter Olympics. The segment is framed around the theme \"Built on trust\" and profiles the pair as they prepare for competition.",
        "bullets": [
          "Vadym Kolesnik and Emilia Zingas are featured in the episode.",
          "They are interviewed by Apolo Ohno.",
          "The episode is part of Making Team USA presented by Xfinity.",
          "The conversation occurs ahead of the Winter Olympics.",
          "The episode emphasizes a theme of trust between the skating duo."
        ],
        "takeaways": [
          "Trust and strong team relationships are highlighted as foundational to peak performance—apply this when building operations and incident-response teams.",
          "Pre-event preparation and coordinated partnerships matter; ensure cross-team rehearsals and clear roles before critical launches or migrations.",
          "Visible leadership and mentorship (peer-to-peer learnings) can help reinforce best practices and reliability across teams."
        ],
        "tags": [
          "Vadym Kolesnik",
          "Emilia Zingas",
          "Apolo Ohno",
          "Making Team USA",
          "Xfinity",
          "figure skating",
          "Winter Olympics",
          "Team USA",
          "trust"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Ten-minute podcast odcinek KPMG ON AIR z Moniką Palmowską i Jakubem Roszkiewiczem omawia, jak AI wpływa na procesy związane z cenami transferowymi — od monitorowania rentowności, przez benchmarki, po automatyzację dokumentacji. Eksperci zwracają uwagę na korzyści (wzmocnienie pracy doradców, integracja z ERP) oraz ryzyka i wymagania (dane, bezpieczeństwo, RODO, halucynacje), a także na praktyczne kroki wdrożeniowe i potrzebę uporządkowania procesów.",
        "bullets": [
          "AI wspiera monitoring rentowności, analizy porównawcze i automatyzację dokumentacji cen transferowych.",
          "Sztuczna inteligencja ma wzmocnić pracę doradców podatkowych, a nie ich zastąpić.",
          "Wskazane są pierwsze kroki wdrożeniowe: uporządkowanie procesów i integracja AI z systemami ERP oraz inteligentnymi benchmarkami.",
          "Ryzyka obejmują kwestie danych, bezpieczeństwo, zgodność z RODO i ryzyko „halucynacji” AI.",
          "Digital Gateway wymieniono jako przykład bezpiecznego środowiska do pracy z AI i danych."
        ],
        "takeaways": [
          "Rozważ wykorzystanie AI do automatycznego monitorowania rentowności i benchmarków dla usług świadczonych między jednostkami — może przyspieszyć decyzje operacyjne.",
          "Przed wdrożeniem uporządkuj procesy i dane w ERP — integracja AI z istniejącymi systemami jest wymieniona jako kluczowa korzyść.",
          "Zadbaj o środowisko pracy z AI o wysokim poziomie bezpieczeństwa (np. Digital Gateway) oraz o zgodność z RODO przy przetwarzaniu danych.",
          "Planuj szkolenia i rozwój kompetencji zespołów — AI ma wspierać, a nie zastępować ekspertów, więc kompetencje wewnętrzne są istotne."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "transfer pricing",
          "podatki",
          "automatyzacja",
          "monitoring rentowności",
          "ERP",
          "bezpieczeństwo danych",
          "RODO",
          "KPMG"
        ]
      }
    },
    {
      "id": "dGfcT63U7Mo",
      "title": "The 2026 U.S. Olympic Figure Skating Team 🇺🇸",
      "channel": "Team USA",
      "published_at": "2026-01-15T20:43:24.000Z",
      "url": "https://www.youtube.com/watch?v=dGfcT63U7Mo",
      "thumbnail": "https://i.ytimg.com/vi/dGfcT63U7Mo/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this Team USA video presents the U.S. Olympic Figure Skating lineup for the 2026 Winter Olympics. It was published January 15, 2026 and is tagged #WinterOlympics.",
        "bullets": [
          "Title: The 2026 U.S. Olympic Figure Skating Team",
          "Channel: Team USA",
          "Published: 2026-01-15T20:43:24.000Z",
          "Content: Announces the U.S. Olympic Figure Skating lineup",
          "No transcript available; description includes #WinterOlympics"
        ],
        "takeaways": [
          "Classify and index this as 2026 Winter Olympics figure skating content for event catalogs and archives.",
          "Record publisher (Team USA) and exact timestamp for provenance and content management.",
          "Use the #WinterOlympics tag for event-based filtering, monitoring, and promotion workflows.",
          "Generate a transcript/closed captions to improve accessibility, searchability, and metadata quality."
        ],
        "tags": [
          "U.S. Olympic Figure Skating",
          "Team USA",
          "Winter Olympics",
          "2026",
          "Figure Skating",
          "Olympics",
          "Lineup",
          "Sports"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Copilot is presented as a way to keep momentum across workouts, projects, and personal goals. The message emphasizes stacking small wins to sustain progress and consistency.",
        "bullets": [
          "Targets workouts, projects, and personal goals.",
          "Encourages stacking small wins to maintain momentum.",
          "Positions Copilot as a supportive tool for ongoing progress.",
          "Message is broad and focused on consistency rather than specific features."
        ],
        "takeaways": [
          "Break large initiatives into smaller, trackable wins to maintain progress on long-running data center projects and migrations.",
          "Consider tools that help teams record and sustain incremental achievements to boost morale and continuity during operations.",
          "Apply a momentum-focused approach to routine maintenance and rollout plans to improve consistency and reduce project drift."
        ],
        "tags": [
          "Copilot",
          "Microsoft",
          "productivity",
          "momentum",
          "small-wins",
          "habit-building",
          "projects",
          "workouts",
          "personal-goals"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights the Dell PowerEdge R770AP server powered by Intel® Xeon® 6 processors as a solution for high-frequency trading where every second counts. It emphasizes that the server's precision and speed enable hundreds of trades in seconds to help maximize gains and minimize losses, and positions Intel Xeon 6 CPUs as shaping the future of finance.",
        "bullets": [
          "Showcases Dell PowerEdge R770AP with Intel® Xeon® 6 processors",
          "Focused on high-frequency trading use cases where time is critical",
          "Claims precision and speed enable hundreds of trades in seconds",
          "Aims to help maximize gains and minimize losses",
          "Positions Intel Xeon 6 CPUs as defining the future of finance"
        ],
        "takeaways": [
          "For HFT workloads, prioritize server platforms that deliver the precision and speed described (e.g., Dell PowerEdge R770AP with Intel Xeon 6).",
          "Assess compute performance impact on trading outcomes—faster, more precise servers can influence gains and losses.",
          "Use Intel Business resources and vendor guidance when planning deployments for finance-specific, high-performance environments."
        ],
        "tags": [
          "high-frequency trading",
          "Dell PowerEdge R770AP",
          "Intel Xeon 6",
          "high-performance",
          "finance",
          "Intel Business",
          "servers",
          "trading"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the short clip says the creative spark was out and Copilot brought it back to life. Viewers are invited to download Copilot and try it for themselves via the link in the bio.",
        "bullets": [
          "No transcript available for the video.",
          "Core message: Copilot revived creative spark.",
          "Call-to-action: download and try Copilot (link in bio).",
          "Published by Microsoft Copilot on 2026-01-14."
        ],
        "takeaways": [
          "Consider exploring Copilot as a tool to help teams regain creativity during problem-solving or design tasks.",
          "Pilot Copilot with a small team to assess whether it improves creative workflows before wider rollout.",
          "Use the download/link-in-bio trial to evaluate fit with operational processes and user acceptance."
        ],
        "tags": [
          "Copilot",
          "Microsoft Copilot",
          "creativity",
          "AI",
          "download",
          "link-in-bio",
          "creative-tools",
          "productivity",
          "video",
          "call-to-action"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video showcases the open-world martial arts RPG Where Winds Meet running with NVIDIA DLSS 4 featuring Multi Frame Generation and RTX Enabled visuals. The clip invites viewers to experience the game with #RTXOn and credits @DigitalDreamsyt for the footage.",
        "bullets": [
          "Open-world martial arts RPG: Where Winds Meet",
          "Highlights DLSS 4 with Multi Frame Generation",
          "Showcases NVIDIA RTX-enabled visuals (#RTXOn)",
          "Footage credited to @DigitalDreamsyt",
          "Promotional/demo-style presentation"
        ],
        "takeaways": [
          "Reproducing this experience requires NVIDIA RTX-capable GPUs and DLSS 4 support.",
          "AI-driven features like Multi Frame Generation imply additional GPU compute and software support considerations.",
          "Ensure driver, SDK, and platform compatibility for DLSS and RTX when provisioning hardware for similar demos or services.",
          "Plan GPU capacity and possibly edge/cloud GPU resources if delivering RTX/DLSS-enabled streaming or demo services to users."
        ],
        "tags": [
          "WhereWindsMeet",
          "DLSS4",
          "MultiFrameGeneration",
          "RTXOn",
          "NVIDIA",
          "GeForce",
          "martialartsRPG",
          "openworld",
          "DigitalDreamsyt"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this YouTube video is from the Intel Business channel and is titled 'Taha Khalifa (Intel)'. The channel description promotes the Intel® Business Center as a source of IT information—from data centers to devices—and provides subscription and social links. No transcript is available for the video.",
        "bullets": [
          "Video titled 'Taha Khalifa (Intel)' on the Intel Business channel.",
          "Description highlights the Intel® Business Center as a resource for IT projects, covering data centers to devices.",
          "Includes subscription link and links to Intel Business website, X (Twitter), LinkedIn, and Facebook.",
          "Channel URL provided: youtube.com/intelbusiness.",
          "No transcript is available for this video."
        ],
        "takeaways": [
          "Intel Business markets itself as a resource for data center and IT project guidance—visit the Intel Business Center for related materials and expert insights.",
          "Subscribing to the Intel Business channel is a way to receive ongoing content relevant to IT and data center topics.",
          "Use the listed website and social channels (X, LinkedIn, Facebook) to access additional resources and updates for data center decision-making."
        ],
        "tags": [
          "Intel Business",
          "Taha Khalifa",
          "Intel",
          "data center",
          "IT resources",
          "IT projects",
          "technology",
          "subscribe",
          "Intel Business Center"
        ]
      }
    },
    {
      "id": "kSocjh8PZnQ",
      "title": "Rynek dóbr luksusowych w obliczu transformacji | Andrzej Marczak, Tomasz Wiśniewski",
      "channel": "KPMG Poland",
      "published_at": "2026-01-13T10:23:31.000Z",
      "url": "https://www.youtube.com/watch?v=kSocjh8PZnQ",
      "thumbnail": "https://i.ytimg.com/vi/kSocjh8PZnQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this KPMG ON AIR podcast episode features Andrzej Marczak and Tomasz Wiśniewski discussing current trends reshaping the luxury goods market — from experience-led consumption and \"affordable luxury\" to the rising importance of ESG. They compare Poland (a growing but fragmented market) to global dynamics and touch on areas like art, hotels, tourism and future drivers such as AI, craftsmanship and the human dimension.",
        "bullets": [
          "Shift toward experience-driven luxury and personalization; Gen Z values experiences over ownership.",
          "ESG and responsible-luxury practices gaining importance (e.g., eco-leathers, certifications).",
          "‘Affordable luxury’ and aspirational consumers expanding categories; top 2% of wealth accounts for ~40% of the market.",
          "Polish market is growing despite global slowdowns but remains fragmented; art, hotels and luxury tourism are notable segments.",
          "Future drivers include AI, craftsmanship and maintaining a human dimension in luxury offerings."
        ],
        "takeaways": [
          "Growing luxury demand and expanding hospitality/tourism in Poland imply increased need for reliable local digital infrastructure and low-latency services.",
          "Emphasis on personalization and AI-driven experiences points to requirements for scalable compute and data-processing capacity in data centers.",
          "Rising ESG expectations mean data centers should prioritize energy efficiency, low-carbon operations and sustainability certifications.",
          "Regional/tourism-driven spikes (e.g., luxury hotels, coastal destinations) call for flexible capacity planning and resilience to handle seasonal load variations.",
          "Support for digital art, exclusive experiences and secure client data necessitates high availability, strong security and robust backup/storage solutions."
        ],
        "tags": [
          "luksus",
          "ESG",
          "Polska",
          "luxury-fatigue",
          "personalizacja",
          "Gen-Z",
          "affordable-luxury",
          "AI",
          "turystyka",
          "KPMG"
        ]
      }
    }
  ]
}