{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-28T10:54:43.429Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "gv6zK265OUE",
      "title": "Build your first GraphRAG Powered Agent! (No Graph Expert Required) | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-27T20:55:49.000Z",
      "url": "https://www.youtube.com/watch?v=gv6zK265OUE",
      "thumbnail": "https://i.ytimg.com/vi/gv6zK265OUE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Your AI may be missing valuable knowledge locked in docs, PDFs, and wikis that models can’t readily reason over. The video shows how to build a knowledge graph in an afternoon using the same AI tools you already use, with a live demo on real documents and no six-month project required.",
        "bullets": [
          "Knowledge in docs, PDFs, and wikis is often inaccessible to AI models.",
          "Knowledge graphs can unlock that trapped information for reasoning.",
          "Building a graph is presented as a quick, practical task rather than a large-scale project.",
          "Demo uses real documents and the same AI tools teams already use.",
          "No six-month implementation required."
        ],
        "takeaways": [
          "Extracting knowledge from existing docs, PDFs, and wikis can make AI tools more useful for operational queries.",
          "A knowledge-graph approach can be implemented quickly—reducing time and project cost compared to long initiatives.",
          "Teams can leverage existing AI tools without needing deep graph expertise or a lengthy rollout.",
          "A live demo on real documents demonstrates practical applicability rather than just theory."
        ],
        "tags": [
          "Knowledge Graph",
          "GraphRAG",
          "Databases for AI",
          "Document AI",
          "RAG",
          "AI Tools",
          "Live Demo",
          "Knowledge Extraction",
          "AWS Events"
        ]
      }
    },
    {
      "id": "yUpQ9pWA9WE",
      "title": "Watch Live: Fed Chair Jerome Powell Holds News Conference | WSJ",
      "channel": "WSJ News",
      "published_at": "2026-01-27T20:49:24.000Z",
      "url": "https://www.youtube.com/watch?v=yUpQ9pWA9WE",
      "thumbnail": "https://i.ytimg.com/vi/yUpQ9pWA9WE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Federal Reserve Chair Jerome Powell spoke to reporters following the Fed's two-day policy-setting meeting. WSJ News streamed his post-meeting press conference.",
        "bullets": [
          "Jerome Powell held a press conference with reporters.",
          "The event followed the Federal Reserve's two-day policy-setting meeting.",
          "WSJ News provided live coverage of the session.",
          "No transcript was included in the video description."
        ],
        "takeaways": [
          "Monitor Powell’s remarks as the primary source of official Fed guidance following the policy meeting.",
          "Preparedness: statements from the press conference may affect financing costs and market conditions relevant to capital planning for grids and data centers.",
          "Use the live stream or archived footage to inform timing of investment decisions, budgeting, and risk assessments tied to monetary policy signals.",
          "Record or document any Fed communications for audit, compliance, and stakeholder briefings if they influence contracts or funding arrangements."
        ],
        "tags": [
          "JeromePowell",
          "Fed",
          "Federal Reserve",
          "monetary policy",
          "press conference",
          "WSJ",
          "policy meeting",
          "economy",
          "markets"
        ]
      }
    },
    {
      "id": "MuQmKCWjSYI",
      "title": "Deutsche Bank accelerates Cloud journeys with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-27T17:39:29.000Z",
      "url": "https://www.youtube.com/watch?v=MuQmKCWjSYI",
      "thumbnail": "https://i.ytimg.com/vi/MuQmKCWjSYI/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Google Cloud Consulting partnered with Deutsche Bank to design novel learning experiences that used Generative AI to create personalized, interactive training, helping thousands of engineers become fluent in cloud engineering. The Google Cloud Consulting Learning Services team combined on‑demand convenience with instructor‑led effectiveness to build the Deutsche Bank Cloud Engineering Program and accelerate their cloud journey.",
        "bullets": [
          "Consulting designed novel learning experiences for Deutsche Bank engineers.",
          "Generative AI used to create personalized, interactive training.",
          "Blended approach: on‑demand learning plus instructor‑led sessions.",
          "Learning Services provided creative innovation and technical expertise.",
          "Program helped thousands of engineers and accelerated the cloud journey."
        ],
        "takeaways": [
          "Investing in scalable, personalized training can accelerate cloud migration timelines.",
          "Generative AI can help scale skill development across large engineering teams.",
          "Blending on‑demand and instructor‑led formats improves training effectiveness versus a single mode.",
          "Partnering with specialized consulting shortens time to build effective internal learning programs.",
          "Building workforce fluency in cloud engineering is a foundational step for successful cloud adoption."
        ],
        "tags": [
          "Deutsche Bank",
          "Google Cloud",
          "cloud engineering",
          "generative AI",
          "training",
          "learning services",
          "cloud migration",
          "consulting",
          "workforce development",
          "personalized learning"
        ]
      }
    },
    {
      "id": "5CyVBSbHmbA",
      "title": "Year-end toolkit: Strengthening audit committee collaboration",
      "channel": "PwC US",
      "published_at": "2026-01-27T17:20:31.000Z",
      "url": "https://www.youtube.com/watch?v=5CyVBSbHmbA",
      "thumbnail": "https://i.ytimg.com/vi/5CyVBSbHmbA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this PwC Year‑end toolkit episode focuses on strengthening collaboration between finance/management and the audit committee during the year‑end accounting and reporting cycle. It highlights communication and reporting best practices and addresses emerging oversight topics including AI, enterprise risk management, cyber risk, and proxy disclosures.",
        "bullets": [
          "Strengthening management/audit committee communication and collaboration (1:18).",
          "Key year‑end accounting and reporting issues finance teams should be prepared to address (10:10).",
          "Oversight of AI: assessing risks, opportunities, and controls (15:02).",
          "Enhancing enterprise risk oversight and navigating evolving cyber risk in the age of AI (21:33; 27:35).",
          "Elevating proxy disclosures and links to replay and guidance resources (36:05)."
        ],
        "takeaways": [
          "Engage audit committees early on AI initiatives to ensure oversight of related risks, opportunities, and internal controls.",
          "Prepare year‑end reporting to reflect impacts from transformation initiatives and ensure clear communication with governance.",
          "Prioritize enterprise risk and cyber risk oversight as AI changes the threat and control landscape.",
          "Review and strengthen disclosures (including proxy materials) to reflect material governance, risk, and reporting developments."
        ],
        "tags": [
          "audit committee",
          "year-end",
          "financial reporting",
          "AI oversight",
          "enterprise risk",
          "cyber risk",
          "proxy disclosures",
          "governance",
          "PwC"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, route planning made easy—Jo discovers the power of Copilot Groups. The video highlights Copilot Groups in Microsoft Copilot and their role in simplifying route planning.",
        "bullets": [
          "Focuses on route planning",
          "Highlights Copilot Groups feature",
          "Centers on a person named Jo",
          "Emphasizes ease of use (“made easy”)",
          "Branded with Copilot / Microsoft Copilot / AI"
        ],
        "takeaways": [
          "The video presents Copilot Groups as a tool for route planning, which could be relevant when considering tools for operational routing needs.",
          "Signals that Microsoft Copilot applies AI to practical planning tasks like routing.",
          "Short product-focused demos like this can help inform awareness of capabilities when evaluating vendor offerings for operations."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "route-planning",
          "copilot-groups",
          "Jo",
          "logistics",
          "productivity",
          "demo"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI is already integrated into audit practice at KPMG, supporting repetitive tasks, large-scale data analysis and decision-making. The podcast discusses practical tools (AI Transaction Scoring, Clara AI, KPMG Clara), benefits for clients, changing auditor roles and key competency, plus data security and regulatory considerations.",
        "bullets": [
          "AI tools enable analysis of full populations (AI Transaction Scoring) rather than relying only on sampling.",
          "Clara AI provides conversational assistance and specialized agents to support audit work and documentation.",
          "KPMG Clara platform offers real-time audit management and Clara for Clients modernizes client communication.",
          "Adoption changes auditors’ roles and requires new competencies and adaptation.",
          "Data security, regulatory environment and potential AI-related risks are important implementation challenges."
        ],
        "takeaways": [
          "Expect audits to leverage full-population analytics—ensure your systems store high-quality, accessible data for evidence and traceability.",
          "Real-time audit platforms and client portals mean closer, more continuous engagement—plan for integration and secure access controls.",
          "Data security and compliance are critical when audit AI tools process large datasets—review governance, encryption and regulatory alignment.",
          "Workforce readiness matters: anticipate auditors and internal teams needing new skills and change management for AI-enabled processes."
        ],
        "tags": [
          "audit",
          "AI",
          "KPMG",
          "KPMGClara",
          "ClaraAI",
          "full-population-analysis",
          "data-security",
          "regulation",
          "audit-innovation"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield has officially launched and the trailer spotlights NVIDIA DLSS 4 with Multi Frame Generation. The game is a 3D real-time strategy RPG and the footage was captured on a GeForce RTX 5080 at 4K Ultra Settings using DLSS 4 Multi Frame Generation 4X Mode, with links to the game and social channels provided.",
        "bullets": [
          "Official launch of Arknights: Endfield, a 3D real-time strategy RPG.",
          "Trailer features NVIDIA DLSS 4 with Multi Frame Generation.",
          "Captured on GeForce RTX 5080 at 4K Ultra Settings using DLSS 4 MFG 4X Mode.",
          "Description includes links to the game site and multiple social channels.",
          "Video published by NVIDIA GeForce and promotes GeForce social platforms and community portal."
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is deployed in a shipping title, indicating adoption of NVIDIA's latest upscaling tech in retail games.",
          "Trailer capture on an RTX 5080 at 4K Ultra suggests verification and marketing are being done on high-end RTX 50-series hardware.",
          "Decision-makers should note availability of vendor resources and links for further technical details and validation.",
          "Integration in a launched game underscores ongoing relevance of GPU-driven rendering features for content delivery and testing."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "RTX5080",
          "4K",
          "RealTimeStrategy",
          "NVIDIA",
          "GeForce",
          "GameLaunch",
          "Gaming"
        ]
      }
    }
  ]
}