{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-29T06:05:56.704Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "feL4GUiP7Ws",
      "title": "Building Prior Authorization Systems for Healthcare Payors with Amazon Bedrock",
      "channel": "AWS Events",
      "published_at": "2026-01-29T05:43:38.000Z",
      "url": "https://www.youtube.com/watch?v=feL4GUiP7Ws",
      "thumbnail": "https://i.ytimg.com/vi/feL4GUiP7Ws/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This technical session shows how to use Amazon Bedrock foundation models to build an intelligent prior authorization system that meets CMS regulatory requirements while boosting operational efficiency. AWS Engineers and the AWS Generative AI Innovation Center present an architectural approach that combines advanced NLP with healthcare-specific workflows to automate Local Coverage Determinations, analyze medical documentation, and produce explainable prior authorization recommendations to help payors meet CMS-0057-F timelines.",
        "bullets": [
          "Demonstrates using Amazon Bedrock to power an intelligent prior authorization system for payors.",
          "Presents a comprehensive architecture combining advanced NLP with healthcare-specific workflows.",
          "Shows automated processing of Local Coverage Determinations (LCDs) and complex medical documentation analysis.",
          "Generates explainable prior authorization recommendations to support compliance and auditability.",
          "Aims to help payors meet CMS-0057-F timelines while maintaining compliance and accuracy."
        ],
        "takeaways": [
          "Plan for scalable ML inference and storage to support high-throughput NLP processing required to meet CMS timelines.",
          "Design infrastructure and workflows to support explainability and auditing for regulatory compliance.",
          "Ensure secure integration with payer systems and data pipelines to maintain accuracy and compliance.",
          "Anticipate measurable operational-efficiency gains that can reduce manual review load and affect capacity planning."
        ],
        "tags": [
          "Amazon Bedrock",
          "prior-authorization",
          "Local Coverage Determinations",
          "CMS-0057-F",
          "NLP",
          "healthcare-payors",
          "generative-ai",
          "explainability",
          "operational-efficiency",
          "AWS"
        ]
      }
    },
    {
      "id": "7CbJoeEFyZg",
      "title": "Transforming Healthcare Document Processing Workflows with Generative AI",
      "channel": "AWS Events",
      "published_at": "2026-01-28T21:33:21.000Z",
      "url": "https://www.youtube.com/watch?v=7CbJoeEFyZg",
      "thumbnail": "https://i.ytimg.com/vi/7CbJoeEFyZg/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… this technical session demonstrates AWS's GenAI Intelligent Document Processing (GenAIIDP) solution that uses Amazon Textract and Bedrock to automatically process complex medical documents, transforming days-long manual processes into minutes. It covers automated classification, data extraction, criteria validation, HIPAA compliance, live demonstrations, architecture deep-dives, integration patterns, and implementation strategies for scalable pipelines and ROI optimization.",
        "bullets": [
          "Combines Amazon Textract and Bedrock to automate classification, extraction, and criteria validation of complex medical documents.",
          "Claims transformation of document workflows from days-long manual processes to minutes-long automated processing.",
          "Maintains HIPAA compliance for handling healthcare documents.",
          "Includes live demos and architecture deep-dives illustrating scalable document processing pipelines.",
          "Covers integration patterns with existing systems and best practices for ROI optimization."
        ],
        "takeaways": [
          "Dramatic reduction in processing time (days to minutes) can materially affect throughput and operational timelines.",
          "Built on Amazon Textract and Bedrock — assess alignment with AWS-managed AI/document services when planning deployment.",
          "HIPAA compliance is a core feature, important for meeting healthcare regulatory requirements.",
          "Session content on integration patterns, scalable pipelines, and ROI best practices supports planning for production deployment and cost justification."
        ],
        "tags": [
          "AWS",
          "GenAI",
          "Textract",
          "Bedrock",
          "Healthcare",
          "HIPAA",
          "Intelligent Document Processing",
          "Document Automation",
          "Scalability"
        ]
      }
    },
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy AI solutions, leveraging GenAI and Google Cloud's infrastructure to streamline operations and boost developer productivity. The engagement compressed TTEC's digital transformation timeline, unlocked new revenue streams, and expanded what the company sees as possible for its business.",
        "bullets": [
          "TTEC worked with Google Cloud Consulting to accelerate AI deployment",
          "Rapid prototyping and deployment of GenAI solutions",
          "Leveraged Google Cloud's robust infrastructure to streamline operations",
          "Improved developer productivity",
          "Unlocked new revenue streams and compressed digital transformation timeline"
        ],
        "takeaways": [
          "Ensure scalable cloud infrastructure to support GenAI workloads and rapid prototyping",
          "Engage cloud consulting partners to compress timelines and expand project scope",
          "Prioritize developer productivity tools and processes to speed AI value realization",
          "Factor operational efficiency gains and potential new revenue when evaluating AI investments"
        ],
        "tags": [
          "googlecloud",
          "ttec",
          "genai",
          "aideployment",
          "operationalefficiency",
          "customerexperience",
          "googlecloudplatform",
          "generativeai"
        ]
      }
    },
    {
      "id": "5CyVBSbHmbA",
      "title": "Year-end toolkit: Strengthening audit committee collaboration",
      "channel": "PwC US",
      "published_at": "2026-01-27T17:20:31.000Z",
      "url": "https://www.youtube.com/watch?v=5CyVBSbHmbA",
      "thumbnail": "https://i.ytimg.com/vi/5CyVBSbHmbA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This episode focuses on strengthening finance teams' collaboration with audit committees during the year-end accounting and reporting process. It covers communication and governance practices, key year-end issues, oversight of AI and cyber risk, enterprise risk management, transformation initiatives, and proxy disclosure enhancements.",
        "bullets": [
          "Strengthening management/audit committee communication and collaboration",
          "Key year-end accounting and reporting issues finance teams should be prepared to address",
          "Oversight of AI: risks, opportunities, and controls",
          "Enhancing enterprise risk oversight and navigating evolving cyber risk in the age of AI",
          "Elevating proxy disclosures and streamlining reporting"
        ],
        "takeaways": [
          "Engage the audit committee early on AI adoption and ensure clear oversight and control documentation for year-end reporting",
          "Treat cyber risk and AI-related vulnerabilities as core year-end topics to address with governance to reduce audit surprises",
          "Align transformation initiatives with enterprise risk and governance discussions so reporting and disclosures reflect material impacts",
          "Streamline communication with the audit committee to anticipate questions and improve the efficiency of year-end reporting and disclosures"
        ],
        "tags": [
          "audit committee",
          "year-end",
          "financial reporting",
          "AI oversight",
          "enterprise risk",
          "cyber risk",
          "governance",
          "proxy disclosures",
          "transformation",
          "audit"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights Jo using Copilot Groups to make route planning easy. It presents the power of Copilot Groups in simplifying planning tasks within Microsoft Copilot.",
        "bullets": [
          "Jo demonstrates Copilot Groups for route planning.",
          "Emphasis on making route planning easy.",
          "Showcases group-focused Copilot functionality.",
          "Presented by Microsoft Copilot with AI framing."
        ],
        "takeaways": [
          "Copilot Groups simplify route planning, which can be relevant for coordinating field crews and logistics.",
          "Group-oriented Copilot features may support collaborative planning among operations teams.",
          "AI-enabled route planning could reduce manual planning steps and improve consistency.",
          "Consider evaluating Copilot Groups for workflows that depend on optimized routing and team coordination."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "route-planning",
          "copilot-groups",
          "jo",
          "product-demo",
          "route-management"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Podcast episode from KPMG ON AIR features Katarzyna Chojniak and Alicja Barska explaining practical zastosowania AI w audycie, w tym narzędzia takie jak AI Transaction Scoring Tool i Clara AI oraz platformę KPMG Clara. Rozmowa koncentruje się na korzyściach dla klientów, przejściu od próbkowania do analizy pełnych populacji, kompetencjach audytorów, kwestiach bezpieczeństwa danych i wyzwaniach regulacyjnych.",
        "bullets": [
          "AI Transaction Scoring Tool umożliwia analizę pełnych populacji danych zamiast tradycyjnego próbkowania.",
          "Clara AI działa jako konwersacyjny asystent i zestaw wyspecjalizowanych agentów wspierających badanie.",
          "KPMG Clara to platforma do zarządzania badaniem w czasie rzeczywistym; istnieje też Clara for Clients dla komunikacji z klientem.",
          "AI wspiera dokumentację, analizę ujawnień i przyspiesza powtarzalne czynności audytowe.",
          "Omówione są wyzwania wdrożeniowe, adaptacja audytorów, bezpieczeństwo danych, środowisko regulacyjne i potencjalne zagrożenia AI."
        ],
        "takeaways": [
          "Przygotuj dostęp do pełnych, uporządkowanych danych — audyt z AI przechodzi od próbkowania do analizy całych populacji.",
          "Zadbaj o zabezpieczenia i zgodność regulacyjną danych udostępnianych audytorom korzystającym z narzędzi AI.",
          "Oczekuj bardziej szczegółowych, szybszych raportów i usprawnionej komunikacji dzięki platformom do zarządzania audytem w czasie rzeczywistym.",
          "Inwestuj w szkolenia personelu, by efektywnie współpracował z asystentami konwersacyjnymi i narzędziami analitycznymi AI.",
          "Weryfikuj mechanizmy kontroli i ograniczeń AI — uwzględnij ryzyka związane z automatyzacją i interpretacją wyników."
        ],
        "tags": [
          "audit",
          "AI",
          "KPMG Clara",
          "Clara AI",
          "AI Transaction Scoring",
          "audit-automation",
          "data-security",
          "regulatory",
          "full-population-analysis",
          "audit-innovation"
        ]
      }
    }
  ]
}