{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-30T07:13:50.343Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "gv6zK265OUE",
      "title": "Build your first GraphRAG Powered Agent! (No Graph Expert Required) | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-30T06:40:49.000Z",
      "url": "https://www.youtube.com/watch?v=gv6zK265OUE",
      "thumbnail": "https://i.ytimg.com/vi/gv6zK265OUE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the session demonstrates how to build a knowledge graph (GraphRAG) so AI can reason over information trapped in docs, PDFs, and wikis. It includes a live demo with real documents and sample code, showing you can build one in an afternoon using the AI tools you already use—no six‑month project required.",
        "bullets": [
          "Knowledge in docs, PDFs, and wikis is often inaccessible to AI reasoning.",
          "Knowledge graphs (GraphRAG) can unlock that trapped information.",
          "Many teams avoid building graphs because they seem large and complex.",
          "The talk shows a fast, practical build approach—an afternoon, not months.",
          "Live demo and sample notebooks are provided for hands‑on follow-up."
        ],
        "takeaways": [
          "Extract institutional knowledge from internal documents to make it queryable by AI.",
          "Leverage existing AI toolchains to prototype a knowledge graph quickly, reducing project timeline and risk.",
          "Live demo plus provided sample code enables rapid evaluation and proof‑of‑concept development."
        ],
        "tags": [
          "GraphRAG",
          "knowledge-graph",
          "RAG",
          "document-intelligence",
          "AI-agents",
          "live-demo",
          "sample-code",
          "AWS",
          "Neptune"
        ]
      }
    },
    {
      "id": "azzmtqcIeCU",
      "title": "Cloud Cost Efficiency I The Keys to AWS Optimization | S16 E2",
      "channel": "AWS Events",
      "published_at": "2026-01-30T05:12:30.000Z",
      "url": "https://www.youtube.com/watch?v=azzmtqcIeCU",
      "thumbnail": "https://i.ytimg.com/vi/azzmtqcIeCU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this livestream explores key metrics that drive AWS cost efficiency, including cost per transaction, resource utilization rates, and ROI calculations, and explains how to measure, track, and optimize AWS spending. It also covers practical approaches for benchmarking, identifying cost optimization opportunities, and building dashboards to communicate value to stakeholders, aimed at cloud engineers, FinOps teams, and technical leaders.",
        "bullets": [
          "Breakdown of essential KPIs: cost per transaction, utilization rates, ROI.",
          "Guidance on measuring and tracking AWS spending with metrics frameworks.",
          "Practical benchmarking methods to spot optimization opportunities.",
          "Steps to build dashboards that align technical performance with business outcomes.",
          "Target audience: cloud engineers, FinOps teams, and technical leaders."
        ],
        "takeaways": [
          "Track cost-per-transaction and utilization to quantify where cloud spend delivers value.",
          "Use ROI calculations to prioritize optimization projects that align with business outcomes.",
          "Benchmarking reveals specific workloads to right-size or migrate, informing capex vs opex decisions.",
          "Dashboards make cost and performance data actionable for stakeholders and support investment justification."
        ],
        "tags": [
          "AWS",
          "CloudCosts",
          "FinOps",
          "CostOptimization",
          "CloudMetrics",
          "AWSCostManagement",
          "CloudEfficiency",
          "KPIs",
          "ROI",
          "Benchmarking"
        ]
      }
    },
    {
      "id": "oQtkaHzUYlY",
      "title": "Copilot helps Christa find her inner star 🌟",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-29T18:33:49.000Z",
      "url": "https://www.youtube.com/watch?v=oQtkaHzUYlY",
      "thumbnail": "https://i.ytimg.com/vi/oQtkaHzUYlY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the sky is full of stars, and Copilot helps Christa find the star within. The video invites viewers to download and try Copilot via the link in bio.",
        "bullets": [
          "Promotional video titled 'Copilot helps Christa find her inner star 🌟'.",
          "Theme frames Copilot as a tool that helps Christa find her 'inner star'.",
          "Clear call to action: download and try Copilot via link in bio.",
          "Published by Microsoft Copilot on 2026-01-29.",
          "No transcript available."
        ],
        "takeaways": [
          "Consumer-focused marketing signals potential for increased user adoption—monitor usage trends tied to campaigns.",
          "CTAs like 'link in bio' can create short-term traffic spikes—ensure capacity headroom and monitoring during promotions.",
          "Coordinate with marketing teams on campaign timing so infrastructure provisioning aligns with promotional pushes.",
          "Track onboarding and authentication metrics from promotional sources to detect and address friction quickly."
        ],
        "tags": [
          "Copilot",
          "Microsoft",
          "Christa",
          "inner star",
          "download",
          "link in bio",
          "promo",
          "empowerment",
          "stars",
          "2026"
        ]
      }
    },
    {
      "id": "2GZM7wOHFcg",
      "title": "Follow the carbon, find the money: Turning sustainability into financial value",
      "channel": "PwC US",
      "published_at": "2026-01-29T18:04:28.000Z",
      "url": "https://www.youtube.com/watch?v=2GZM7wOHFcg",
      "thumbnail": "https://i.ytimg.com/vi/2GZM7wOHFcg/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Rich Goode of PwC US argues that sustainability becomes actionable when carbon reduction is framed in financial terms business leaders understand. Translating emissions outcomes into cost savings and business value—and grounding decisions in carbon accounting basics—helps secure alignment, investment, and results.",
        "bullets": [
          "Sustainability resonates when expressed in business and financial terms.",
          "A ton of carbon is abstract; dollar impacts are tangible for leaders.",
          "Linking emissions reductions to cost savings and business value drives action.",
          "Understanding carbon accounting fundamentals is essential for credible metrics.",
          "Communicate sustainability as business value to gain alignment and investment."
        ],
        "takeaways": [
          "Quantify emissions reductions in financial terms to prioritize capex and operational projects.",
          "Embed carbon accounting basics into decision processes to make sustainability metrics actionable.",
          "Use a business-value framing to secure budget and executive support for decarbonization initiatives.",
          "Translate emissions outcomes into measurable cost savings to demonstrate ROI and drive implementation."
        ],
        "tags": [
          "sustainability",
          "carbon accounting",
          "carbon reduction",
          "financial value",
          "ESG",
          "decarbonization",
          "PwC",
          "leadership",
          "emissions",
          "corporate strategy"
        ]
      }
    },
    {
      "id": "BYtYm-xyKR8",
      "title": "Bringing In $251K A Year With 3 Jobs In The Bay Area",
      "channel": "CNBC Make It",
      "published_at": "2026-01-29T17:47:46.000Z",
      "url": "https://www.youtube.com/watch?v=BYtYm-xyKR8",
      "thumbnail": "https://i.ytimg.com/vi/BYtYm-xyKR8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Naseema McElroy, 44, is a labor and delivery nurse in Brentwood, California who brings in $251K a year by working three jobs and running a personal finance brand. She amassed nearly $1 million in debt by 2015, launched Financially Intentional to document her debt-payoff journey, and was debt-free by 2017.",
        "bullets": [
          "Naseema McElroy is a 44-year-old labor and delivery nurse based in Brentwood, CA.",
          "She earns $251K annually through three jobs in the Bay Area and runs the personal finance brand Financially Intentional.",
          "In 2015 she had nearly $1 million in debt and began documenting her payoff process publicly.",
          "By 2017 she had paid off her debt and continued sharing financial content.",
          "This profile is part of CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "Employees in high-cost regions may hold multiple jobs to reach income targets — staffing and scheduling models should account for staff with nonstandard work arrangements.",
          "Large personal debt burdens can exist among skilled workers (example: nearly $1M) — financial-wellness benefits could help reduce stress and turnover risk.",
          "Staff may operate side businesses that affect availability and skills — review HR moonlighting and conflict-of-interest policies for clarity.",
          "Providing or promoting financial-literacy resources can produce measurable improvements in employee financial health, as shown by the documented debt-payoff timeline."
        ],
        "tags": [
          "Naseema McElroy",
          "Financially Intentional",
          "debt payoff",
          "labor and delivery nurse",
          "Bay Area",
          "multiple jobs",
          "personal finance",
          "CNBC Make It",
          "Millennial Money",
          "Brentwood CA"
        ]
      }
    },
    {
      "id": "t6y2cVNjCAw",
      "title": "GeForce Garage - Summer of RTX Community Build",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-29T14:01:25.000Z",
      "url": "https://www.youtube.com/watch?v=t6y2cVNjCAw",
      "thumbnail": "https://i.ytimg.com/vi/t6y2cVNjCAw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, GeForce Garage showcases the winner of the Summer of RTX r/buildapc Community Build, u/JeffersonPutnam, who built a small-form-factor GeForce RTX 5090 rig in a Fractal Design Era 2. The video notes host Dwight and links a full PCPartPicker parts list for the winning system.",
        "bullets": [
          "Winner: u/JeffersonPutnam — SFF community build for NVIDIA's Summer of RTX contest.",
          "Chassis/GPU: Fractal Design Era 2 with a GeForce RTX 5090 Founders Edition.",
          "Key components: MSI MPG B850I Edge (mini-ITX), Ryzen 7 9800X3D, 32GB Teamgroup T-Create DDR5-6000.",
          "Power & cooling: Corsair SF1000 SFX PSU and Corsair Nautilus 240 RS AIO.",
          "PCPartPicker link and GeForce social channels provided for full specs and follow-up."
        ],
        "takeaways": [
          "The build pairs a GeForce RTX 5090 with a 1000W SFX PSU and a 240mm AIO—plan for substantial power delivery and liquid cooling when evaluating similar high-end GPUs.",
          "A mini-ITX platform (MSI MPG B850I Edge) plus compact chassis demonstrates that high-performance consumer GPUs can be integrated into small footprints—account for space and thermal constraints.",
          "The PCPartPicker parts list is provided for exact component specs and compatibility checks—use it for procurement and system-integration verification."
        ],
        "tags": [
          "GeForceGarage",
          "SummerOfRTX",
          "RTX5090",
          "SFF",
          "buildapc",
          "NVIDIA",
          "GeForce",
          "PCBuild",
          "Ryzen",
          "DDR5"
        ]
      }
    },
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy AI solutions, unlocking entirely new revenue streams while streamlining operations. The company leveraged GenAI and Google Cloud's robust infrastructure to boost developer productivity and compress their digital transformation timeline.",
        "bullets": [
          "TTEC teamed with Google Cloud Consulting to accelerate AI solution development and deployment.",
          "Rapid prototyping and GenAI use unlocked new revenue streams for TTEC.",
          "Google Cloud's robust infrastructure supported operational streamlining.",
          "Developer productivity was improved through the cloud and GenAI tooling.",
          "Consulting support compressed TTEC's digital transformation timeline and expanded business ambitions."
        ],
        "takeaways": [
          "Investing in cloud infrastructure that supports GenAI can enable new revenue opportunities.",
          "Engaging cloud consulting can significantly shorten prototyping and transformation timelines.",
          "Managed cloud platforms and GenAI tooling can boost developer productivity and operational efficiency.",
          "Scalable, robust cloud infrastructure allows organizations to expand their business ambitions without lengthy internal ramp-up."
        ],
        "tags": [
          "googlecloud",
          "ttec",
          "genai",
          "aideployment",
          "operationalefficiency",
          "customerexperience",
          "googlecloudplatform",
          "generativeai"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video follows Jo discovering how Copilot Groups makes route planning easier. It highlights Copilot Groups as a Microsoft Copilot feature positioned to simplify routing tasks.",
        "bullets": [
          "Route planning made easy (per description).",
          "Jo discovers the power of Copilot Groups.",
          "Highlights Copilot Groups as a feature of Microsoft Copilot.",
          "Includes hashtags: #copilot #microsoftcopilot #ai"
        ],
        "takeaways": [
          "Copilot Groups is presented as a tool for route planning, which may be relevant for operations that involve routing.",
          "Grid and data center teams responsible for field scheduling or technician routes might evaluate Copilot Groups for routing support.",
          "Track Microsoft Copilot updates to see how Copilot Groups evolves for practical logistics and routing workflows."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "copilot-groups",
          "route-planning",
          "routing",
          "logistics",
          "field-operations"
        ]
      }
    }
  ]
}