{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-22T15:57:18.193Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "IKkVWKdumHw",
      "title": "re:Invent 2025 - Chalk Talk - Origin management for multi-region applications with Amazon CloudFront",
      "channel": "AWS Events",
      "published_at": "2026-01-22T08:10:48.000Z",
      "url": "https://www.youtube.com/watch?v=IKkVWKdumHw",
      "thumbnail": "https://i.ytimg.com/vi/IKkVWKdumHw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this session covers origin management with Amazon CloudFront to build secure, resilient multi-region content delivery systems. Topics include automatic failover with CloudFront and Route 53, granular origin routing with CloudFront Functions, securing origins (S3 with Origin Access Control and VPC private origins), hybrid integration via AWS Direct Connect, and using Origin Shield to optimize cache performance.",
        "bullets": [
          "Automatic failover using CloudFront combined with Route 53",
          "Granular origin routing implemented with CloudFront Functions",
          "Secure origins using S3 with Origin Access Control (OAC) and VPC private origins",
          "Integrate on-premises infrastructure through AWS Direct Connect for hybrid setups",
          "Deploy Origin Shield to improve cache performance and reduce origin load"
        ],
        "takeaways": [
          "Increase resilience: automatic failover helps minimize downtime for multi-region delivery",
          "Tighten security: OAC and VPC private origins reduce direct exposure of backend assets",
          "Support hybrid deployments: Direct Connect enables reliable integration of on-prem systems with CloudFront",
          "Lower origin load and improve performance: Origin Shield optimizes cache behavior at the edge"
        ],
        "tags": [
          "CloudFront",
          "Origin Management",
          "Route53",
          "CloudFront Functions",
          "Origin Shield",
          "S3 OAC",
          "VPC Private Origins",
          "AWS Direct Connect",
          "Multi-region",
          "Hybrid Architecture"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… KPMG practitioners discuss how AI is already integrated into audit work, automating repetitive tasks, analysing full data populations and supporting decision-making. The episode outlines specific tools (AI Transaction Scoring Tool, Clara AI, KPMG Clara), the shift from sampling to full-population analysis, impacts on auditor skills, implementation challenges, and data/security and regulatory considerations.",
        "bullets": [
          "AI tools enable analysis of full populations instead of traditional sampling.",
          "Clara AI offers conversational assistance and specialised agents for audit tasks.",
          "KPMG Clara provides real‑time management of the audit and client communication (Clara for Clients).",
          "AI supports documentation and disclosure analysis, speeding repetitive work.",
          "Discussion includes auditor role changes, adoption challenges, data security and regulatory issues."
        ],
        "takeaways": [
          "Expect auditors to request broader, more detailed access to operational and transactional data as full‑population analysis becomes standard.",
          "Ensure data quality, availability and traceability to support AI‑driven audit processes and reduce delays.",
          "Prioritise data security and regulatory compliance when sharing datasets or deploying AI tools that interact with audit workflows.",
          "Prepare for faster audit cycles and more automated reporting as AI reduces manual, repetitive tasks.",
          "Engage with auditors early on data formats, access controls and upskilling needs to smooth AI implementation and minimise disruption."
        ],
        "tags": [
          "AI",
          "audit",
          "KPMG",
          "KPMGClara",
          "ClaraAI",
          "transaction-scoring",
          "data-security",
          "audit-innovation",
          "full-population-analysis"
        ]
      }
    },
    {
      "id": "t33Fh1JZVgA",
      "title": "AI at Speed: From Investment to Performance",
      "channel": "PwC US",
      "published_at": "2026-01-21T22:48:29.000Z",
      "url": "https://www.youtube.com/watch?v=t33Fh1JZVgA",
      "thumbnail": "https://i.ytimg.com/vi/t33Fh1JZVgA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… PwC US Senior Partner and CEO Paul Griggs speaks with CNBC’s Emma Crosby at the 2026 World Economic Forum in Davos about how organizations are shifting from AI exploration to execution, evaluating initiatives through investment discipline, performance, and measurable value. They discuss that leading organizations move early, allocate capital with clear intent, and design operating models that stay resilient without sacrificing performance as AI delivers measurable outcomes today and supports future transformation.",
        "bullets": [
          "AI evaluation is shifting from experimentation to investment discipline and measurable value.",
          "Leading organizations are moving early and allocating capital with clear intent.",
          "Operating models are being designed for resilience while maintaining performance.",
          "AI is already delivering measurable outcomes and enabling longer-term transformation.",
          "Discussion took place at the 2026 World Economic Forum in Davos with PwC and CNBC."
        ],
        "takeaways": [
          "Prioritize AI investments with clear ROI metrics to justify capital allocation for data center upgrades.",
          "Design infrastructure and operations to balance resilience (uptime, reliability) with performance needs of AI workloads.",
          "Move early on strategic AI deployments to secure capacity and cost advantages in grid and data center planning.",
          "Track measurable outcomes from AI projects to inform future investment and scaling decisions."
        ],
        "tags": [
          "AI",
          "investment",
          "performance",
          "measurable outcomes",
          "operating models",
          "resilience",
          "Davos2026",
          "PwC"
        ]
      }
    },
    {
      "id": "6hu7hYLiu08",
      "title": "Get Step-By-Step Fixes with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-21T20:14:00.000Z",
      "url": "https://www.youtube.com/watch?v=6hu7hYLiu08",
      "thumbnail": "https://i.ytimg.com/vi/6hu7hYLiu08/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Copilot provides real-time visual support for home projects and repairs, offering step-by-step instructions based on what it sees. The description cites examples like leaky pipes and overflowing washing machines and emphasizes clear, actionable guidance.",
        "bullets": [
          "Real-time support using visual input from the user.",
          "Delivers step-by-step instructions for repairs and projects.",
          "Examples given: leaky pipes and overflowing washing machines.",
          "Aims to provide clear, actionable guidance for home repairs."
        ],
        "takeaways": [
          "Given Copilot's real-time visual, step-by-step guidance, it could be evaluated for remote troubleshooting workflows to reduce onsite visits.",
          "Standardized instructions may help ensure consistent repair procedures and reduce human error during maintenance tasks.",
          "Faster, guided resolution of routine issues could shorten downtime for equipment and facilities when applied to operational contexts.",
          "Consider piloting visual-guided assistance for routine maintenance training to accelerate onboarding of technical staff."
        ],
        "tags": [
          "Copilot",
          "real-time",
          "visual-assistance",
          "step-by-step",
          "home-repairs",
          "plumbing",
          "appliances",
          "troubleshooting",
          "remote-support",
          "Microsoft"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer - Launching January 22!",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Arknights: Endfield is scheduled for worldwide release on January 22 and is described as a 3D real-time strategy RPG in which you play the Endministrator exploring Talos-II. The trailer highlights NVIDIA DLSS 4 with Multi Frame Generation and was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 Multi Frame Generation 4X Mode.",
        "bullets": [
          "Worldwide launch date: January 22.",
          "Game type: 3D real-time strategy RPG (role: Endministrator of Endfield Industries).",
          "Trailer showcases NVIDIA DLSS 4 with Multi Frame Generation.",
          "Captured footage recorded on GeForce RTX 5080 at 4K Ultra, DLSS 4 MFG 4X Mode.",
          "Official links provided for the game and social channels."
        ],
        "takeaways": [
          "The launch emphasizes DLSS 4 MFG—reproducing trailer-grade capture or testing requires hardware supporting DLSS 4 (example used: GeForce RTX 5080).",
          "4K Ultra capture with DLSS 4 MFG 4X Mode indicates use of high-end GPU configurations for marketing and benchmarking.",
          "Teams provisioning capture/streaming rigs should verify GeForce/DLSS 4 compatibility to mirror advertised visual modes.",
          "Refer to the provided NVIDIA and Arknights: Endfield links for official technical and deployment details."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "RTX5080",
          "NVIDIA",
          "GeForce",
          "4K",
          "RTS",
          "GameLaunch",
          "Gaming"
        ]
      }
    },
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video shows how Rate Insurance boosts agent efficiency using Agentforce and Gemini and directs viewers to the Google Cloud and Salesforce partnership link. It presents a brief showcase of that solution in action and provides a link for more partnership details.",
        "bullets": [
          "Highlights Rate Insurance improving agent efficiency with Agentforce and Gemini.",
          "References the Google Cloud and Salesforce partnership (link provided).",
          "Positions the content as a watchable demonstration of the solution in use.",
          "Invites viewers to learn more via the provided partnership URL."
        ],
        "takeaways": [
          "Note the Google Cloud–Salesforce partnership highlighted—consider vendor interoperability when evaluating platforms.",
          "If exploring similar agent-efficiency solutions, verify compatibility with Google Cloud and Salesforce integrations referenced.",
          "Review infrastructure, capacity, and security implications for deploying partner solutions like Agentforce and Gemini.",
          "Factor partnership-based support and integration pathways into procurement and operational planning."
        ],
        "tags": [
          "Google Cloud",
          "Salesforce",
          "Rate Insurance",
          "Agentforce",
          "Gemini",
          "agent efficiency",
          "cloud partnership",
          "insurance"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Charly Stoever, 35, is a financial coach who has spent the last 18 months living out of two suitcases and pet sitting full time to live rent-free in Portland, Oregon while earning about $60,000 a year. The video is part of CNBC Make It's Millennial Money series profiling how people earn, spend and save their money.",
        "bullets": [
          "Charly Stoever, 35, is a financial coach.",
          "Lives rent-free in Portland by pet sitting full time.",
          "Has been traveling and living out of two suitcases for 18 months.",
          "Brings in about $60,000 per year from this arrangement.",
          "Video is an installment of CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "Workforce mobility: growing preference for flexible, low‑fixed‑cost lifestyles may increase geographic distribution of talent.",
          "Talent strategy: consider flexible location policies and short‑term accommodations when recruiting gig‑economy professionals.",
          "Capacity planning: variable local population patterns could influence local energy and service demand—build flexibility into planning.",
          "Local staffing risk: alternative housing strategies may affect workforce stability near physical sites; factor this into site staffing models."
        ],
        "tags": [
          "pet-sitting",
          "rent-free",
          "financial-coach",
          "Portland",
          "travel",
          "minimalism",
          "CNBCMakeIt",
          "MillennialMoney",
          "$60k",
          "remote-lifestyle"
        ]
      }
    },
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Dr. Anna Chacon is a 39-year-old dermatologist in Miami, FL who runs her own private practice. Her net worth is about $6 million, composed of $3.2 million in investments, a $1.9 million home, and a $1.1 million office building.",
        "bullets": [
          "Dr. Anna Chacon, age 39, practices dermatology in Miami, FL.",
          "She operates a private practice and owns an office building.",
          "Total net worth reported at approximately $6 million.",
          "Net worth breakdown: $3.2M investments, $1.9M home, $1.1M office building."
        ],
        "takeaways": [
          "The profile includes ownership of a $1.1M office building — a commercial asset that represents localized commercial space and associated infrastructure needs.",
          "A $1.9M primary residence is listed — residential assets coexist with commercial assets in the same local market.",
          "Substantial investments ($3.2M) are part of the financial profile — indicative of high personal capital holdings among potential local customers or stakeholders.",
          "Combined residential and commercial asset ownership in an urban area (Miami) points to mixed local demand patterns that can inform capacity and reliability planning."
        ],
        "tags": [
          "dermatologist",
          "Miami",
          "private practice",
          "net worth",
          "real estate",
          "investments",
          "office building",
          "personal finance",
          "wealth",
          "CNBC Make It"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This giant bubble of carbon dioxide can store 20 megawatts of energy. The description says these batteries are intended to smooth fluctuations from renewable energy and help power a global shift to clean energy.",
        "bullets": [
          "Giant carbon dioxide bubble stores 20 megawatts of energy.",
          "Designed to address variability in renewable energy supply.",
          "Positioned as a tool to enable a global transition to clean energy.",
          "Video description promoted with tags like #ieee and #innovation."
        ],
        "takeaways": [
          "20 MW storage capacity indicates potential relevance for large-scale grid or facility applications.",
          "Could be used to buffer intermittency from renewables and improve supply reliability.",
          "May help organizations meet clean-energy objectives by storing renewable output for later use.",
          "Further technical and economic evaluation would be needed before considering deployment."
        ],
        "tags": [
          "ieee",
          "tech",
          "ieeespectrum",
          "innovation",
          "future",
          "futuristic",
          "energy",
          "battery",
          "co2"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, a KPMG ON AIR podcast episode with Monika Palmowska and Jakub Roszkiewicz reviews how AI is already affecting transfer pricing—from monitoring profitability and benchmarking to automating documentation—and how it can support, rather than replace, tax advisors. The discussion also covers risks (data security, RODO, hallucinations), secure environments like Digital Gateway, ERP integration, and recommended first steps such as process organization and staff upskilling.",
        "bullets": [
          "AI applications in transfer pricing: monitoring rentowności, comparative analyses, and documentation automation.",
          "AI is positioned as an augmenting tool for advisors, not a replacement.",
          "Key risks highlighted: data quality, security, privacy (RODO) and AI hallucinations.",
          "Secure solutions (Digital Gateway) and ERP integration are important enablers.",
          "Implementation should start with process cleanup, defined personas and building competencies."
        ],
        "takeaways": [
          "Ensure strict data governance and RODO-compliant controls before exposing pricing data to AI.",
          "Provide secure, isolated environments (e.g., Digital Gateway-style solutions) for AI workloads to limit security and hallucination risks.",
          "Prioritize ERP integration and clean benchmark data to make AI-driven monitoring and automation effective.",
          "Begin AI projects by streamlining processes and defining user personas; invest in upskilling junior staff so AI augments internal capabilities.",
          "Automating documentation can reduce manual workload and accelerate reporting, but must be paired with compliance safeguards."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "transfer pricing",
          "podatki",
          "automatyzacja",
          "RODO",
          "Digital Gateway",
          "ERP",
          "benchmarki",
          "KPMG"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video presents Copilot as a way to keep momentum when working on workouts, projects, or personal goals. It frames Copilot as support for sustaining progress across different activities.",
        "bullets": [
          "Targets workouts, projects, and personal goals",
          "Emphasizes keeping momentum",
          "Positions Copilot as support for ongoing progress",
          "Short, motivational message"
        ],
        "takeaways": [
          "Break large initiatives into smaller milestones to preserve momentum during long grid or data center projects.",
          "Use tools that encourage incremental progress to keep engineering and operations teams engaged through multi-phase rollouts.",
          "Incorporate Copilot into training and adoption efforts to help staff make steady skill and process improvements.",
          "Frame deployments and upgrades as a series of achievable wins to maintain stakeholder confidence and visibility."
        ],
        "tags": [
          "Copilot",
          "Microsoft Copilot",
          "momentum",
          "productivity",
          "motivation",
          "workouts",
          "projects",
          "personal goals"
        ]
      }
    }
  ]
}