{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-27T17:51:00.143Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "5CyVBSbHmbA",
      "title": "Year-end toolkit: Strengthening audit committee collaboration",
      "channel": "PwC US",
      "published_at": "2026-01-27T17:20:31.000Z",
      "url": "https://www.youtube.com/watch?v=5CyVBSbHmbA",
      "thumbnail": "https://i.ytimg.com/vi/5CyVBSbHmbA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this PwC episode is part of a year-end toolkit series that focuses on strengthening collaboration between finance teams and audit committees during the year-end accounting and reporting process. It reviews communication and reporting best practices and addresses emerging oversight topics including AI, enterprise risk management, cyber risk, and proxy disclosures.",
        "bullets": [
          "Strategies to improve management and audit committee communication and collaboration.",
          "Key year-end accounting and reporting issues finance teams should anticipate.",
          "Oversight considerations for AI: risks, opportunities, and controls.",
          "Enhancing enterprise risk oversight and navigating evolving cyber risks in the AI era.",
          "Guidance on elevating proxy disclosures for governance transparency."
        ],
        "takeaways": [
          "Ensure clear, timely communication with your audit committee about year‑end reporting and major initiatives to reduce surprises and accelerate decision-making.",
          "Prepare documentation and controls around AI deployments so auditors and governance bodies can assess risk, accuracy, and accountability.",
          "Integrate cyber risk and AI-related scenarios into enterprise risk management and board reporting given their increasing oversight importance.",
          "Highlight transformation initiatives and their financial/reporting impacts in year‑end disclosures to support audit committee review and investor transparency."
        ],
        "tags": [
          "audit-committee",
          "year-end",
          "financial-reporting",
          "AI-oversight",
          "enterprise-risk",
          "cyber-risk",
          "proxy-disclosures",
          "governance",
          "PwC"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… the video highlights how Copilot Groups can simplify route planning as Jo discovers the feature. It frames Copilot as a tool for easier planning and collaboration and uses tags linking it to Copilot, Microsoft Copilot, and AI.",
        "bullets": [
          "Transcript not available; description focuses on route planning and Copilot Groups.",
          "Feature spotlight: Jo discovers the power of Copilot Groups.",
          "Main message: route planning made easy.",
          "Tags included: #copilot #microsoftcopilot #ai"
        ],
        "takeaways": [
          "If route planning is part of your operations, consider evaluating Copilot Groups for potential workflow simplification.",
          "Pilot Copilot Groups in a limited scope (e.g., specific routes or teams) to assess operational fit and benefits.",
          "Verify integration, security, and compliance requirements before broader adoption.",
          "Measure effects on coordination and scheduling to determine ROI and potential scale-up."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "route-planning",
          "copilot-groups",
          "productivity",
          "demo",
          "routing"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, KPMG ON AIR hosts Katarzyna Chojniak and Alicja Barska discussing how AI is already embedded in audit work—supporting repetitive tasks, analysing full populations of data, improving documentation and client communication via tools like AI Transaction Scoring Tool, Clara AI and the KPMG Clara platform. They also cover the impact on auditors’ roles, required competencies, implementation challenges, data security and regulatory concerns.",
        "bullets": [
          "AI tools enable analysis of entire populations instead of sampling (AI Transaction Scoring Tool).",
          "Clara AI provides conversational assistance and specialised agent support for auditors.",
          "KPMG Clara platform supports real-time audit management and Clara for Clients improves client communication.",
          "AI helps with documentation and disclosure analysis, changing auditors’ daily tasks and required skills.",
          "Discussion addresses implementation challenges, data security and regulatory environment."
        ],
        "takeaways": [
          "Expect audits to use full-population analytics—plan for auditors accessing larger sets of digital records.",
          "Real-time audit platforms imply closer, faster interaction between your systems and audit teams—ensure integration and uptime.",
          "Prioritise data security, access controls and compliance readiness given focus on AI and regulatory considerations."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMG",
          "KPMG Clara",
          "Clara AI",
          "analiza danych",
          "bezpieczeństwo danych",
          "innowacje w audycie"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Arknights: Endfield has launched and the trailer highlights NVIDIA DLSS 4 with Multi Frame Generation. The game is a 3D real-time strategy RPG where players take the role of the Endministrator on Talos-II; the trailer was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 Multi Frame Generation 4X Mode.",
        "bullets": [
          "Official launch of Arknights: Endfield announced.",
          "Trailer showcases NVIDIA DLSS 4 with Multi Frame Generation (4X Mode).",
          "Game described as a 3D real-time strategy RPG set on Talos-II.",
          "Footage captured on GeForce RTX 5080 at 4K Ultra settings.",
          "Links provided for the game site and social channels."
        ],
        "takeaways": [
          "DLSS 4 Multi Frame Generation is being used for real-time 4K game rendering—systems must support DLSS 4-capable GPUs to reproduce this mode.",
          "Demonstration on an RTX 5080 indicates high-end GPU hardware is used for 4K Ultra capture and advanced frame-generation features.",
          "Deployments intended to showcase similar visuals should ensure up-to-date drivers and NVIDIA feature support for DLSS integration.",
          "Content capture or streaming workflows targeting this quality should plan for increased GPU compute and memory capacity."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "NVIDIA",
          "RTX5080",
          "4K",
          "RealTimeRPG",
          "GeForce",
          "GameLaunch"
        ]
      }
    }
  ]
}