{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-20T04:22:24.973Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Dr. Anna Chacon, 39, is a Miami-based dermatologist who runs her own private practice and earns $900,000 a year. Her net worth is about $6 million, made up of $3.2 million in investments, a $1.9 million home, and a $1.1 million office building.",
        "bullets": [
          "Age/location: 39, Miami, FL",
          "Profession: Dermatologist with a private practice",
          "Annual income reported: $900,000",
          "Net worth: ~$6 million",
          "Asset breakdown: $3.2M investments, $1.9M home, $1.1M office building"
        ],
        "takeaways": [
          "Owner-operated medical offices (e.g., a $1.1M office building) represent commercial real estate occupants with potential, stable infrastructure needs.",
          "High-earning medical professionals with owned office space may be relevant targets for services tied to facility reliability and resiliency.",
          "Investment-backed personal wealth and real estate ownership in urban markets like Miami could correlate with localized demand for commercial power and connectivity solutions."
        ],
        "tags": [
          "dermatologist",
          "private practice",
          "Miami",
          "high income",
          "net worth",
          "investments",
          "real estate",
          "office building",
          "CNBC Make It",
          "2026"
        ]
      }
    },
    {
      "id": "6L86-OnOXV0",
      "title": "How I Built A $1M/Year Business - And Helped My Parents Retire",
      "channel": "CNBC Make It",
      "published_at": "2026-01-17T15:00:09.000Z",
      "url": "https://www.youtube.com/watch?v=6L86-OnOXV0",
      "thumbnail": "https://i.ytimg.com/vi/6L86-OnOXV0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Tuan Le emigrated from Vietnam to Toronto and vowed at 15 to help his parents retire. Ten years later his social video production company, ShortsCut, brings in over $1 million USD a year in sales, and he now pays his parents' rent and living expenses so they no longer have to work full time.",
        "bullets": [
          "Tuan Le moved from Vietnam to Toronto and made a personal vow at age 15 to help his parents retire.",
          "He founded ShortsCut, a social video production company.",
          "ShortsCut generates over $1 million USD in annual sales.",
          "Tuan now covers his parents' rent and living expenses, allowing them to stop full‑time work.",
          "Video produced by CNBC Make It with production credits listed in the description."
        ],
        "takeaways": [
          "A social video production company can scale to seven‑figure annual revenue—data centers should recognize media production as a high‑value client segment.",
          "High‑volume video businesses imply demand for large, scalable storage and high bandwidth for content delivery.",
          "Reliable uptime and strong SLAs matter for creators whose income and livelihoods depend on continuous digital operations.",
          "Offering media‑optimized services (CDN integration, burst bandwidth, durable storage) can attract growing digital production firms."
        ],
        "tags": [
          "TuanLe",
          "ShortsCut",
          "socialvideo",
          "entrepreneur",
          "immigrantfounder",
          "CNBCMakeIt",
          "howimadeit",
          "1Mannualrevenue",
          "parentsretire"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, a giant bubble of carbon dioxide is presented as a battery that can store 20 megawatts of energy. The description frames this storage approach as a way to manage fluctuating renewable supply and to help power a global shift to clean energy.",
        "bullets": [
          "Giant carbon dioxide 'bubble' battery stores 20 megawatts of energy.",
          "Aimed at addressing fluctuations in renewable energy resources.",
          "Positioned as a technology to support the global transition to clean energy.",
          "Content tagged with IEEE Spectrum and technology/innovation themes."
        ],
        "takeaways": [
          "20 MW storage capacity cited — consider evaluating such scale for grid balancing and backup needs.",
          "Technology is presented as a tool to mitigate renewable variability; assess how it might fit into your energy mix.",
          "Explore integration and operational implications for large-capacity storage solutions that support decarbonization goals."
        ],
        "tags": [
          "ieee",
          "tech",
          "ieeespectrum",
          "innovation",
          "future",
          "futuristic",
          "energy",
          "battery",
          "carbon-dioxide"
        ]
      }
    },
    {
      "id": "OINppmPan0o",
      "title": "Figure Skating | Making Team USA presented by Xfinity with Apolo Ohno",
      "channel": "Team USA",
      "published_at": "2026-01-16T19:30:36.000Z",
      "url": "https://www.youtube.com/watch?v=OINppmPan0o",
      "thumbnail": "https://i.ytimg.com/vi/OINppmPan0o/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, figure skating duo Vadym Kolesnik and Emilia Zingas sit down with Apolo Ohno on an episode of Making Team USA presented by Xfinity to discuss their partnership and preparations ahead of the Winter Olympics. The episode highlights that their collaboration is \"built on trust.\"",
        "bullets": [
          "Vadym Kolesnik and Emilia Zingas interview with Apolo Ohno.",
          "Episode is part of Making Team USA presented by Xfinity.",
          "Conversation occurs ahead of the Winter Olympics.",
          "Theme emphasized: \"Built on trust.\"",
          "Team USA channel links and social follow prompts included."
        ],
        "takeaways": [
          "Emphasize trust and clear communication within operations teams to support complex, time-sensitive activities.",
          "Confirm and test partnerships with service providers (network, connectivity, sponsors) before major events to ensure reliability.",
          "Run rehearsals and contingency drills ahead of peak-demand events to reduce risk of failure.",
          "Use coordinated public channels for stakeholder updates and monitoring during high-profile events."
        ],
        "tags": [
          "figure skating",
          "Vadym Kolesnik",
          "Emilia Zingas",
          "Apolo Ohno",
          "Winter Olympics",
          "Making Team USA",
          "Xfinity",
          "trust",
          "Team USA"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Eksperci KPMG dyskutują, jak AI już teraz zmienia podejście do cen transferowych — od monitorowania rentowności i benchmarków po automatyzację dokumentacji. Omawiają też ograniczenia i ryzyka (dane, bezpieczeństwo, RODO, halucynacje), rolę doradców jako wspieranych przez AI oraz praktyczne kroki wdrożeniowe, w tym integrację z ERP i potrzebę uporządkowania procesów.",
        "bullets": [
          "AI wspiera monitoring rentowności, analizy porównawcze i automatyzację dokumentacji cen transferowych.",
          "Sztuczna inteligencja ma wzmocnić pracę doradców, a nie ich zastąpić.",
          "Główne ryzyka: jakość danych, bezpieczeństwo, zgodność z RODO i problem halucynacji AI.",
          "Digital Gateway wskazany jako bezpieczne środowisko do pracy z AI.",
          "Wdrożenie: zacząć od uporządkowania procesów, potem integracja z ERP i inteligentne benchmarki."
        ],
        "takeaways": [
          "Zastosowanie AI w cenach transferowych może zwiększyć precyzję monitoringu i benchmarków, co wpływa na alokację kosztów za usługi infrastrukturalne.",
          "Integracja AI z ERP umożliwia wykorzystanie operacyjnych danych z centrum danych do bardziej trafnych analiz transfer pricingu.",
          "Priorytetem jest bezpieczeństwo danych i zgodność z RODO — rozważenie bezpiecznych środowisk (np. Digital Gateway) przed wdrożeniem.",
          "Skuteczne wdrożenie wymaga najpierw uporządkowania procesów i danych, dopiero potem narzędzi AI."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "podatki",
          "automatyzacja",
          "ERP",
          "Digital Gateway",
          "RODO",
          "bezpieczeństwo danych",
          "benchmarking",
          "KPMG"
        ]
      }
    },
    {
      "id": "dGfcT63U7Mo",
      "title": "The 2026 U.S. Olympic Figure Skating Team 🇺🇸",
      "channel": "Team USA",
      "published_at": "2026-01-15T20:43:24.000Z",
      "url": "https://www.youtube.com/watch?v=dGfcT63U7Mo",
      "thumbnail": "https://i.ytimg.com/vi/dGfcT63U7Mo/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This short post presents the U.S. Olympic figure skating lineup and highlights the team with an enthusiastic tone (🔥). The description includes the hashtag #WinterOlympics and otherwise provides no additional details.",
        "bullets": [
          "Announces the U.S. Olympic figure skating lineup.",
          "Description uses an excited emoji (🔥).",
          "Includes the hashtag #WinterOlympics.",
          "No athlete names or further details are provided in the description."
        ],
        "takeaways": [
          "Content is Olympic-focused (hashtag #WinterOlympics) — expect higher attention around Olympic windows and plan monitoring during those periods.",
          "Announcement-style posts can drive short traffic spikes; ensure CDN and caching are optimized for brief surges.",
          "Keep logging and analytics ready to capture engagement metrics for high-profile sports content.",
          "Prepare fallback delivery and scale policies for brief, high-visibility posts to maintain performance."
        ],
        "tags": [
          "U.S. Olympic",
          "Figure Skating",
          "Lineup",
          "WinterOlympics",
          "Olympics",
          "Announcement",
          "Sports",
          "Skating"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video encourages using Microsoft Copilot to keep momentum when working on workouts, projects, or personal goals. It highlights the idea of stacking small wins to sustain progress.",
        "bullets": [
          "Promotes using Copilot to maintain forward momentum.",
          "Applies across workouts, projects, and personal goals.",
          "Emphasizes stacking small wins to drive ongoing progress."
        ],
        "takeaways": [
          "If applied to data center initiatives, the principle suggests breaking large programs into smaller, trackable wins to keep teams motivated and moving forward.",
          "Consider framing operational tasks (upgrades, maintenance, migrations) as a sequence of small milestones to preserve momentum across projects.",
          "Using Copilot as a regular assistant for routine steps could help maintain consistency and incremental progress without relying on big, infrequent pushes."
        ],
        "tags": [
          "Microsoft Copilot",
          "productivity",
          "small wins",
          "momentum",
          "projects",
          "workouts",
          "personal goals",
          "goal-setting",
          "task-management"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights the critical role of precision and speed in high-frequency trading. It showcases the Dell PowerEdge R770AP server powered by Intel® Xeon® 6 processors as a platform that helps execute hundreds of trades in seconds to maximize gains and minimize losses, positioning Intel Xeon 6 CPUs as shaping the future of finance.",
        "bullets": [
          "Focus on low-latency, high-precision compute for high-frequency trading (HFT).",
          "Spotlight on Dell PowerEdge R770AP server as the showcased hardware platform.",
          "Powered by Intel® Xeon® 6 processors for high-performance trading workloads.",
          "Claims support for executing hundreds of trades in seconds.",
          "Frames Intel Xeon 6 CPUs as defining the future of finance."
        ],
        "takeaways": [
          "Prioritize low-latency, high-throughput server platforms for HFT workloads to influence trading outcomes.",
          "Evaluate Dell PowerEdge R770AP with Intel Xeon 6 CPUs when specifying hardware for latency-sensitive financial applications.",
          "Capacity to handle hundreds of trades per second suggests sizing and networking must support sub-second orchestration and throughput."
        ],
        "tags": [
          "high-frequency-trading",
          "HFT",
          "Intel-Xeon-6",
          "Dell-PowerEdge-R770AP",
          "low-latency",
          "financial-tech",
          "data-center",
          "servers"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video says the creative spark was out and Copilot brought it back to life. It invites viewers to download Copilot and try it via the link in the bio.",
        "bullets": [
          "Creative spark was out.",
          "Copilot brought creativity back to life.",
          "Call to action to download Copilot.",
          "Try it via the link in the bio."
        ],
        "takeaways": [
          "If team creativity or ideation is a priority, consider trialing Copilot to see if it helps.",
          "Use the download link in the bio to run a quick evaluation with relevant users.",
          "Decide based on a short hands-on trial whether Copilot fits your workflows and needs."
        ],
        "tags": [
          "Copilot",
          "creativity",
          "ai",
          "Microsoft",
          "download",
          "link-in-bio",
          "creative-spark",
          "try-now"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video showcases the open-world martial arts RPG Where Winds Meet running with DLSS 4 featuring Multi Frame Generation and #RTXOn. Footage is credited to @DigitalDreamsyt and invites viewers to experience the game with NVIDIA rendering tech.",
        "bullets": [
          "Open-world martial arts RPG: Where Winds Meet",
          "Highlights DLSS 4 with Multi Frame Generation",
          "Promotes gameplay with #RTXOn",
          "Footage credited to @DigitalDreamsyt"
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is featured — verify infrastructure compatibility with DLSS 4 SDKs and drivers before deployment.",
          "RTX-enabled content implies need for GPUs that support ray tracing and related NVIDIA features when planning capacity.",
          "Test real-world workloads (gameplay capture/streaming) that use DLSS/RTX to understand performance and resource impacts."
        ],
        "tags": [
          "WhereWindsMeet",
          "DLSS4",
          "MultiFrameGeneration",
          "RTXOn",
          "open-world",
          "martial-arts",
          "NVIDIA",
          "DigitalDreamsyt",
          "gaming"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This video is listed on the Intel Business channel and names Taha Khalifa (Intel) in the title. The Intel Business channel offers IT resources, guidance, and expert insights spanning data centers to devices and invites viewers to subscribe and connect via its website and social channels.",
        "bullets": [
          "Video title: Taha Khalifa (Intel) — no transcript available in the description.",
          "Intel Business positions itself as a source for IT resources, guidance, and expert insights from data centers to devices.",
          "Description includes links to subscribe and to Intel Business website, X (Twitter), LinkedIn, and Facebook.",
          "Viewers are encouraged to subscribe to the Intel Business YouTube channel for IT information.",
          "Direct visit to the Intel Business website is provided for more resources and guidance."
        ],
        "takeaways": [
          "Intel Business is a go-to channel for IT resources and guidance relevant to data center decision-makers.",
          "Use the provided Intel Business website link to find more detailed resources and guidance for infrastructure projects.",
          "Follow and subscribe to Intel Business on social platforms to stay updated on Intel’s IT content and expert insights.",
          "No transcript is available in the description, so decision-makers should view the video directly for any technical details or statements."
        ],
        "tags": [
          "Intel Business",
          "Taha Khalifa",
          "Intel",
          "data centers",
          "IT resources",
          "devices",
          "enterprise IT",
          "YouTube"
        ]
      }
    },
    {
      "id": "kSocjh8PZnQ",
      "title": "Rynek dóbr luksusowych w obliczu transformacji | Andrzej Marczak, Tomasz Wiśniewski",
      "channel": "KPMG Poland",
      "published_at": "2026-01-13T10:23:31.000Z",
      "url": "https://www.youtube.com/watch?v=kSocjh8PZnQ",
      "thumbnail": "https://i.ytimg.com/vi/kSocjh8PZnQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The KPMG ON AIR episode discusses current trends shaping the luxury goods market in Poland and globally, including a shift toward experiential luxury, growing importance of ESG, and the rise of \"affordable luxury.\" Guests Andrzej Marczak and Tomasz Wiśniewski also cover topics such as market concentration, Gen Z preferences, Poland's growing but fragmented market, luxury tourism and art, and future drivers like AI and craftsmanship.",
        "bullets": [
          "Global trends: 'luxury fatigue' and market concentration (2% of clients account for 40% of the market).",
          "Shift from ownership to experiences, with personalization and exclusive client experiences emphasized.",
          "ESG and responsible luxury (e.g., eco-leathers, certifications) rising in importance.",
          "Affordable-luxury and aspirational consumers creating new product categories.",
          "Poland: market still growing despite global declines; roles for luxury hotels, tourism, and the local art scene; future drivers include AI and craftsmanship."
        ],
        "takeaways": [
          "Assess infrastructure readiness for digital, personalized and AI-driven luxury experiences referenced in the episode.",
          "Factor ESG and sustainability requirements into operations and service offerings to meet responsible-luxury expectations.",
          "Monitor Polish market growth and its regional dispersion for targeted capacity and network planning.",
          "Explore partnerships with luxury hotels, tourism and cultural institutions mentioned as growing demand sources."
        ],
        "tags": [
          "luxury",
          "ESG",
          "Poland",
          "personalization",
          "affordable-luxury",
          "Gen-Z",
          "AI",
          "luxury-tourism",
          "art-market",
          "KPMG"
        ]
      }
    }
  ]
}