{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-31T14:49:35.232Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "ZSzEg7bYlAI",
      "title": "Caroline Harvey on the Cam",
      "channel": "Team USA",
      "published_at": "2026-01-31T13:22:24.000Z",
      "url": "https://www.youtube.com/watch?v=ZSzEg7bYlAI",
      "thumbnail": "https://i.ytimg.com/vi/ZSzEg7bYlAI/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this Team USA video is titled \"Caroline Harvey on the Cam\" and is presented with a playful caption: \"This is so Caroline Harvey coded 😂\". The post is tagged #WinterOlympics and no transcript is available.",
        "bullets": [
          "Title: \"Caroline Harvey on the Cam\"",
          "Channel: Team USA; Published: 2026-01-31T13:22:24.000Z",
          "No transcript available",
          "Description text: \"This is so Caroline Harvey coded 😂\"",
          "Includes hashtag: #WinterOlympics"
        ],
        "takeaways": [
          "Content tagged with major events (e.g., #WinterOlympics) can contribute to event-driven traffic spikes—ensure CDN and auto-scaling policies can handle sudden increases.",
          "Short, social-style posts often generate many small, frequent requests—optimize caching at the edge to reduce origin load.",
          "Monitor real-time social signals for major events so capacity can be adjusted proactively rather than reactively.",
          "Maintain strong observability and alerting for micro-burst traffic patterns typical of viral or event-related clips."
        ],
        "tags": [
          "Caroline Harvey",
          "Team USA",
          "WinterOlympics",
          "Cam",
          "humor",
          "social",
          "video",
          "sports",
          "short clip"
        ]
      }
    },
    {
      "id": "6B29VDvPPzc",
      "title": "Build Knowledge Graph-powered AI Agents For Your Use Case | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-31T06:10:50.000Z",
      "url": "https://www.youtube.com/watch?v=6B29VDvPPzc",
      "thumbnail": "https://i.ytimg.com/vi/6B29VDvPPzc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the session addresses the problem that general AI agents lack knowledge of a specific company and presents knowledge graphs as the solution. The presenters demonstrate an end-to-end build that automatically creates a knowledge graph from raw documents and connects it to an AI agent—no graph expertise required.",
        "bullets": [
          "AI agents often don't understand company-specific information; knowledge graphs can fix that.",
          "The session demonstrates automatic construction of a knowledge graph from raw documents.",
          "Shows connecting the knowledge graph to an AI agent so it can use business-specific knowledge.",
          "No prior graph query or graph theory expertise necessary.",
          "End-to-end demo intended to be practical and accessible."
        ],
        "takeaways": [
          "If you need agents that understand your organization, knowledge graphs are the practical solution shown here.",
          "Automating KG construction from raw documents lowers the time and skill barrier for adoption.",
          "Connecting a KG to an agent enables use of internal business data without manual graph querying.",
          "Requiring no graph expertise reduces the need for specialized hiring or extensive training.",
          "An end-to-end demonstration helps validate feasibility for enterprise use cases."
        ],
        "tags": [
          "knowledge graphs",
          "AI agents",
          "enterprise AI",
          "automation",
          "databases",
          "GraphDB",
          "VectorDB",
          "GenAI",
          "AWS Events"
        ]
      }
    },
    {
      "id": "z-X9MYi1Rr0",
      "title": "Leveraging tax credits and incentives for sustainability projects",
      "channel": "PwC US",
      "published_at": "2026-01-30T13:27:25.000Z",
      "url": "https://www.youtube.com/watch?v=z-X9MYi1Rr0",
      "thumbnail": "https://i.ytimg.com/vi/z-X9MYi1Rr0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Randa Barsoum, Tax Partner at PwC US, explains that while energy tax credits are often top of mind, a broader set of tax credits and incentives — including state and local abatements, location-based incentives, and R&D tax credits tied to innovation — can support sustainability initiatives. The core message: view sustainability investments through a wider tax lens to unlock meaningful tax value.",
        "bullets": [
          "Energy incentives are common but represent only part of the tax picture for sustainability.",
          "State and local abatements can provide significant, less obvious tax relief.",
          "Location-based incentives should be considered in site and investment decisions.",
          "R&D tax credits can apply to innovation efforts, including reimagining processes or packaging.",
          "Framing sustainability spending broadly can reveal additional tax value."
        ],
        "takeaways": [
          "Don’t assume energy credits are the only incentive—inventory state/local and location-based options when evaluating sites.",
          "Factor state and local abatements into cost models and site-selection for grid and data center projects.",
          "Track R&D credits for innovations in processes or infrastructure design to offset sustainability-related R&D spend.",
          "Treat sustainability investments as part of tax planning to realize additional financial value."
        ],
        "tags": [
          "sustainability",
          "tax credits",
          "incentives",
          "R&D credits",
          "state abatements",
          "local incentives",
          "location-based incentives",
          "energy incentives",
          "PwC",
          "sustainability strategy"
        ]
      }
    },
    {
      "id": "oQtkaHzUYlY",
      "title": "Copilot helps Christa find her inner star 🌟",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-29T18:33:49.000Z",
      "url": "https://www.youtube.com/watch?v=oQtkaHzUYlY",
      "thumbnail": "https://i.ytimg.com/vi/oQtkaHzUYlY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the short video frames a sky full of stars and shows Copilot helping Christa find her inner star. It invites viewers to download and try Copilot via the link in the bio.",
        "bullets": [
          "Visual motif: a sky full of stars (🌟).",
          "Narrative: Copilot helps Christa find her 'inner star'.",
          "Clear call-to-action to download and try Copilot.",
          "Includes a star emoji to reinforce an uplifting theme."
        ],
        "takeaways": [
          "Marketing push with a direct download CTA could drive increased user sign-ups—expect potential demand spikes.",
          "Social-first placement (link in bio) suggests traffic concentrated from short-form platforms; ensure CDN and edge readiness.",
          "Uplifting, simple creative may broaden casual user interest—monitor onboarding and authentication performance.",
          "Track post-campaign telemetry to correlate creative impact with infrastructure load and user behavior."
        ],
        "tags": [
          "Copilot",
          "Microsoft",
          "Christa",
          "stars",
          "inner-star",
          "download",
          "link-in-bio",
          "short-video",
          "uplifting",
          "AI"
        ]
      }
    },
    {
      "id": "BYtYm-xyKR8",
      "title": "Bringing In $251K A Year With 3 Jobs In The Bay Area",
      "channel": "CNBC Make It",
      "published_at": "2026-01-29T17:47:46.000Z",
      "url": "https://www.youtube.com/watch?v=BYtYm-xyKR8",
      "thumbnail": "https://i.ytimg.com/vi/BYtYm-xyKR8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Naseema McElroy, 44, is a labor and delivery nurse in Brentwood, California who also runs a personal finance brand and — per the video title — brings in $251K a year across three jobs. She accumulated nearly $1 million in debt in 2015, documented her debt-payoff journey through her business Financially Intentional, and was debt-free by 2017; the video is part of CNBC Make It's Millennial Money series.",
        "bullets": [
          "Naseema McElroy, 44, is a labor and delivery nurse and founder of Financially Intentional in Brentwood, CA.",
          "Title states she earns $251K per year across three jobs in the Bay Area.",
          "In 2015 she had nearly $1 million in debt and began documenting her payoff journey.",
          "She launched Financially Intentional and became debt-free by 2017.",
          "This profile is an installment of CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "Profiles of high-earning, multi-job professionals in the Bay Area highlight a customer segment that relies on both clinical work and digital entrepreneurship — relevant when assessing local demand for reliable power and connectivity.",
          "Entrepreneurial, content-driven businesses (like a personal finance brand) emphasize the need for hosting, cloud services, and uptime that data centers and service providers support.",
          "Workforce diversification (multiple jobs plus side business) can contribute to stable or evolving local usage patterns, which is relevant for capacity planning and reliability considerations."
        ],
        "tags": [
          "Bay Area",
          "Naseema McElroy",
          "Financially Intentional",
          "debt payoff",
          "personal finance",
          "side hustles",
          "nurse",
          "CNBC Make It",
          "Millennial Money",
          "251K income"
        ]
      }
    },
    {
      "id": "t6y2cVNjCAw",
      "title": "GeForce Garage - Summer of RTX Community Build",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-29T14:01:25.000Z",
      "url": "https://www.youtube.com/watch?v=t6y2cVNjCAw",
      "thumbnail": "https://i.ytimg.com/vi/t6y2cVNjCAw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, GeForce Garage showcases the winning Summer of RTX r/buildapc community build by u/JeffersonPutnam: a small-form-factor system featuring a GeForce RTX 5090 Founders Edition. The video lists full components (Fractal Design Era 2 chassis, MSI MPG B850I Edge, Ryzen 7 9800X3D, 32GB DDR5-6000, Corsair SF1000, Corsair Nautilus 240 RS) and provides a PCPartPicker link plus GeForce social channels.",
        "bullets": [
          "Community contest winner: u/JeffersonPutnam’s SFF GeForce RTX 5090 build.",
          "Chassis: Fractal Design Era 2 (small-form-factor).",
          "GPU: GeForce RTX 5090 Founders Edition; Motherboard: MSI MPG B850I Edge.",
          "CPU/RAM/Power/Cooling: Ryzen 7 9800X3D, 32GB Teamgroup DDR5-6000, Corsair SF1000, Corsair Nautilus 240 RS AIO.",
          "Video host: Dwight (_MightyPotato); PCPartPicker link and GeForce social links provided."
        ],
        "takeaways": [
          "The build demonstrates integration of a high-end RTX 5090 into a small-form-factor chassis, highlighting chassis compatibility considerations for dense deployments.",
          "Power provisioning is significant — the SF1000 PSU indicates planning for high wattage per build/node is required.",
          "The use of a 240mm AIO (Corsair Nautilus 240 RS) underscores the need for robust cooling solutions in compact systems.",
          "A community-driven contest and showcased build indicate active interest in high-performance consumer GPU configurations."
        ],
        "tags": [
          "GeForceGarage",
          "RTX5090",
          "GeForceRTX50",
          "SFF",
          "rbuildapc",
          "PCBuild",
          "FractalEra2",
          "Ryzen9800X3D"
        ]
      }
    },
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy GenAI solutions using Google Cloud's infrastructure. The collaboration streamlined operations, boosted developer productivity, compressed TTEC's digital transformation timeline, and unlocked entirely new revenue streams.",
        "bullets": [
          "TTEC worked with Google Cloud Consulting to accelerate AI prototyping and deployment.",
          "They leveraged GenAI alongside Google Cloud's robust infrastructure.",
          "The partnership streamlined operations and boosted developer productivity.",
          "Google Cloud Consulting helped compress TTEC's digital transformation timeline.",
          "The effort unlocked new revenue streams and expanded the company's ambitions."
        ],
        "takeaways": [
          "Robust, scalable cloud infrastructure is key to supporting rapid GenAI prototyping and deployment.",
          "Engaging cloud consulting can compress transformation timelines and expand what’s operationally possible.",
          "Investing in developer productivity directly speeds AI solution delivery.",
          "Streamlining operations through AI can enable new revenue opportunities."
        ],
        "tags": [
          "googlecloud",
          "ttec",
          "genai",
          "aideployment",
          "operationalefficiency",
          "customerexperience",
          "googlecloudplatform",
          "generativeai"
        ]
      }
    }
  ]
}