{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-27T08:55:24.365Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "wCJ_O97ww-k",
      "title": "World 1-3: Lens of Truth Obtained – Detective Controls Unlocked",
      "channel": "AWS Events",
      "published_at": "2026-01-27T08:10:22.000Z",
      "url": "https://www.youtube.com/watch?v=wCJ_O97ww-k",
      "thumbnail": "https://i.ytimg.com/vi/wCJ_O97ww-k/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this episode of PTD Today (hosts Russ Noll and Tristan Watty Ph.D.) is a weekly deep dive into cloud security that uses the 'Lens of Truth' metaphor to introduce AWS detective controls that reveal hidden enemies, secret passages, and invisible threats. The show focuses on deploying those detective controls to illuminate your cloud environment and transform security posture from blind to omniscient.",
        "bullets": [
          "Weekly cloud security deep dive with Russ Noll and Tristan Watty Ph.D., airs Mondays at 11am PST.",
          "Uses a 'Lens of Truth' metaphor to frame visibility challenges in cloud environments.",
          "Covers AWS detective controls that surface hidden threats and invisible issues.",
          "Bridges technical implementation details with practical business solutions.",
          "Aims to make the invisible visible to improve overall security posture."
        ],
        "takeaways": [
          "Increased visibility via detective controls reduces blind spots and improves threat detection.",
          "Deploying AWS detective tools can strengthen incident detection and inform faster response.",
          "Visibility improvements help prioritize remediation and security investments with business context.",
          "Bridging technical implementation and business needs enables more effective, actionable security strategies."
        ],
        "tags": [
          "cloud-security",
          "AWS",
          "detective-controls",
          "visibility",
          "threat-detection",
          "Russ Noll",
          "Tristan Watty",
          "security-best-practices"
        ]
      }
    },
    {
      "id": "9vS5kvxbPMQ",
      "title": "My Porta-Potty Business Brings In $4.3M/Year",
      "channel": "CNBC Make It",
      "published_at": "2026-01-24T15:00:30.000Z",
      "url": "https://www.youtube.com/watch?v=9vS5kvxbPMQ",
      "thumbnail": "https://i.ytimg.com/vi/9vS5kvxbPMQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Daniel Tom, 31, owns and operates Bay Area Sanitation, which runs a fleet of almost 2,000 portable toilets serving construction sites and events across the San Francisco Bay Area. The company reported $4.3 million in total income in 2025 and the video was produced, shot and edited by Mickey Todiwala.",
        "bullets": [
          "Owner: Daniel Tom, 31",
          "Company: Bay Area Sanitation",
          "Fleet: almost 2,000 portable toilets",
          "Service area: construction sites and events across the San Francisco Bay Area",
          "2025 total income: $4.3 million; video produced/shot/edited by Mickey Todiwala"
        ],
        "takeaways": [
          "The reported scale (nearly 2,000 units and $4.3M revenue) illustrates that regional service fleets can represent meaningful local commercial activity.",
          "Data center and grid planners should account for diverse local businesses—beyond tech firms—when assessing regional power and service demand.",
          "Logistics-heavy service companies operating at scale in urban areas may factor into resilience and capacity planning for utilities and infrastructure."
        ],
        "tags": [
          "small business",
          "entrepreneurship",
          "sanitation",
          "portable toilets",
          "Bay Area",
          "Daniel Tom",
          "revenue",
          "CNBC Make It",
          "2025"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, route planning is made easy as Jo discovers the power of Copilot Groups. The short video from the Microsoft Copilot channel highlights Copilot Groups as a tool for simplifying route planning.",
        "bullets": [
          "Highlights Copilot Groups as a route-planning aid.",
          "Features a user named Jo discovering the capability.",
          "Positions Copilot Groups as simplifying planning tasks.",
          "Published by the Microsoft Copilot channel.",
          "Includes hashtags: #copilot #microsoftcopilot #ai."
        ],
        "takeaways": [
          "Consider evaluating Copilot Groups for route planning and coordination workflows.",
          "Run a small pilot to see if Copilot Groups streamlines planning tasks for operations teams.",
          "Engage planning teams to determine where group-focused AI assistance could add value."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "copilotgroups",
          "routeplanning",
          "productivity",
          "teams",
          "automation"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, KPMG Poland’s podcast episode features Katarzyna Chojniak and Alicja Barska discussing practical uses of AI in audit, including tools that analyze large datasets, support documentation, and enhance client communication. They outline specific solutions (AI Transaction Scoring Tool, Clara AI, KPMG Clara), the shift from sampling to full-population analysis, and implementation challenges such as auditor upskilling, data security, regulation, and potential AI risks.",
        "bullets": [
          "AI supports repetitive tasks and analysis of large data volumes, enabling more accurate decision-making.",
          "AI Transaction Scoring Tool enables analysis of full populations rather than sampling.",
          "Clara AI provides conversational assistance and specialized agents; KPMG Clara manages audits in real time and Clara for Clients modernizes client communication.",
          "Adoption shifts auditor roles and requires new competencies and adaptation.",
          "Key challenges include data security, regulatory environment, and potential AI-related risks."
        ],
        "takeaways": [
          "Prepare datasets for full-population analysis—audits increasingly leverage complete data rather than samples.",
          "Expect faster, real-time audit interactions—plan integrations for secure digital audit communication channels.",
          "Prioritize data security and regulatory compliance, as AI tools intensify data access and processing requirements.",
          "Ensure staff can work with AI-augmented audit workflows—technical and process competencies will matter for engagement efficiency."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMG",
          "KPMG Clara",
          "Clara AI",
          "AI Transaction Scoring",
          "audyt innowacje",
          "bezpieczeństwo danych"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, NVIDIA's trailer marks the official launch of Arknights: Endfield and highlights NVIDIA DLSS 4 with Multi Frame Generation. The footage was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 Multi Frame Generation 4X Mode, and the description outlines the game's 3D real-time strategy RPG premise.",
        "bullets": [
          "Arknights: Endfield officially launched; it's a 3D real-time strategy RPG set on Talos-II.",
          "Trailer showcases NVIDIA DLSS 4 with Multi Frame Generation.",
          "Footage captured on GeForce RTX 5080 at 4K Ultra Settings using DLSS 4 MFG 4X Mode.",
          "Description links to the game's official site and multiple social channels.",
          "Published by NVIDIA GeForce with calls to subscribe and follow GeForce channels."
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is being used for 4K Ultra captures—cloud/streaming providers should evaluate support for DLSS 4 to match advertised visual/performance levels.",
          "The trailer was captured on an RTX 5080, indicating high-end GPU hardware is used for DLSS 4 demonstrations and content capture workloads.",
          "Providers planning to host modern AAA titles or 4K game streaming should verify GPU compatibility (RTX 50-series features) and capacity to support DLSS 4 MFG.",
          "Offering similar 4K Ultra experiences may require provisioning for increased encoding and GPU resources to handle frame-generation-enhanced output."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "RTX5080",
          "4K",
          "GeForce",
          "NVIDIA",
          "game-launch",
          "cloud-gaming",
          "RTXOn"
        ]
      }
    }
  ]
}