{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-29T10:05:32.138Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "yUpQ9pWA9WE",
      "title": "Watch: Fed Chair Jerome Powell's Full News Conference | WSJ",
      "channel": "WSJ News",
      "published_at": "2026-01-29T08:28:54.000Z",
      "url": "https://www.youtube.com/watch?v=yUpQ9pWA9WE",
      "thumbnail": "https://i.ytimg.com/vi/yUpQ9pWA9WE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Federal Reserve Chair Jerome Powell speaks to reporters following the Federal Reserve's two-day policy-setting meeting. The video is presented as the full news conference from WSJ News.",
        "bullets": [
          "Event: Full news conference with Fed Chair Jerome Powell.",
          "Timing: Occurred immediately after a two-day Federal Reserve policy-setting meeting.",
          "Source: WSJ News video (no transcript provided).",
          "Focus indicated: Fed policy and communications to reporters.",
          "Hashtags included in description: #JeromePowell #Fed #WSJ"
        ],
        "takeaways": [
          "Monitor Fed communications closely—post-meeting press conferences can influence interest-rate expectations that affect financing costs for data center projects.",
          "Reassess near-term capital plans and funding strategies given potential shifts in monetary policy that impact borrowing and lease rates.",
          "Coordinate with treasury/finance teams to evaluate hedging or refinancing needs if market conditions move following Fed remarks.",
          "Expect market and client demand volatility after major Fed communications; build contingency plans for procurement and project timelines."
        ],
        "tags": [
          "JeromePowell",
          "Fed",
          "WSJ",
          "monetary-policy",
          "central-bank",
          "press-conference",
          "economy",
          "markets"
        ]
      }
    },
    {
      "id": "feL4GUiP7Ws",
      "title": "Building Prior Authorization Systems for Healthcare Payors with Amazon Bedrock",
      "channel": "AWS Events",
      "published_at": "2026-01-29T05:43:38.000Z",
      "url": "https://www.youtube.com/watch?v=feL4GUiP7Ws",
      "thumbnail": "https://i.ytimg.com/vi/feL4GUiP7Ws/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This technical session shows how to use Amazon Bedrock foundation models to build an intelligent prior authorization system for healthcare payors that meets CMS regulatory requirements while improving operational efficiency. AWS Engineers and the AWS Generative AI Innovation Center present an architectural approach combining advanced NLP with healthcare-specific workflows to automate Local Coverage Determinations, analyze medical documentation, and generate explainable prior authorization recommendations to help meet CMS-0057-F timelines with compliance and ",
        "bullets": [
          "Leverages Amazon Bedrock foundation models for prior authorization automation.",
          "Presents a comprehensive architecture that combines advanced NLP with healthcare workflows.",
          "Demonstrates automated processing of Local Coverage Determinations (LCDs).",
          "Showcases analysis of complex medical documentation and explainable recommendation generation.",
          "Aims to help payors meet CMS-0057-F timelines while maintaining compliance and accuracy."
        ],
        "takeaways": [
          "Adopting a Bedrock-based solution can drive operational efficiency by automating prior authorization tasks.",
          "Built-in explainability and LCD automation support auditability and regulatory compliance obligations.",
          "Meeting CMS-0057-F timelines is a central design goal, relevant for regulatory SLA planning.",
          "Combining advanced NLP with healthcare-specific workflows is key when evaluating AI deployments for payors."
        ],
        "tags": [
          "Amazon Bedrock",
          "generative AI",
          "prior authorization",
          "healthcare payors",
          "CMS-0057-F",
          "Local Coverage Determinations",
          "natural language processing",
          "AWS",
          "compliance",
          "explainability"
        ]
      }
    },
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy GenAI solutions that unlocked new revenue streams. Sreeni Alakappan says the company used Google Cloud's infrastructure to streamline operations, boost developer productivity, and compress its digital transformation timeline.",
        "bullets": [
          "TTEC and Google Cloud Consulting collaborated to accelerate AI solution prototyping and deployment.",
          "GenAI and Google Cloud infrastructure were leveraged to streamline operations and increase developer productivity.",
          "The work unlocked entirely new revenue streams for TTEC.",
          "Google Cloud Consulting helped compress TTEC’s digital transformation timeline.",
          "The partnership expanded what TTEC sees as possible for its business ambitions."
        ],
        "takeaways": [
          "Robust cloud infrastructure plus GenAI can shorten transformation timelines and speed time-to-value.",
          "Improved developer productivity from cloud tools can accelerate deployment of customer-facing services.",
          "AI-driven solutions can create new revenue opportunities beyond existing offerings.",
          "Partnering with cloud consulting services can expand ambition and operational capacity without relying solely on internal teams."
        ],
        "tags": [
          "google cloud",
          "ttec",
          "genai",
          "ai deployment",
          "operational efficiency",
          "customer experience",
          "cloud consulting",
          "developer productivity",
          "digital transformation"
        ]
      }
    },
    {
      "id": "5CyVBSbHmbA",
      "title": "Year-end toolkit: Strengthening audit committee collaboration",
      "channel": "PwC US",
      "published_at": "2026-01-27T17:20:31.000Z",
      "url": "https://www.youtube.com/watch?v=5CyVBSbHmbA",
      "thumbnail": "https://i.ytimg.com/vi/5CyVBSbHmbA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This episode focuses on strengthening collaboration between finance management and the audit committee during the year-end accounting and reporting process. It highlights streamlining reporting and addressing emerging issues such as AI oversight, enterprise risk management, evolving cyber risk, and elevating proxy disclosures.",
        "bullets": [
          "Strengthening management/audit committee communication and collaboration around year-end reporting.",
          "Key year-end accounting and reporting issues finance teams should be prepared to address.",
          "Oversight of AI: discussing risks, opportunities, and necessary controls.",
          "Enhancing enterprise risk oversight and navigating the evolving cyber risk landscape in the age of AI.",
          "Elevating proxy disclosures and referencing PwC resources (webcast replay and year-end guide) for more detail."
        ],
        "takeaways": [
          "Engage the audit committee proactively on year-end reporting and transformation initiatives to ensure aligned oversight.",
          "Document AI-related risks, opportunities, and controls so management can clearly present oversight measures to the committee.",
          "Embed evolving cyber threats—especially those tied to AI—into enterprise risk frameworks and reporting to the committee.",
          "Update proxy disclosures and governance materials to reflect material technology, risk, and transformation developments."
        ],
        "tags": [
          "year-end",
          "audit-committee",
          "finance",
          "governance",
          "AI-oversight",
          "enterprise-risk",
          "cyber-risk",
          "proxy-disclosures",
          "reporting",
          "PwC"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Jo discovers the power of Copilot Groups as a tool that makes route planning easy. The short Microsoft Copilot video highlights route planning capabilities in a concise, demo-style tone.",
        "bullets": [
          "Short Microsoft Copilot video focused on route planning.",
          "Features a user named Jo discovering Copilot Groups.",
          "Emphasizes that Copilot Groups makes route planning easy.",
          "Published by the Microsoft Copilot channel.",
          "Includes hashtags: #copilot #microsoftcopilot #ai"
        ],
        "takeaways": [
          "If Copilot Groups simplifies route planning, it may help field teams plan maintenance or service routes more quickly.",
          "Easier route planning could reduce coordination overhead for distributed operations.",
          "Tools that streamline planning may support faster response times and operational efficiency in grid and data center contexts."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "route-planning",
          "copilot-groups",
          "field-operations",
          "productivity",
          "automation"
        ]
      }
    }
  ]
}