{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-21T22:52:35.842Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "t33Fh1JZVgA",
      "title": "AI at Speed: From Investment to Performance",
      "channel": "PwC US",
      "published_at": "2026-01-21T22:48:29.000Z",
      "url": "https://www.youtube.com/watch?v=t33Fh1JZVgA",
      "thumbnail": "https://i.ytimg.com/vi/t33Fh1JZVgA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Paul Griggs of PwC US discusses at Davos how organizations are shifting from AI exploration to execution and evaluating AI through the lens of investment discipline, performance, and measurable value. He and CNBC’s Emma Crosby highlight leaders who move early, place capital with intent, and design operating models that remain resilient without sacrificing performance. The conversation emphasizes AI delivering measurable outcomes today while helping organizations transform and build for the future.",
        "bullets": [
          "Shift from AI exploration to execution with a focus on measurable value.",
          "Evaluate AI through investment discipline and performance metrics.",
          "Leaders move early and allocate capital intentionally to AI initiatives.",
          "Design operating models that balance resilience and performance.",
          "AI can deliver measurable outcomes now while enabling future transformation."
        ],
        "takeaways": [
          "Prioritize AI investments with clear, measurable KPIs to justify capital deployed in grid and data center projects.",
          "Allocate capital intentionally to early, high-impact AI use cases that improve operational performance.",
          "Design operating models for resilience so AI deployments do not compromise uptime or service levels.",
          "Track AI performance and ROI continuously to demonstrate measurable outcomes and inform future scaling decisions."
        ],
        "tags": [
          "AI",
          "investment discipline",
          "performance",
          "measurable value",
          "operating models",
          "PwC",
          "Davos2026",
          "Paul Griggs",
          "CNBC",
          "enterprise AI"
        ]
      }
    },
    {
      "id": "6hu7hYLiu08",
      "title": "Get Step-By-Step Fixes with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-21T20:14:00.000Z",
      "url": "https://www.youtube.com/watch?v=6hu7hYLiu08",
      "thumbnail": "https://i.ytimg.com/vi/6hu7hYLiu08/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Copilot provides real-time visual assistance for home projects and repairs. It can \"see what you see\" and deliver step-by-step, clear instructions for problems like leaky pipes or overflowing washing machines.",
        "bullets": [
          "Real-time support that uses device view to assess issues.",
          "Provides step-by-step instructions for fixes.",
          "Designed for common household problems (e.g., leaky pipes, overflowing washers).",
          "Delivers clear, guided troubleshooting to help users complete repairs.",
          "Emphasizes visual, contextual guidance rather than text-only help."
        ],
        "takeaways": [
          "Demonstrates a real-time visual troubleshooting capability that is relevant to remote diagnostics of facility equipment.",
          "Step-by-step guided instructions can help standardize on-site repair procedures and reduce errors during maintenance.",
          "Visual, contextual assistance could be leveraged to support less-experienced technicians during incident response or routine fixes.",
          "Remote guidance may reduce the need for immediate specialist dispatch for common, solvable failures, potentially improving response times."
        ],
        "tags": [
          "Copilot",
          "real-time support",
          "visual assistance",
          "step-by-step",
          "home repairs",
          "leaky pipes",
          "washing machine",
          "remote diagnostics",
          "Microsoft Copilot"
        ]
      }
    },
    {
      "id": "IKkVWKdumHw",
      "title": "re:Invent 2025 - Chalk Talk - Origin management for multi-region applications with Amazon CloudFront",
      "channel": "AWS Events",
      "published_at": "2026-01-21T17:49:36.000Z",
      "url": "https://www.youtube.com/watch?v=IKkVWKdumHw",
      "thumbnail": "https://i.ytimg.com/vi/IKkVWKdumHw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this session covers comprehensive origin management with Amazon CloudFront to build secure, resilient content delivery systems. It explains automatic failover with CloudFront and Route53, granular origin routing via CloudFront Functions, origin security with S3 Origin Access Control and VPC private origins, hybrid integration using AWS Direct Connect, and Origin Shield for cache optimization.",
        "bullets": [
          "Automatic failover mechanisms using CloudFront and Route 53",
          "Granular origin routing implemented with CloudFront Functions",
          "Secure origins via S3 Origin Access Control (OAC) and VPC private origins",
          "Integrating on‑premises infrastructure through AWS Direct Connect for hybrid setups",
          "Deploying Origin Shield to optimize cache performance and reduce origin load"
        ],
        "takeaways": [
          "Automatic failover plus Route53 integration increases availability across regions for critical content delivery",
          "Edge-side routing with CloudFront Functions enables fine-grained traffic control to improve performance",
          "S3 OAC and VPC private origins strengthen origin security and reduce exposure of backend assets",
          "AWS Direct Connect allows existing data centers to participate in CloudFront origin strategies for hybrid architectures",
          "Origin Shield can lower origin load and improve cache efficiency, reducing backend resource strain"
        ],
        "tags": [
          "cloudfront",
          "route53",
          "origin-management",
          "cloudfront-functions",
          "origin-access-control",
          "vpc-private-origins",
          "aws-direct-connect",
          "origin-shield",
          "hybrid-cloud",
          "content-delivery"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer - Launching January 22!",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield is launching worldwide on January 22 and features NVIDIA DLSS 4 with Multi Frame Generation. The 3D real-time strategy RPG trailer was captured on a GeForce RTX 5080 at 4K Ultra settings demonstrating DLSS 4 Multi Frame Generation 4X Mode.",
        "bullets": [
          "Worldwide release date: January 22.",
          "Features NVIDIA DLSS 4 with Multi Frame Generation (4X Mode).",
          "Genre: 3D real-time strategy RPG; player role: Endministrator of Endfield Industries on Talos-II.",
          "Trailer captured on GeForce RTX 5080 at 4K Ultra settings.",
          "Official game site and multiple social channels linked in the description."
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is a highlighted feature—ensure infrastructure supports NVIDIA's latest SDKs and driver stacks for validation and testing.",
          "Trailer capture used an RTX 5080 at 4K Ultra—account for high-performance GPUs when provisioning hardware for 4K capture, benchmarking, or demo workloads.",
          "Advanced AI-driven frame generation may change rendering workload profiles—plan GPU capacity and software compatibility accordingly.",
          "High-resolution 4K assets and captures imply increased storage and network bandwidth needs for content pipelines and delivery."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "NVIDIA",
          "RTX5080",
          "4K",
          "MultiFrameGeneration",
          "GameLaunch",
          "RealTimeStrategy",
          "Endfield"
        ]
      }
    },
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this Google Cloud video (published 2026-01-20) demonstrates how Rate Insurance boosts agent efficiency using Agentforce and Gemini. The description also directs viewers to the Google Cloud–Salesforce partnership resource.",
        "bullets": [
          "Title: Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
          "Channel: Google Cloud; published 2026-01-20",
          "No transcript available",
          "Video showcases Rate Insurance improving agent efficiency with Agentforce and Gemini",
          "Description links to Google Cloud and Salesforce partnership (https://goo.gle/3NSZrJS)"
        ],
        "takeaways": [
          "So what: Consider exploring cloud + CRM + AI partnerships (e.g., Google Cloud + Salesforce) as potential levers for agent productivity.",
          "So what: Evaluate infrastructure and vendor support for AI platforms like Gemini and Agentforce when planning deployments.",
          "So what: Use brief customer examples (like Rate Insurance) as input to vendor discussions and procurement planning.",
          "So what: Ensure decision-makers review partner resources linked in vendor materials to understand integration options."
        ],
        "tags": [
          "Rate Insurance",
          "Agentforce",
          "Gemini",
          "Google Cloud",
          "Salesforce",
          "agent efficiency",
          "cloud partnership",
          "AI platforms",
          "insurance tech",
          "customer service"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Charly Stoever, 35, is a financial coach who lives rent-free in Portland by pet sitting full time and has spent the last 18 months living out of two suitcases. She brings in about $60,000 a year, and her story is featured in CNBC Make It's Millennial Money series.",
        "bullets": [
          "Charly Stoever, 35, is a financial coach.",
          "Lives rent-free in Portland by pet sitting full time.",
          "Has lived out of two suitcases for 18 months.",
          "Annual income reported at $60,000.",
          "Profiled in CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "Alternative housing/income models can enable workforce mobility.",
          "Employees may prioritize low-cost living arrangements over local housing.",
          "Flexible, location-independent lifestyles could affect talent distribution.",
          "Consider nontraditional employee needs when planning site staffing or remote support."
        ],
        "tags": [
          "pet sitting",
          "rent-free",
          "Portland",
          "financial coach",
          "millennial money",
          "CNBC Make It",
          "minimalism",
          "travel",
          "60k",
          "full-time pet sitter"
        ]
      }
    },
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Dr. Anna Chacon is a 39-year-old dermatologist in Miami, FL who runs a private practice. Her net worth is about $6 million, composed of $3.2 million in investments, a $1.9 million home, and a $1.1 million office building.",
        "bullets": [
          "Name: Dr. Anna Chacon, age 39",
          "Location: Miami, FL",
          "Occupation: Dermatologist with a private practice",
          "Reported net worth: approximately $6 million",
          "Net worth breakdown: $3.2M investments, $1.9M home, $1.1M office building"
        ],
        "takeaways": [
          "The description provides no operational or energy-usage details, so it offers no direct insight for grid or data center capacity planning.",
          "Ownership of an office building is noted, but no infrastructure or facility specifications are given to evaluate suitability for colocation or power-related services.",
          "Financial profile alone (investments and real estate) does not indicate technology, IT load, or cooling/electrical needs relevant to data center decisions.",
          "Decision-makers would need additional information—facility size, equipment, power consumption, and operating patterns—to assess any impact or opportunity."
        ],
        "tags": [
          "Anna Chacon",
          "dermatologist",
          "Miami",
          "private practice",
          "net worth",
          "investments",
          "real estate",
          "CNBC Make It"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, a giant bubble of carbon dioxide can store 20 megawatts of energy. The description says these batteries are meant to help smooth renewable energy fluctuations and support the global shift to clean energy.",
        "bullets": [
          "Description highlights a CO2-based battery capable of storing 20 megawatts.",
          "Presented as a large, bubble-like storage device.",
          "Aimed at addressing variability in renewable energy supply.",
          "Positioned as a solution to accelerate the shift to clean energy globally.",
          "Promoted with tech and innovation framing (hashtags included)."
        ],
        "takeaways": [
          "A 20 MW CO2 storage option could offer grid operators another tool to manage renewable intermittency.",
          "Decision-makers should watch this technology as part of broader strategies for integrating more renewables.",
          "Data centers and large energy users may consider emerging storage types when planning for resilient, low-carbon supply.",
          "Evaluate future technical and commercial details as they become available to assess fit with existing infrastructure."
        ],
        "tags": [
          "ieee",
          "tech",
          "ieeespectrum",
          "innovation",
          "future",
          "futuristic",
          "energy",
          "battery"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI już teraz wpływa na obszar cen transferowych, m.in. w monitorowaniu rentowności, analizach porównawczych i automatyzacji dokumentacji. W podcaście KPMG ON AIR eksperci Monika Palmowska i Jakub Roszkiewicz omawiają praktyczne wdrożenia, ryzyka (dane, bezpieczeństwo, RODO, halucynacje), integrację z ERP oraz zalecenia — AI wzmocni pracę doradców, ale ich nie zastąpi.",
        "bullets": [
          "AI stosowane jest do monitorowania rentowności, benchmarków porównawczych i automatyzacji dokumentacji cen transferowych.",
          "Eksperci podkreślają, że AI uzupełnia pracę doradców podatkowych, nie zastępuje ich.",
          "Główne ryzyka to kwestie danych i bezpieczeństwa, RODO oraz błędy modelu (halucynacje).",
          "Digital Gateway wskazany jako bezpieczne środowisko do pracy z AI.",
          "Kluczowe kroki wdrożeniowe: integracja z ERP, inteligentne benchmarki i uporządkowanie procesów przed transformacją."
        ],
        "takeaways": [
          "Zadbaj o bezpieczne środowisko do pracy z AI (np. Digital Gateway) zanim uruchomisz rozwiązania związane z cenami transferowymi.",
          "Priorytetem jest zarządzanie danymi i zgodność z RODO — to fundamenty bezpiecznego wykorzystania AI.",
          "Planuj integrację AI z istniejącym ERP i benchmarkami, aby uzyskać wartościowe, automatyzowane analizy rentowności.",
          "Rozpocznij od uporządkowania procesów i dokumentacji — to kluczowy pierwszy krok do skutecznego wdrożenia AI.",
          "Przygotuj zespoły na zmianę ról: AI może automatyzować zadania dokumentacyjne i wspierać rozwój młodszych pracowników, a doradcy pozostają istotni."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "podatki",
          "automatyzacja",
          "ERP",
          "bezpieczeństwo danych",
          "RODO",
          "benchmarking"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video encourages using Microsoft Copilot to build momentum by stacking small wins across workouts, projects, and personal goals. It presents Copilot as a companion for maintaining progress and sustaining motivation.",
        "bullets": [
          "Emphasizes stacking small wins to keep momentum.",
          "Applies to workouts, projects, and personal goals.",
          "Positions Microsoft Copilot as a companion for ongoing progress.",
          "Focuses on sustained motivation rather than single large achievements."
        ],
        "takeaways": [
          "So what: For grid and data center projects, breaking work into small, trackable wins can help sustain momentum on long initiatives.",
          "So what: Consider piloting Copilot to support teams with routine tasks and keep project progress steady during deployments or migrations.",
          "So what: Encourage incremental objectives in operations and project plans to leverage momentum-building tools effectively.",
          "So what: Measuring small, continuous improvements may improve timelines and team engagement on infrastructure work."
        ],
        "tags": [
          "Microsoft Copilot",
          "productivity",
          "motivation",
          "small wins",
          "momentum",
          "workouts",
          "projects",
          "personal goals",
          "AI assistant",
          "self-improvement"
        ]
      }
    }
  ]
}