{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-23T05:54:22.226Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI w audycie jest już narzędziem codziennego użytku, wspierającym automatyzację powtarzalnych czynności, analizę dużych zbiorów danych i podejmowanie trafniejszych decyzji. W rozmowie przedstawiono praktyczne rozwiązania KPMG (AI Transaction Scoring Tool, Clara AI, platforma KPMG Clara i Clara for Clients), korzyści wynikające z analizy pełnych populacji oraz wyzwania związane z kompetencjami, bezpieczeństwem danych i regulacjami.",
        "bullets": [
          "AI automatyzuje powtarzalne zadania i pozwala analizować pełne populacje danych (AI Transaction Scoring Tool).",
          "Clara AI oferuje konwersacyjnego asystenta i wyspecjalizowanych agentów; KPMG Clara zarządza badaniem w czasie rzeczywistym, a Clara for Clients usprawnia komunikację z klientem.",
          "Przejście z próbkowania na analizę pełnych populacji wpływa na dokładność i zakres badań audytowych.",
          "AI wspiera dokumentację i analizę ujawnień, ale wdrożenie wymaga adaptacji audytorów i nowych kompetencji.",
          "Istotne są kwestie bezpieczeństwa danych, środowiska regulacyjnego oraz potencjalne zagrożenia związane z AI."
        ],
        "takeaways": [
          "Rozważ wdrożenie narzędzi AI do audytów operacyjnych i inwentaryzacji, by przejść od próbkowania do analizy pełnych zbiorów danych.",
          "Wdrożenie platformy do zarządzania badaniem w czasie rzeczywistym może poprawić nadzór nad infrastrukturą i komunikację z dostawcami/klientami.",
          "Priorytetowo traktuj bezpieczeństwo danych i zgodność regulacyjną przy integracji rozwiązań AI w środowisku krytycznej infrastruktury.",
          "Zainwestuj w podnoszenie kompetencji zespołu w obszarze AI, aby wykorzystać pełne korzyści automatyzacji i analizy danych."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMG Clara",
          "Clara AI",
          "AI Transaction Scoring",
          "innowacje",
          "bezpieczeństwo danych",
          "regulacje",
          "audytorzy",
          "analiza danych"
        ]
      }
    },
    {
      "id": "6hu7hYLiu08",
      "title": "Get Step-By-Step Fixes with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-21T20:14:00.000Z",
      "url": "https://www.youtube.com/watch?v=6hu7hYLiu08",
      "thumbnail": "https://i.ytimg.com/vi/6hu7hYLiu08/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Copilot provides real-time support for home projects and repairs by seeing what you see and offering step-by-step instructions. It promises clear, actionable guidance for issues such as leaky pipes and overflowing washing machines.",
        "bullets": [
          "Real-time visual assistance — Copilot can 'see what you see'.",
          "Delivers step-by-step repair instructions.",
          "Targets common household issues (e.g., leaky pipes, washing machines).",
          "Emphasizes clear, actionable guidance for DIY troubleshooting.",
          "Aims to support home projects and repairs in real time."
        ],
        "takeaways": [
          "From the description: Copilot offers real-time, visual, step-by-step troubleshooting capabilities.",
          "Decision-makers should consider whether similar visual guidance could support facility or equipment maintenance workflows.",
          "Assess potential for reducing on-site specialist visits if comparable guidance is accurate and reliable.",
          "Before any deployment in data center environments, evaluate integration, security, and accuracy requirements."
        ],
        "tags": [
          "Copilot",
          "home repairs",
          "real-time support",
          "visual AI",
          "step-by-step",
          "troubleshooting",
          "plumbing",
          "washing machine",
          "repair guidance",
          "Microsoft Copilot"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… NVIDIA GeForce published the launch trailer for Arknights: Endfield, highlighting the game's support for NVIDIA DLSS 4 with Multi Frame Generation. The video notes the title is a 3D real-time strategy RPG where you play the Endministrator on Talos-II and was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 MFG 4X Mode.",
        "bullets": [
          "Arknights: Endfield launch trailer posted by NVIDIA GeForce.",
          "Showcases NVIDIA DLSS 4 with Multi Frame Generation (link provided).",
          "Game described as a 3D real-time strategy RPG; player is the Endministrator on Talos-II.",
          "Footage captured on GeForce RTX 5080 at 4K Ultra with DLSS 4 MFG 4X Mode.",
          "Includes official game and social links (Twitter/X, YouTube, Instagram, Facebook, TikTok)."
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is being showcased in a AAA game launch, indicating demand for GPUs that support advanced upscaling features.",
          "High-resolution captures (4K Ultra) using an RTX 5080 suggest content creation and QA workflows may require top-tier GPU provisioning.",
          "Teams delivering or testing game builds should verify DLSS 4/MFG compatibility and performance on supported NVIDIA hardware.",
          "Streaming and capture pipelines may need GPUs with DLSS support to reproduce marketing-quality footage."
        ],
        "tags": [
          "Arknights",
          "Endfield",
          "DLSS4",
          "NVIDIA",
          "RTX5080",
          "4K",
          "MultiFrameGeneration",
          "GeForce",
          "Gaming",
          "LaunchTrailer"
        ]
      }
    },
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video shows how Rate Insurance boosts agent efficiency using Agentforce and Gemini. It also points viewers to a Google Cloud and Salesforce partnership link for more information.",
        "bullets": [
          "Shows how Rate Insurance boosts agent efficiency with Agentforce and Gemini.",
          "Includes a link to learn more about the Google Cloud and Salesforce partnership.",
          "Transcript is not available in the provided content."
        ],
        "takeaways": [
          "Rate Insurance’s use of Agentforce and Gemini is presented as an example of improving agent efficiency—decision-makers can review the demo to see relevance to their operations.",
          "The Google Cloud and Salesforce partnership is highlighted; follow the provided link for details on joint offerings and integrations.",
          "Use the video as a concise reference when assessing Agentforce and Gemini for workflow or efficiency initiatives."
        ],
        "tags": [
          "Google Cloud",
          "Salesforce",
          "Rate Insurance",
          "Agentforce",
          "Gemini",
          "agent efficiency",
          "cloud partnership",
          "demo"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Charly Stoever, 35, is a financial coach who lives rent-free in Portland, Oregon by pet sitting full time. For the past 18 months she’s lived out of two suitcases and brought in about $60,000 a year; the story is part of CNBC Make It’s Millennial Money series.",
        "bullets": [
          "Charly Stoever, 35, is a financial coach who pet sits full time to avoid paying rent.",
          "She lives rent-free in Portland, Oregon.",
          "She has lived out of two suitcases for the last 18 months.",
          "Her pet-sitting income is about $60,000 per year.",
          "The segment appears on CNBC Make It’s Millennial Money series (produced by Lauren Shamo)."
        ],
        "takeaways": [
          "Nontraditional, location-flexible income streams can support mid-five-figure earnings while enabling mobile lifestyles.",
          "Sustained mobility (living out of two suitcases) suggests a population segment less tied to a fixed residence—this can affect local occupancy and demand patterns.",
          "Decision-makers should note that evolving gig and remote lifestyles may influence where and when energy or data center services are needed.",
          "Mainstream coverage of these lifestyles signals growing prevalence; monitor such trends for capacity and service planning."
        ],
        "tags": [
          "pet sitting",
          "rent-free",
          "Portland",
          "financial coach",
          "digital nomad",
          "travel",
          "CNBC Make It",
          "Millennial Money",
          "$60,000",
          "minimalist lifestyle"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This IEEE Spectrum video spotlights a giant carbon dioxide bubble battery that can store 20 megawatts of power and deliver about eight hours of energy. The technology is presented as a way to help manage renewable energy fluctuations and support the global transition to clean energy.",
        "bullets": [
          "Device is a large carbon dioxide \"bubble\" used as a battery.",
          "Stores 20 megawatts of power.",
          "Provides roughly eight hours of energy storage.",
          "Designed to address fluctuations in renewable energy supply.",
          "Positioned as a tool to support the shift to clean energy worldwide."
        ],
        "takeaways": [
          "Eight-hour discharge duration makes it relevant for multi-hour load shifting and short-term backup planning.",
          "20 MW capacity is at a scale to consider for localized grid support or sizable facility backup needs.",
          "Aimed at mitigating renewable variability, so it could help integrate more wind and solar generation.",
          "Decision-makers should evaluate how this storage duration and capacity align with their operational and grid-balancing requirements."
        ],
        "tags": [
          "ieee",
          "tech",
          "energy",
          "battery",
          "CO2",
          "energy-storage",
          "renewables",
          "innovation",
          "grid"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI już wpływa na zarządzanie cenami transferowymi, m.in. poprzez monitorowanie rentowności, analizy porównawcze oraz automatyzację dokumentacji. W podcaście eksperci KPMG omawiają, jak korzystać z AI w praktyce, dlaczego nie zastąpi ona doradców, oraz jakie są ryzyka i kroki wdrożeniowe (dane, bezpieczeństwo, RODO, Digital Gateway, integracja z ERP).",
        "bullets": [
          "Praktyczne zastosowania: monitoring rentowności, benchmarki, automatyzacja dokumentacji cen transferowych.",
          "AI jako wsparcie doradców — narzędzie wzmacniające kompetencje, nie ich zastępujące.",
          "Główne ryzyka: bezpieczeństwo danych, zgodność z RODO i problem halucynacji modeli.",
          "Rozwiązania infrastrukturalne: Digital Gateway jako bezpieczne środowisko pracy z AI i integracja z ERP.",
          "Wdrożenie zaczyna się od uporządkowania procesów i wyznaczenia pierwszych kroków transformacji."
        ],
        "takeaways": [
          "Zadbaj o bezpieczne środowisko do pracy z AI (np. Digital Gateway) — przetwarzanie danych transferowych wymaga kontroli i ochrony.",
          "Upewnij się, że systemy ERP i benchmarki mogą być integrowane z narzędziami AI, by uzyskać wartościowe, automatyczne analizy.",
          "Przygotuj uporządkowane i udokumentowane procesy przed wdrożeniem AI — to fundament skutecznej transformacji.",
          "Uwzględnij wymagania zgodności (RODO) i ryzyka modelowe przy projektowaniu architektury danych i dostępu."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "podatki",
          "automatyzacja",
          "RODO",
          "ERP",
          "Digital Gateway",
          "KPMG",
          "bezpieczeństwo danych"
        ]
      }
    }
  ]
}