{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-30T04:58:52.043Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "oQtkaHzUYlY",
      "title": "Copilot helps Christa find her inner star 🌟",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-29T18:33:49.000Z",
      "url": "https://www.youtube.com/watch?v=oQtkaHzUYlY",
      "thumbnail": "https://i.ytimg.com/vi/oQtkaHzUYlY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video presents Copilot helping Christa \"find the star within,\" using sky and star imagery. It’s a brief promotional message that invites viewers to download and try Copilot via the link in bio.",
        "bullets": [
          "No transcript available; only a short description provided.",
          "Theme: Copilot helps Christa ‘find the star within’ using star/sky imagery.",
          "Clear call-to-action: \"Download & try Copilot at link in bio.\"",
          "Concise, emoji-enhanced messaging (🌟) suited for social sharing.",
          "Promotional content focused on user engagement and downloads."
        ],
        "takeaways": [
          "Contains a direct call-to-action to download Copilot via link in bio—track marketing-driven download activity.",
          "Messaging emphasizes personal empowerment, indicating consumer-focused outreach.",
          "Format and brevity suggest it's designed for social platforms—expect short, shareable promotional pushes.",
          "Decision-makers should consider monitoring user adoption and service demand tied to marketing campaigns."
        ],
        "tags": [
          "Copilot",
          "Christa",
          "star",
          "stars",
          "sky",
          "download",
          "try",
          "link in bio",
          "inner star"
        ]
      }
    },
    {
      "id": "2GZM7wOHFcg",
      "title": "Follow the carbon, find the money: Turning sustainability into financial value",
      "channel": "PwC US",
      "published_at": "2026-01-29T18:04:28.000Z",
      "url": "https://www.youtube.com/watch?v=2GZM7wOHFcg",
      "thumbnail": "https://i.ytimg.com/vi/2GZM7wOHFcg/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Rich Goode of PwC US explains that linking carbon reduction to financial impact is essential to engage business leaders. Translating emissions outcomes into cost savings and business value helps move sustainability from ambition to action and drives alignment, investment, and results.",
        "bullets": [
          "Frame sustainability in business/financial terms to engage leadership.",
          "A ton of carbon is abstract; financial value is tangible to decision-makers.",
          "Translate emissions outcomes into cost savings and business value.",
          "Leaders need to understand carbon accounting fundamentals.",
          "Communicate sustainability in business terms to secure alignment and investment."
        ],
        "takeaways": [
          "Quantify emissions outcomes as financial value to make projects justifiable to leadership and finance.",
          "Establish basic carbon accounting so emissions reductions can be measured, tracked, and reported.",
          "Present sustainability initiatives in ROI/business terms to improve chances of funding and operational adoption.",
          "Use financial framing to move plans from ambition to concrete actions that deliver measurable results."
        ],
        "tags": [
          "sustainability",
          "carbon-accounting",
          "financial-value",
          "ESG",
          "PwC",
          "emissions-reduction",
          "business-case",
          "operational-resilience",
          "leadership-communication",
          "climate-strategy"
        ]
      }
    },
    {
      "id": "BYtYm-xyKR8",
      "title": "Bringing In $251K A Year With 3 Jobs In The Bay Area",
      "channel": "CNBC Make It",
      "published_at": "2026-01-29T17:47:46.000Z",
      "url": "https://www.youtube.com/watch?v=BYtYm-xyKR8",
      "thumbnail": "https://i.ytimg.com/vi/BYtYm-xyKR8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Naseema McElroy, 44, is a labor and delivery nurse in Brentwood, California who brings in $251K a year across three jobs and runs a personal finance brand called Financially Intentional. She accumulated nearly $1 million in debt in 2015, documented her debt-payoff journey through her business, and was debt-free by 2017.",
        "bullets": [
          "Naseema McElroy is a 44-year-old labor and delivery nurse in Brentwood, CA.",
          "Video title states she brings in $251K annually through three jobs.",
          "She amassed nearly $1M in debt in 2015 and created Financially Intentional to document paying it off.",
          "By 2017 she was debt-free.",
          "This profile is part of CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "Personal brands that document life and finance journeys create ongoing demand for reliable digital publishing and storage.",
          "Creators who monetize across multiple jobs and channels may require scalable bandwidth during audience growth or content releases.",
          "Profiles from tech-forward regions like the Bay Area highlight a customer segment that values uptime, performance, and analytics for growth."
        ],
        "tags": [
          "Naseema McElroy",
          "Financially Intentional",
          "personal finance",
          "debt payoff",
          "labor and delivery nurse",
          "Bay Area",
          "CNBC Make It",
          "Millennial Money",
          "multiple jobs",
          "debt-free 2017"
        ]
      }
    },
    {
      "id": "t6y2cVNjCAw",
      "title": "GeForce Garage - Summer of RTX Community Build",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-29T14:01:25.000Z",
      "url": "https://www.youtube.com/watch?v=t6y2cVNjCAw",
      "thumbnail": "https://i.ytimg.com/vi/t6y2cVNjCAw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video announces the winner of the Summer of RTX r/buildapc Community Build (u/JeffersonPutnam) and showcases their small-form-factor GeForce RTX 5090 rig. The description lists the full parts list, links to the PCPartPicker build, and GeForce social channels.",
        "bullets": [
          "Winner: u/JeffersonPutnam’s SFF GeForce RTX 5090 build.",
          "Chassis: Fractal Design Era 2; GPU: GeForce RTX 5090 Founders Edition.",
          "Key components: MSI MPG B850I Edge, Ryzen 7 9800X3D, 32GB DDR5-6000, Corsair SF1000, Corsair Nautilus 240 RS.",
          "PCPartPicker link provided for the complete parts list.",
          "GeForce host and social links included in the description."
        ],
        "takeaways": [
          "The build pairs a GeForce RTX 5090 Founders Edition with a Corsair SF1000 SFX PSU and a Corsair Nautilus 240 RS AIO, showing the specific power and cooling components used for this high-end consumer GPU in an SFF chassis.",
          "A Fractal Design Era 2 chassis plus MSI MPG B850I Edge indicates a mini-ITX platform was used to accommodate the high-performance GPU.",
          "System uses a Ryzen 7 9800X3D and 32GB of DDR5-6000, demonstrating a consumer CPU and high-speed DDR5 memory paired with the RTX 5090.",
          "PCPartPicker link in the description provides a replicable BOM for procurement or compatibility review."
        ],
        "tags": [
          "GeForceGarage",
          "RTX5090",
          "SFF",
          "PCBuild",
          "FractalEra2",
          "Ryzen9800X3D",
          "DDR5-6000",
          "CorsairSF1000",
          "GeForceRTX50"
        ]
      }
    },
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy AI solutions that unlocked new revenue streams. They leveraged GenAI and Google Cloud's infrastructure to streamline operations, boost developer productivity, and compress their digital transformation timeline.",
        "bullets": [
          "TTEC worked with Google Cloud Consulting to accelerate AI prototyping and deployment.",
          "GenAI and Google Cloud infrastructure were used to streamline operations.",
          "Efforts boosted developer productivity.",
          "The initiative unlocked entirely new revenue streams for TTEC.",
          "Consulting compressed the digital transformation timeline and expanded business ambitions."
        ],
        "takeaways": [
          "Partnering with cloud consulting can speed AI deployment and shorten transformation timelines.",
          "Leveraging GenAI on robust cloud infrastructure can streamline operations.",
          "Improving developer productivity through cloud tools can accelerate delivery of AI solutions.",
          "AI deployments have potential to create new revenue streams and expand strategic possibilities."
        ],
        "tags": [
          "googlecloud",
          "ttec",
          "genai",
          "aideployment",
          "operationalefficiency",
          "customerexperience",
          "googlecloudplatform",
          "generativeai"
        ]
      }
    },
    {
      "id": "gv6zK265OUE",
      "title": "Build your first GraphRAG Powered Agent! (No Graph Expert Required) | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-27T20:55:49.000Z",
      "url": "https://www.youtube.com/watch?v=gv6zK265OUE",
      "thumbnail": "https://i.ytimg.com/vi/gv6zK265OUE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This session demonstrates how to build a GraphRAG-powered knowledge graph agent in an afternoon using the AI tools teams already use. It includes a live demo with real documents and provides sample code so you don’t need a six-month project to get started.",
        "bullets": [
          "Explains that valuable knowledge is trapped in docs, PDFs, and wikis and can be unlocked with knowledge graphs.",
          "Counters the perception that building a knowledge graph is a massive undertaking.",
          "Shows a practical, short workflow to build a GraphRAG agent in an afternoon.",
          "Includes a live demo using real documents.",
          "Provides sample code to reproduce the demo."
        ],
        "takeaways": [
          "Makes internal operational content (manuals, runbooks, specs) accessible to AI for faster, more informed decisions.",
          "Shorter build time reduces time-to-value compared with multi-month projects.",
          "Leverages existing AI tooling and provided sample code to accelerate prototyping and proof-of-concept work.",
          "Live-demo approach demonstrates practical applicability with real documents rather than abstract concepts."
        ],
        "tags": [
          "GraphRAG",
          "knowledge-graph",
          "RAG",
          "AI",
          "AWS",
          "Neptune",
          "sample-code",
          "live-demo",
          "documents",
          "wikis"
        ]
      }
    },
    {
      "id": "azzmtqcIeCU",
      "title": "Cloud Cost Efficiency I The Keys to AWS Optimization | S16 E2",
      "channel": "AWS Events",
      "published_at": "2026-01-27T10:14:44.000Z",
      "url": "https://www.youtube.com/watch?v=azzmtqcIeCU",
      "thumbnail": "https://i.ytimg.com/vi/azzmtqcIeCU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This livestream explores the key metrics that drive AWS cost efficiency, including KPIs like cost per transaction, resource utilization rates, and ROI calculations. It shows how to measure, track, and optimize AWS spending using metrics frameworks, benchmarking, and dashboards to align technical performance with business outcomes.",
        "bullets": [
          "Covers essential KPIs: cost per transaction, resource utilization, and ROI.",
          "Practical guidance on measuring and tracking AWS spend.",
          "Approaches to benchmarking cloud efficiency and spotting optimization opportunities.",
          "How to build dashboards that communicate value to stakeholders.",
          "Intended for cloud engineers, FinOps teams, and technical leaders."
        ],
        "takeaways": [
          "Tie cloud costs to business outcomes: cost-per-transaction metrics help prioritize optimizations.",
          "Use resource utilization rates to guide right-sizing and consolidation decisions.",
          "Apply ROI calculations to justify investments and compare optimization alternatives.",
          "Benchmarking reveals relative inefficiencies and targets for improvement.",
          "Dashboards speed stakeholder alignment and support data-driven cost decisions."
        ],
        "tags": [
          "AWS",
          "CloudCosts",
          "FinOps",
          "CostOptimization",
          "CloudMetrics",
          "AWSCostManagement",
          "CloudEfficiency",
          "KPIs",
          "ResourceUtilization",
          "CostPerTransaction"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Jo discovers the power of Copilot Groups, demonstrating how route planning can be made easy with Microsoft Copilot. The short video highlights Copilot's role in planning and group coordination.",
        "bullets": [
          "Route planning made easy is the core message.",
          "Feature highlighted: Copilot Groups for group-based planning.",
          "Jo is shown discovering the capability.",
          "Video is framed with tags: #copilot #microsoftcopilot #ai."
        ],
        "takeaways": [
          "Simpler route planning may improve field crew routing and logistics for operations teams.",
          "Group-focused planning (Copilot Groups) could support coordinated dispatch and team workflows.",
          "Easier planning workflows may help optimize scheduling for maintenance or site visits.",
          "Decision-makers should consider evaluating Copilot Groups for use cases involving multi-stop routing and team coordination."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "copilot-groups",
          "route-planning",
          "logistics",
          "field-operations",
          "productivity",
          "route-optimization"
        ]
      }
    }
  ]
}