{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-27T14:04:08.031Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "azzmtqcIeCU",
      "title": "AWS Cost Efficiency Metrics I The Keys to AWS Optimization | S16 E2",
      "channel": "AWS Events",
      "published_at": "2026-01-27T10:14:44.000Z",
      "url": "https://www.youtube.com/watch?v=azzmtqcIeCU",
      "thumbnail": "https://i.ytimg.com/vi/azzmtqcIeCU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This livestream explores the key metrics that drive AWS cost efficiency, including KPIs such as cost per transaction, resource utilization rates, and ROI, and explains how to measure, track, and optimize AWS spending. It also covers benchmarking, identifying cost-optimization opportunities, and building dashboards to communicate value to stakeholders for cloud engineers, FinOps teams, and technical leaders.",
        "bullets": [
          "Covers essential KPIs: cost per transaction, resource utilization, and ROI.",
          "Shows how to measure, track, and optimize AWS spending using metric frameworks.",
          "Explains practical benchmarking approaches to assess cloud efficiency.",
          "Identifies cost-optimization opportunities based on metrics and utilization.",
          "Guidance on building dashboards to communicate value to stakeholders."
        ],
        "takeaways": [
          "Use cost-per-transaction and ROI metrics to prioritize investments and justify spending decisions.",
          "Monitor resource utilization rates to identify right-sizing and efficiency opportunities.",
          "Benchmark cloud efficiency to reveal areas where costs can be reduced or performance improved.",
          "Create stakeholder-facing dashboards to translate technical metrics into business value and support budget decisions."
        ],
        "tags": [
          "AWS",
          "CostEfficiency",
          "FinOps",
          "CloudMetrics",
          "CostOptimization",
          "ResourceUtilization",
          "ROI",
          "CloudFinance",
          "Dashboards"
        ]
      }
    },
    {
      "id": "9vS5kvxbPMQ",
      "title": "My Porta-Potty Business Brings In $4.3M/Year",
      "channel": "CNBC Make It",
      "published_at": "2026-01-24T15:00:30.000Z",
      "url": "https://www.youtube.com/watch?v=9vS5kvxbPMQ",
      "thumbnail": "https://i.ytimg.com/vi/9vS5kvxbPMQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Daniel Tom, 31, owns Bay Area Sanitation, which operates nearly 2,000 portable toilets serving construction sites and events across the San Francisco Bay Area. The company reported $4.3 million in total income in 2025.",
        "bullets": [
          "Owner: Daniel Tom, age 31",
          "Company: Bay Area Sanitation",
          "Fleet: almost 2,000 portable toilets",
          "Customers: construction sites and events in the San Francisco Bay Area",
          "Revenue: $4.3M total income in 2025"
        ],
        "takeaways": [
          "A nearly 2,000-unit, asset-heavy operation highlights substantial logistics and service coordination needs that can inform local infrastructure planning.",
          "Reported $4.3M in 2025 signals steady commercial activity in sanitation services — useful as a datapoint for regional economic and demand assessments.",
          "Serving construction sites and events suggests demand tied to development cycles and event schedules, implying potential episodic load or service spikes to consider.",
          "Large mobile fleets typically require robust communications, routing, and tracking systems — areas where reliable connectivity and data services could be valuable."
        ],
        "tags": [
          "Daniel Tom",
          "Bay Area Sanitation",
          "portable toilets",
          "sanitation",
          "small business",
          "revenue",
          "CNBC Make It",
          "How I Made It",
          "Bay Area",
          "fleet management"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Jo discovers the power of Copilot Groups and how it makes route planning easy. The short video appears to showcase Microsoft Copilot simplifying route planning workflows.",
        "bullets": [
          "Route planning made easy is the core message.",
          "Highlights the capability called Copilot Groups.",
          "Presented through Jo’s discovery of the feature.",
          "Framed with hashtags: #copilot #microsoftcopilot #ai",
          "Focus is on simplicity and practical usefulness"
        ],
        "takeaways": [
          "If Copilot Groups simplifies route planning, decision-makers should consider evaluating it for planning field visits and maintenance routes.",
          "Easier route planning could support more efficient scheduling and potentially reduce travel time and costs for operations teams.",
          "Explore Copilot Groups as a complement to existing routing tools to assess fit with existing workflows and operational requirements"
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "Copilot Groups",
          "route planning",
          "Jo"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, KPMG Poland’s podcast episode presents AI in audit as an established, practical toolset that supports repetitive tasks, large-data analysis and decision-making. Katarzyna Chojniak and Alicja Barska outline concrete solutions (AI Transaction Scoring Tool, Clara AI, KPMG Clara), the move from sampling to full-population analysis, and address competencies, data security, regulatory aspects and potential risks.",
        "bullets": [
          "AI tools are used for repeatable tasks and analyzing full populations rather than samples.",
          "KPMG solutions highlighted: AI Transaction Scoring Tool, Clara AI (conversational assistant and specialist agents) and the KPMG Clara platform.",
          "Clara for Clients enables modern, real-time communication and management of the audit.",
          "Adoption shifts auditor roles and requires new competencies and adaptation.",
          "Discussion includes data security, regulatory environment and potential AI-related risks."
        ],
        "takeaways": [
          "Expect audits to leverage full-population analytics—prepare to provide complete, well-structured datasets.",
          "Ensure robust data security and compliance posture, as AI-driven audits heighten regulatory and privacy considerations.",
          "Adopt digital communication channels to streamline interactions with auditors using platforms like KPMG Clara.",
          "Invest in staff skills and documentation practices to meet auditors’ evolving competency expectations and support AI-enabled processes."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMG",
          "KPMG Clara",
          "Clara AI",
          "analiza pełnej populacji",
          "bezpieczeństwo danych",
          "innowacje",
          "komunikacja z klientem"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The video is a 4K launch trailer for Arknights: Endfield highlighting NVIDIA DLSS 4 with Multi Frame Generation, captured on a GeForce RTX 5080 at 4K Ultra settings. It also describes Arknights: Endfield as a 3D real-time strategy RPG where you play the Endministrator exploring Talos-II.",
        "bullets": [
          "Announces Arknights: Endfield launch and showcases NVIDIA DLSS 4 with Multi Frame Generation.",
          "Game described as a 3D real-time strategy RPG; player is the Endministrator exploring Talos-II.",
          "Trailer captured on GeForce RTX 5080 at 4K Ultra with DLSS 4 Multi Frame Generation 4X Mode.",
          "Provides links to NVIDIA DLSS 4 coverage and the official Arknights: Endfield site.",
          "Lists social channels for Arknights: Endfield and NVIDIA GeForce for follow-up."
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation indicates NVIDIA advancing real-time AI-driven frame synthesis—consider GPU feature support when evaluating hardware for graphics/AI workloads.",
          "Captured on an RTX 5080 at 4K Ultra settings suggests high-end GPUs may be required for native 4K capture with advanced upscaling features.",
          "Cloud gaming, streaming, or visualization providers should check for DLSS 4 compatibility when assessing platforms for next-gen gaming experiences.",
          "Review linked NVIDIA and game resources for implementation details, driver requirements, and supported hardware before procurement decisions."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "NVIDIA",
          "GeForceRTX5080",
          "4K",
          "GamingTrailer",
          "RealTimeStrategy",
          "RTXOn"
        ]
      }
    }
  ]
}