{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-27T09:53:33.422Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "wCJ_O97ww-k",
      "title": "World 1-3: Lens of Truth Obtained – Detective Controls Unlocked",
      "channel": "AWS Events",
      "published_at": "2026-01-27T08:10:22.000Z",
      "url": "https://www.youtube.com/watch?v=wCJ_O97ww-k",
      "thumbnail": "https://i.ytimg.com/vi/wCJ_O97ww-k/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this episode of PTD Today's weekly deep dive into cloud security (hosts Russ Noll and Tristan Watty Ph.D., Mondays at 11am PST) uses the 'Lens of Truth' metaphor to demonstrate deploying AWS detective controls. The session focuses on making invisible threats and hidden paths visible and bridging technical implementation with practical business solutions to transform security posture.",
        "bullets": [
          "Weekly cloud security deep dive hosted by Russ Noll and Tristan Watty Ph.D.",
          "Episode framed around the 'Lens of Truth' metaphor for visibility",
          "Practical focus on deploying AWS detective controls",
          "Aims to reveal hidden threats, secret passages, and invisible risks",
          "Bridges technical implementation with business-oriented solutions"
        ],
        "takeaways": [
          "Adopt AWS detective controls to surface hidden threats and unknown access paths in your cloud environment.",
          "Enhanced visibility can transform a blind security stance into a more informed security posture for grid/data center operations.",
          "Ensure detective control deployments are mapped to operational and compliance priorities to link technical work with business risk.",
          "Leverage recurring expert-led sessions to keep teams current on practical cloud-security implementations."
        ],
        "tags": [
          "cloud-security",
          "AWS",
          "detective-controls",
          "visibility",
          "threat-detection",
          "Russ-Noll",
          "Tristan-Watty",
          "weekly-webcast",
          "security-posture",
          "cloud-operations"
        ]
      }
    },
    {
      "id": "9vS5kvxbPMQ",
      "title": "My Porta-Potty Business Brings In $4.3M/Year",
      "channel": "CNBC Make It",
      "published_at": "2026-01-24T15:00:30.000Z",
      "url": "https://www.youtube.com/watch?v=9vS5kvxbPMQ",
      "thumbnail": "https://i.ytimg.com/vi/9vS5kvxbPMQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Daniel Tom, 31, owns and operates Bay Area Sanitation, which runs a fleet of almost 2,000 portable toilets serving construction sites and events across the San Francisco Bay Area. The company reported $4.3 million in total income in 2025.",
        "bullets": [
          "Owner: Daniel Tom, 31",
          "Company: Bay Area Sanitation",
          "Fleet: almost 2,000 portable toilets",
          "Service area: construction sites and events across the San Francisco Bay Area",
          "2025 total income: $4.3 million"
        ],
        "takeaways": [
          "Large-scale mobile infrastructure (nearly 2,000 units) can be deployed to support major construction and event needs during projects.",
          "A dedicated sanitation provider generated $4.3M in 2025, indicating significant commercial value in on-site services.",
          "For large construction or retrofit projects (including data centers), evaluate vendors for fleet size and regional coverage to ensure responsiveness.",
          "Financial scale of the provider can be a factor when assessing vendor reliability for multi-site or long-duration projects."
        ],
        "tags": [
          "CNBCMakeIt",
          "porta-potty",
          "sanitation",
          "DanielTom",
          "BayAreaSanitation",
          "portable-toilets",
          "small-business",
          "2025-revenue",
          "construction-services",
          "SanFranciscoBayArea"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights that route planning is made easy as Jo discovers the power of Copilot Groups. It presents Microsoft Copilot showcasing Copilot Groups and their role in simplifying route-related tasks.",
        "bullets": [
          "Route planning made easy",
          "Jo discovers the power of Copilot Groups",
          "Published by Microsoft Copilot",
          "Description includes hashtags: #copilot #microsoftcopilot #ai",
          "Short demo-style presentation of a Copilot feature"
        ],
        "takeaways": [
          "Copilot Groups are presented as a tool that can simplify route-planning workflows.",
          "Decision-makers should note Microsoft Copilot positioning Copilot Groups for operational routing tasks.",
          "Brief, feature-focused content like this can help communicate potential uses to operations teams."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "route-planning",
          "copilot-groups",
          "navigation",
          "productivity",
          "demo"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… KPMG Poland directors Katarzyna Chojniak and Alicja Barska discuss practical applications of AI in audit, highlighting tools that automate repetitive tasks, analyse full populations of data, and support decision-making. They outline specific solutions (AI Transaction Scoring Tool, Clara AI, KPMG Clara/Clara for Clients), changes to the auditor role, required competencies, implementation challenges, data-security and regulatory concerns, and potential risks.",
        "bullets": [
          "AI supports repetitive tasks, large-volume data analysis and decision support in audits.",
          "AI Transaction Scoring Tool enables analysis of complete populations rather than sampling.",
          "Clara AI provides conversational assistance and specialised agent support.",
          "KPMG Clara platform offers real-time audit management; Clara for Clients modernises client communication.",
          "Discussion covers auditor role shifts, necessary skills, implementation challenges, data security/regulation and AI-related risks."
        ],
        "takeaways": [
          "Leverage AI-driven full-population analysis to increase audit coverage and insight for infrastructure and transaction-heavy operations.",
          "Adopt real-time audit management and client-communication platforms to streamline compliance reporting and stakeholder interaction.",
          "Prioritise data security and regulatory compliance when integrating AI into audit or monitoring workflows.",
          "Invest in upskilling staff to interpret AI outputs and oversee AI-assisted audit processes as roles evolve.",
          "Plan for implementation challenges and assess AI-related risks before deploying tools across critical systems."
        ],
        "tags": [
          "audit",
          "AI",
          "KPMG",
          "KPMG Clara",
          "Clara AI",
          "transaction-scoring",
          "data-security",
          "regulation",
          "audit-innovation",
          "analytics"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield has officially launched and includes NVIDIA DLSS 4 with Multi Frame Generation. The trailer is captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 Multi Frame Generation 4X Mode and describes the game as a 3D real-time strategy RPG set on Talos-II.",
        "bullets": [
          "Arknights: Endfield release announcement highlighting NVIDIA DLSS 4 with Multi Frame Generation.",
          "Game genre: 3D real-time strategy RPG where players act as the Endministrator on Talos-II.",
          "Trailer captured on GeForce RTX 5080 at 4K Ultra using DLSS 4 MFG 4X Mode.",
          "Publisher and NVIDIA provide links and social channels for more info and community follow-up."
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is being integrated into new AAA titles, indicating a growing software ecosystem for frame-generation tech.",
          "Showcase capture on an RTX 5080 at 4K suggests high-end GPU hardware is being used to demonstrate DLSS 4 capabilities.",
          "Availability of DLSS 4-enabled content may inform procurement and benchmarking priorities for teams evaluating GPU fleets for rendering or real-time visualization workloads.",
          "Game launches with advanced NVIDIA features can require testing of driver and software compatibility in lab/production environments before wider deployment."
        ],
        "tags": [
          "Arknights",
          "Endfield",
          "DLSS4",
          "MultiFrameGeneration",
          "NVIDIA",
          "RTX5080",
          "4K",
          "Gaming"
        ]
      }
    }
  ]
}