{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-19T17:48:00.579Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Dr. Anna Chacon, 39, is a Miami-based dermatologist who runs a private practice. Her net worth is reported as about $6 million, made up of $3.2 million in investments, a $1.9 million home and a $1.1 million office building.",
        "bullets": [
          "Dr. Anna Chacon, age 39, is a dermatologist with a private practice in Miami, FL.",
          "Reported net worth: approximately $6 million.",
          "Investments account for $3.2 million of that total.",
          "Real estate holdings include a $1.9 million home and a $1.1 million office building."
        ],
        "takeaways": [
          "Description contains personal finance and asset details only; no operational or energy information relevant to grid/data-center planning.",
          "No data provided on facility energy use, IT infrastructure, or power requirements that would inform grid or data center decisions.",
          "Unable to derive implications for capacity, resilience, or site selection from the available description."
        ],
        "tags": [
          "Dr. Anna Chacon",
          "dermatologist",
          "Miami",
          "private practice",
          "net worth",
          "investments",
          "home",
          "office building",
          "real estate",
          "personal finance"
        ]
      }
    },
    {
      "id": "6L86-OnOXV0",
      "title": "How I Built A $1M/Year Business - And Helped My Parents Retire",
      "channel": "CNBC Make It",
      "published_at": "2026-01-17T15:00:09.000Z",
      "url": "https://www.youtube.com/watch?v=6L86-OnOXV0",
      "thumbnail": "https://i.ytimg.com/vi/6L86-OnOXV0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Tuan Le emigrated from Vietnam to Toronto in 2015 and vowed at 15 to help his parents retire. Ten years later his social video production company, ShortsCut, now brings in over $1 million USD annually, and he pays his parents' rent and living expenses so they no longer have to work full time.",
        "bullets": [
          "Founder: Tuan Le, immigrant from Vietnam to Toronto (2015).",
          "Company: ShortsCut — a social video production business.",
          "Revenue: Generates over $1 million USD per year in sales.",
          "Personal impact: He financially supports his parents, allowing them to stop full‑time work.",
          "This story was produced by CNBC Make It (production and editing credits listed)."
        ],
        "takeaways": [
          "A social video production studio can scale to >$1M/year, indicating commercial viability in the creator/content production vertical.",
          "Growing video businesses likely create ongoing demand for digital infrastructure (storage, processing, distribution) to support content workflows.",
          "Fast‑growing creator studios represent a potential customer segment for services that optimize video editing, hosting, and delivery.",
          "Success stories from immigrant‑founded startups highlight diverse origins of high‑value, revenue‑generating customers to monitor."
        ],
        "tags": [
          "Tuan Le",
          "ShortsCut",
          "social video production",
          "entrepreneurship",
          "immigrant success",
          "CNBC Make It",
          "million-dollar business",
          "family support",
          "Toronto",
          "short-form video"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video presents a giant carbon dioxide \"bubble\" battery that stores 8 hours of energy and can deliver 20 megawatts. The description frames the technology as a tool to manage fluctuating renewable generation and help drive a global shift to clean energy.",
        "bullets": [
          "Giant CO2 bubble battery concept featured",
          "Stores 8 hours of energy (title)",
          "Can deliver/store 20 megawatts (description)",
          "Designed to address fluctuating renewable energy supply",
          "Presented as supporting the global transition to clean energy"
        ],
        "takeaways": [
          "8-hour, 20 MW capacity suggests multi-hour backup potential for grids or large facilities",
          "Can help smooth renewable variability to improve reliability for data centers and grid operators",
          "Positioned as enabling greater renewable penetration to support decarbonization goals"
        ],
        "tags": [
          "ieee",
          "tech",
          "ieeespectrum",
          "innovation",
          "future",
          "futuristic",
          "energy",
          "battery"
        ]
      }
    },
    {
      "id": "OINppmPan0o",
      "title": "Figure Skating | Making Team USA presented by Xfinity with Apolo Ohno",
      "channel": "Team USA",
      "published_at": "2026-01-16T19:30:36.000Z",
      "url": "https://www.youtube.com/watch?v=OINppmPan0o",
      "thumbnail": "https://i.ytimg.com/vi/OINppmPan0o/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Figure skating duo Vadym Kolesnik and Emilia Zingas sit down with Apolo Ohno in an episode of Making Team USA presented by Xfinity ahead of the Winter Olympics. The episode is framed around trust and is promoted across Team USA’s YouTube and social channels.",
        "bullets": [
          "Features Vadym Kolesnik and Emilia Zingas in conversation with Apolo Ohno.",
          "The episode theme is “built on trust.”",
          "Part of the Making Team USA series presented by Xfinity.",
          "Positioned ahead of the Winter Olympics.",
          "Promoted via Team USA YouTube and social platforms (Facebook, Twitter, Instagram, TikTok)."
        ],
        "takeaways": [
          "Multi-platform video distribution (YouTube + social) implies a need for scalable streaming and CDN capacity around Olympic-related content.",
          "Collaboration with a presenter/sponsor like Xfinity may require integration with third-party networks and peering arrangements.",
          "Episodic athlete content benefits from robust media asset management and archival storage for repurposing.",
          "Cross-platform promotion calls for monitoring, analytics, and capacity planning to handle traffic spikes."
        ],
        "tags": [
          "Vadym Kolesnik",
          "Emilia Zingas",
          "Apolo Ohno",
          "Figure Skating",
          "Making Team USA",
          "Xfinity",
          "Winter Olympics",
          "Team USA",
          "YouTube",
          "Social Media"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI już teraz zmienia podejście do cen transferowych — od monitorowania rentowności i analiz porównawczych po automatyzację dokumentacji. W podcaście eksperci KPMG, Monika Palmowska i Jakub Roszkiewicz, omawiają obecne zastosowania, związane ryzyka (dane, bezpieczeństwo, RODO, halucynacje) oraz praktyczne kroki wdrożeniowe, w tym bezpieczne środowisko Digital Gateway i integrację z ERP; akcentują też, że AI wzmacnia doradców, a nie ich zastępuje.",
        "bullets": [
          "AI w TP: monitorowanie rentowności, benchmarki porównawcze i automatyzacja dokumentacji.",
          "AI ma wspierać doradców i rozwój kompetencji młodszych pracowników, nie zastępować ekspertów.",
          "Główne ryzyka: ochrona danych, bezpieczeństwo, zgodność z RODO i problem halucynacji AI.",
          "Rozwiązania techniczne: Digital Gateway jako bezpieczne środowisko i integracja AI z ERP/inteligentnymi benchmarkami.",
          "Wdrożenie: rozpocząć od uporządkowania procesów i realizacji pierwszych, wyraźnie zdefiniowanych kroków."
        ],
        "takeaways": [
          "Zapewnij bezpieczne środowisko pracy z AI (np. Digital Gateway) — priorytet dla infrastruktury i operacji centrum danych.",
          "Skoncentruj się na zarządzaniu danymi i zgodności z RODO; polityki prywatności i szyfrowanie muszą być wdrożone przed użyciem AI.",
          "Planuj integrację AI z istniejącymi systemami ERP i narzędziami benchmarkowymi, by uzyskać użyteczne, zautomatyzowane wyniki.",
          "Przed wdrożeniem uporządkuj procesy operacyjne — to fundament skutecznej transformacji AI.",
          "Inwestuj w szkolenia i wsparcie dla zespołów — AI ma wzmacniać kompetencje pracowników, nie je zastępować."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "podatki",
          "transfer pricing",
          "automatyzacja",
          "bezpieczeństwo danych",
          "RODO",
          "ERP",
          "KPMG",
          "monitorowanie rentowności"
        ]
      }
    },
    {
      "id": "dGfcT63U7Mo",
      "title": "The 2026 U.S. Olympic Figure Skating Team 🇺🇸",
      "channel": "Team USA",
      "published_at": "2026-01-15T20:43:24.000Z",
      "url": "https://www.youtube.com/watch?v=dGfcT63U7Mo",
      "thumbnail": "https://i.ytimg.com/vi/dGfcT63U7Mo/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video presents the U.S. Olympic Figure Skating lineup for 2026 as posted by Team USA. The short description highlights the lineup and tags the Winter Olympics, and no transcript is available for the video.",
        "bullets": [
          "Title: The 2026 U.S. Olympic Figure Skating Team (Channel: Team USA).",
          "Published date: 2026-01-15T20:43:24.000Z.",
          "Description text: \"This U.S. Olympic Figure Skating lineup. 🔥 #WinterOlympics\".",
          "No transcript is available for the video."
        ],
        "takeaways": [
          "Olympics-focused content from an official channel can drive spikes in viewership around event dates—ensure scalable streaming capacity and CDN readiness.",
          "Prepare monitoring and alerting for elevated traffic and social engagement tied to Olympic announcements and roster releases.",
          "Optimize caching and origin protection to handle short-term bursts from shares and searches related to the Winter Olympics.",
          "Verify analytics and logging pipelines are capturing increased activity to support post-event analysis and capacity planning."
        ],
        "tags": [
          "2026",
          "Team USA",
          "Figure Skating",
          "U.S. Olympic Team",
          "Winter Olympics",
          "Olympics",
          "Sports",
          "FigureSkating"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video encourages using Microsoft Copilot to keep momentum by stacking small wins. It frames Copilot as a tool to maintain progress across workouts, projects, and personal goals.",
        "bullets": [
          "Promotes stacking small wins to sustain momentum.",
          "Targets a range of activities: workouts, projects, personal goals.",
          "Positions Microsoft Copilot as the supporting tool.",
          "Emphasizes maintaining progress and motivation."
        ],
        "takeaways": [
          "Leverage Copilot to help sustain momentum on long-running infrastructure or upgrade projects.",
          "Use Copilot to support routine operational tasks that benefit from steady, incremental progress.",
          "Consider Copilot as a tool to keep teams motivated through visible, small wins during complex deployments."
        ],
        "tags": [
          "Microsoft Copilot",
          "productivity",
          "momentum",
          "small wins",
          "workouts",
          "projects",
          "personal goals",
          "motivation",
          "AI assistant"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights how high-frequency trading depends on precision and speed, showcasing the Dell PowerEdge R770AP server powered by Intel® Xeon® 6 processors. It states this configuration helps maximize gains and minimize losses by enabling hundreds of trades in seconds and positions Intel Xeon 6 CPUs as shaping the future of finance.",
        "bullets": [
          "Focus on high-frequency trading where every second matters.",
          "Showcases Dell PowerEdge R770AP server with Intel® Xeon® 6 processors.",
          "Emphasizes precision and speed to maximize gains and minimize losses.",
          "Claims the system can perform hundreds of trades in seconds.",
          "Positions Intel Xeon 6 CPUs as defining the future of finance."
        ],
        "takeaways": [
          "Invest in low-latency, high-performance servers (e.g., Dell PowerEdge R770AP) for time-sensitive trading workloads.",
          "Prioritize CPU performance (Intel Xeon 6) where microseconds can impact gains and losses.",
          "Ensure infrastructure can support hundreds of trades per second to meet HFT demands.",
          "Performance and precision at the server/CPU level are presented as strategic differentiators for financial operations."
        ],
        "tags": [
          "high-frequency-trading",
          "Dell-PowerEdge-R770AP",
          "Intel-Xeon-6",
          "low-latency",
          "finance",
          "data-center",
          "trading",
          "server-performance",
          "real-time",
          "HFT"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the creative spark was out and Copilot brought it back to life. The video invites viewers to download Copilot and try it for themselves via the link in bio.",
        "bullets": [
          "The creative spark was out.",
          "Copilot brought creativity back to life.",
          "Viewers are encouraged to download Copilot.",
          "Download link is in the bio.",
          "Call to action: try it for yourself."
        ],
        "takeaways": [
          "If creative block impacts team problem-solving, a hands-on trial of Copilot could show whether it helps restore ideation.",
          "Use the provided link in bio to quickly access a trial and evaluate fit for your workflows.",
          "A short evaluation can reveal whether Copilot improves creative output or speeds up design discussions."
        ],
        "tags": [
          "copilot",
          "creativity",
          "download",
          "ai-assistant",
          "productivity",
          "try-it",
          "link-in-bio",
          "call-to-action"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video showcases Where Winds Meet, an open-world martial arts RPG. It highlights use of DLSS 4 with Multi Frame Generation and features #RTXOn. Footage is credited to @DigitalDreamsyt.",
        "bullets": [
          "Open-world martial arts RPG: Where Winds Meet",
          "Showcases DLSS 4 with Multi Frame Generation",
          "Promoted with #RTXOn (RTX-enabled visuals)",
          "Video footage credited to @DigitalDreamsyt"
        ],
        "takeaways": [
          "Demonstrates adoption of DLSS 4 with Multi Frame Generation in an upcoming title—relevant for NVIDIA feature support planning.",
          "Features #RTXOn, indicating RTX-enabled content that may affect GPU capability requirements for rendering or streaming.",
          "Content originates from a creator (@DigitalDreamsyt), highlighting third-party footage/marketing assets to consider in delivery workflows."
        ],
        "tags": [
          "Where Winds Meet",
          "DLSS 4",
          "Multi Frame Generation",
          "RTXOn",
          "Open-world",
          "Martial Arts RPG",
          "NVIDIA GeForce",
          "DigitalDreamsyt"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this YouTube video is titled \"Taha Khalifa (Intel) | Intel Business\" and is published on the Intel Business channel. The description positions Intel Business as a hub for IT information—covering data centers to devices—and directs viewers to subscribe and connect via the Intel Business website and social channels.",
        "bullets": [
          "Video title: \"Taha Khalifa (Intel) | Intel Business\"; no transcript provided.",
          "Intel Business is presented as a resource for IT information across data centers and devices.",
          "The channel offers resources, guidance, and expert insights to help complete IT projects.",
          "Calls to action: subscribe to the YouTube channel and visit the Intel Business website.",
          "Social links included for X, LinkedIn, and Facebook to follow Intel Business updates."
        ],
        "takeaways": [
          "Intel Business aims to be a centralized source of resources and expert guidance relevant to data center projects.",
          "Decision-makers can use the Intel Business website and channel as a regular information source for IT and infrastructure topics.",
          "Subscribing and following Intel Business on social platforms provides ongoing access to updates and insights that may inform project planning."
        ],
        "tags": [
          "IntelBusiness",
          "TahaKhalifa",
          "ITresources",
          "datacenter",
          "devices",
          "ITguidance",
          "expertinsights",
          "subscribe",
          "technology"
        ]
      }
    },
    {
      "id": "kSocjh8PZnQ",
      "title": "Rynek dóbr luksusowych w obliczu transformacji | Andrzej Marczak, Tomasz Wiśniewski",
      "channel": "KPMG Poland",
      "published_at": "2026-01-13T10:23:31.000Z",
      "url": "https://www.youtube.com/watch?v=kSocjh8PZnQ",
      "thumbnail": "https://i.ytimg.com/vi/kSocjh8PZnQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Podcast KPMG ON AIR omawia kluczowe trendy na rynku dóbr luksusowych: nacisk na doświadczania, rosnące znaczenie ESG, zjawisko „affordable luxury” oraz wpływ pokolenia Z. Eksperci KPMG (Andrzej Marczak i Tomasz Wiśniewski) porównują globalne trendy z sytuacją w Polsce, wskazując na rosnący, choć rozproszony, rynek oraz kierunki rozwoju jak AI, rzemiosło i ludzki wymiar luksusu.",
        "bullets": [
          "Główne trendy: experiential luxury, ESG i „affordable luxury”",
          "Nierównomierna struktura rynku: 2% klientów generuje 40% wartości",
          "Pokolenie Z preferuje przeżycia ponad posiadanie; personalizacja i ekskluzywne doświadczenia",
          "Polska: rynek rośnie mimo globalnych spadków, ale jest rozproszony; wchodzenie Polaków do świata luksusu",
          "Sektory i przyszłość: luksus w hotelarstwie i filmie, rynek sztuki, turystyka premium oraz wpływ AI, rzemiosła i wartości ludzkich"
        ],
        "takeaways": [
          "Rosnące wykorzystanie AI i personalizacji (wskazane w podcaście) może zwiększać zapotrzebowanie na moc obliczeniową i niskie opóźnienia — warto uwzględnić to w planach infrastrukturalnych.",
          "Zwiększone znaczenie ESG w segmencie luksusowym sugeruje większy nacisk na efektywność energetyczną i certyfikacje centrów danych.",
          "Skala i dynamika wzrostu rynku w Polsce (mimo globalnych spadków) wskazują na potrzebę elastycznego skalowania zasobów lokalnych i regionalnych.",
          "Rosnące znaczenie doświadczeń cyfrowych i sektorów takich jak turystyka premium i sztuka oznacza potrzebę zabezpieczeń danych i stabilnych łączy dla usług cyfrowych."
        ],
        "tags": [
          "luksus",
          "ESG",
          "doświadczenie",
          "affordable-luxury",
          "Polska",
          "AI",
          "turystyka-premium",
          "rynek-sztuki"
        ]
      }
    }
  ]
}