{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-28T02:39:44.000Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "gv6zK265OUE",
      "title": "Build your first GraphRAG Powered Agent! (No Graph Expert Required) | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-27T20:55:49.000Z",
      "url": "https://www.youtube.com/watch?v=gv6zK265OUE",
      "thumbnail": "https://i.ytimg.com/vi/gv6zK265OUE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This session shows how to turn information trapped in docs, PDFs, and wikis into a knowledge graph quickly, using the AI tools teams already use. It includes a live demo with real documents and emphasizes that building a useful graph is doable in an afternoon rather than a six‑month project.",
        "bullets": [
          "Problem: important knowledge is locked in unstructured documents.",
          "Solution: use knowledge graphs to make that information actionable for AI.",
          "Barrier reframed: building a graph need not be a massive, months‑long effort.",
          "Approach: practical, fast build using familiar AI tooling.",
          "Format: live demo with real documents to show end‑to‑end feasibility."
        ],
        "takeaways": [
          "Faster access to operational knowledge from manuals, PDFs, and wikis can speed troubleshooting and decision cycles.",
          "Shorter implementation timelines reduce disruption and lower upfront project risk compared with lengthy engineering efforts.",
          "Leveraging existing AI tools minimizes new toolchain investments and eases integration with current systems.",
          "A practical live demo indicates the approach is implementable with real documents, not just theory."
        ],
        "tags": [
          "knowledge-graphs",
          "GraphRAG",
          "AI",
          "documents",
          "PDFs",
          "wikis",
          "demo",
          "Databases-for-AI",
          "AWS-Events"
        ]
      }
    },
    {
      "id": "yUpQ9pWA9WE",
      "title": "Watch Live: Fed Chair Jerome Powell Holds News Conference | WSJ",
      "channel": "WSJ News",
      "published_at": "2026-01-27T20:49:24.000Z",
      "url": "https://www.youtube.com/watch?v=yUpQ9pWA9WE",
      "thumbnail": "https://i.ytimg.com/vi/yUpQ9pWA9WE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Federal Reserve Chair Jerome Powell speaks to reporters following the Federal Reserve's two-day policy-setting meeting. The WSJ News video covers his post-meeting news conference.",
        "bullets": [
          "Speaker: Federal Reserve Chair Jerome Powell",
          "Event: Post-meeting press conference after a two-day Fed policy-setting meeting",
          "Format: Live/recorded news conference with reporters",
          "Source: WSJ News video",
          "Published: 2026-01-27T20:49:24.000Z"
        ],
        "takeaways": [
          "Monitor the press conference or transcript promptly to capture any policy signals that could affect financing conditions.",
          "Review short-term capital and financing plans that are sensitive to interest-rate expectations.",
          "Check liquidity and contingency plans in case of market volatility following policy commentary.",
          "Coordinate with treasury and procurement teams to assess near-term budget or contract implications."
        ],
        "tags": [
          "JeromePowell",
          "Fed",
          "FederalReserve",
          "WSJ",
          "pressconference",
          "policymeeting",
          "live",
          "finance"
        ]
      }
    },
    {
      "id": "MuQmKCWjSYI",
      "title": "Deutsche Bank accelerates Cloud journeys with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-27T17:39:29.000Z",
      "url": "https://www.youtube.com/watch?v=MuQmKCWjSYI",
      "thumbnail": "https://i.ytimg.com/vi/MuQmKCWjSYI/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Google Cloud Consulting helped Deutsche Bank design novel learning experiences that made thousands of engineers fluent in cloud engineering. The program used Generative AI to deliver personalized, interactive training that combines on‑demand convenience with the effectiveness of instructor‑led sessions, with Google Cloud Consulting Learning Services supplying the creative and technical expertise to build the Deutsche Bank Cloud Engineering Program and accelerate their cloud journey.",
        "bullets": [
          "Designed novel learning experiences to train thousands of engineers in cloud engineering.",
          "Used Generative AI to create personalized, interactive training content.",
          "Blended on‑demand learning with instructor‑led effectiveness for maximum impact.",
          "Google Cloud Consulting Learning Services provided creative innovation and technical expertise.",
          "Program aimed to massively accelerate Deutsche Bank’s cloud journey."
        ],
        "takeaways": [
          "Investing in tailored cloud training can rapidly close skills gaps during cloud migrations.",
          "Generative AI can scale personalization, improving training effectiveness and speed to competency.",
          "Blended on‑demand plus instructor‑led approaches give operations teams flexibility without sacrificing depth.",
          "Engaging expert cloud consulting accelerates program design and overall cloud adoption."
        ],
        "tags": [
          "Deutsche Bank",
          "Google Cloud",
          "Cloud Engineering",
          "Generative AI",
          "Learning Services",
          "Workforce Development",
          "Cloud Adoption",
          "Consulting",
          "Training",
          "Blended Learning"
        ]
      }
    },
    {
      "id": "5CyVBSbHmbA",
      "title": "Year-end toolkit: Strengthening audit committee collaboration",
      "channel": "PwC US",
      "published_at": "2026-01-27T17:20:31.000Z",
      "url": "https://www.youtube.com/watch?v=5CyVBSbHmbA",
      "thumbnail": "https://i.ytimg.com/vi/5CyVBSbHmbA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This episode focuses on how finance teams can strengthen collaboration with audit committees during the year-end accounting and reporting process. It covers communication and reporting best practices and addresses emerging oversight areas including AI, enterprise risk management, cyber risk in the age of AI, transformation initiatives, and proxy disclosures.",
        "bullets": [
          "Strengthening management/audit committee communication and collaboration (1:18)",
          "Key year-end accounting and reporting issues finance teams should prepare to address (10:10)",
          "Oversight of AI: risks, opportunities, and controls (15:02)",
          "Enhancing enterprise risk oversight and navigating evolving cyber risk in the age of AI (21:33, 27:35)",
          "Elevating proxy disclosures and links to replay/publication resources (36:05)"
        ],
        "takeaways": [
          "Ensure audit committee engagement explicitly covers AI use, including documented risks, controls, and governance for AI-driven systems that affect operations.",
          "Bring cyber risk and AI-related threat scenarios into year-end reporting and committee briefings to support board-level oversight of operational resilience.",
          "Integrate enterprise risk management and transformation initiatives into audit committee updates so governance reflects material changes to operations and strategy."
        ],
        "tags": [
          "audit committee",
          "year-end",
          "accounting and reporting",
          "AI oversight",
          "enterprise risk management",
          "cyber risk",
          "proxy disclosures",
          "governance",
          "finance teams",
          "transformation initiatives"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video shows Jo discovering the power of Copilot Groups to make route planning easy. The short description links the content to Microsoft Copilot and AI via hashtags.",
        "bullets": [
          "Route planning made easy.",
          "Jo discovers Copilot Groups.",
          "Connected to Microsoft Copilot.",
          "Includes hashtags: #copilot #microsoftcopilot #ai"
        ],
        "takeaways": [
          "Based on the description, Copilot Groups is positioned as a route-planning tool—decision-makers in grid and data center operations may want to evaluate its relevance for field routing needs.",
          "If Copilot Groups simplifies route planning, it could be considered for pilot testing in maintenance scheduling or technician dispatch workflows.",
          "The Microsoft Copilot/AI association suggests reviewing integration, security, and compliance implications before adoption.",
          "View the video or seek more details to determine fit with existing operational systems and processes."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "route-planning",
          "CopilotGroups",
          "Jo",
          "field-operations",
          "tech-dispatch"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, KPMG Poland discusses how AI is already embedded in modern audit work, supporting repetitive tasks, large‑scale data analysis and decision‑making. The conversation highlights practical tools (np. AI Transaction Scoring, Clara AI), a shift from sampling to full‑population analysis, changes in the auditor role, and challenges around data security and regulation.",
        "bullets": [
          "AI tools (AI Transaction Scoring, Clara AI) enable analysis of full populations and conversational/agent support.",
          "KPMG Clara platform provides real‑time audit management and Clara for Clients improves client communication.",
          "Shift from sampling to full‑population analysis changes audit procedures and auditor responsibilities.",
          "Adoption requires new auditor competencies and adaptation to technological innovation.",
          "Key implementation concerns include data security, regulatory environment and potential AI‑related risks."
        ],
        "takeaways": [
          "Ensure secure, compliant data access—data security and regulation are central when enabling AI‑driven audits.",
          "Provide high‑quality, complete datasets to enable full‑population analyses rather than relying on sampling.",
          "Prepare IT/operations for real‑time audit interactions by integrating systems with audit platforms like KPMG Clara.",
          "Invest in staff skills so internal teams can collaborate effectively with AI‑enabled auditors and client communication tools."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMG",
          "Clara",
          "AI Transaction Scoring",
          "Clara AI",
          "audit-automation",
          "data-security",
          "regulation"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Arknights: Endfield has officially launched and includes NVIDIA DLSS 4 with Multi Frame Generation. The launch trailer was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 Multi Frame Generation 4X Mode.",
        "bullets": [
          "Arknights: Endfield is a 3D real-time strategy RPG where you play the Endministrator of Endfield Industries on Talos-II.",
          "The game launch includes support for NVIDIA DLSS 4 with Multi Frame Generation (NVIDIA news link provided).",
          "Trailer captured on GeForce RTX 5080 at 4K Ultra Settings using DLSS 4 Multi Frame Generation 4X Mode.",
          "Official game site and NVIDIA DLSS 4 announcement links are provided for more details.",
          "Social channels listed for Arknights: Endfield and NVIDIA GeForce (X, YouTube, Instagram, Facebook, TikTok, Twitch)."
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is now supported in a released title—consider evaluating DLSS 4 support in cloud gaming and VDI offerings.",
          "The trailer uses GeForce RTX 5080 hardware at 4K with DLSS 4 MFG 4X Mode—validate compatibility and driver support on RTX 50-series or equivalent server GPUs.",
          "NVIDIA-published resources (news link and GeForce community portal) are the primary references for implementation details and testing.",
          "Assess streaming/encoding and remote-rendering pipelines for 4K assets produced with DLSS 4 to ensure delivery performance and quality."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "NVIDIA",
          "GeForce",
          "RTX5080",
          "4K",
          "gaming",
          "launch"
        ]
      }
    }
  ]
}