{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-30T22:51:07.010Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "z-X9MYi1Rr0",
      "title": "Leveraging tax credits and incentives for sustainability projects",
      "channel": "PwC US",
      "published_at": "2026-01-30T13:27:25.000Z",
      "url": "https://www.youtube.com/watch?v=z-X9MYi1Rr0",
      "thumbnail": "https://i.ytimg.com/vi/z-X9MYi1Rr0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Randa Barsoum, Tax Partner at PwC US, highlights that tax credits for sustainability extend beyond obvious energy incentives to include state and local abatements, location-based incentives, and R&D tax credits tied to innovation. The core message is that viewing sustainability investments through a broader tax lens can unlock meaningful tax value for businesses.",
        "bullets": [
          "Tax incentives for sustainability are broader than just energy credits.",
          "State and local abatements and location-based incentives can support projects.",
          "R&D tax credits may apply to innovation efforts like reimagining packaging or processes.",
          "Viewing sustainability investments through a wider tax perspective can generate meaningful tax value."
        ],
        "takeaways": [
          "When evaluating sites, factor state and local abatements and location-based incentives into siting and cost models.",
          "Include potential R&D tax credits in the business case for process or packaging innovations tied to sustainability.",
          "Broaden project ROI analyses to capture tax value from non-energy incentives.",
          "Work sustainability planning into tax strategy to maximize available incentives and reduce net project costs."
        ],
        "tags": [
          "sustainability",
          "tax-credits",
          "incentives",
          "R&D",
          "state-local-abatements",
          "location-based-incentives",
          "PwC",
          "energy-incentives",
          "corporate-tax",
          "sustainability-strategy"
        ]
      }
    },
    {
      "id": "oQtkaHzUYlY",
      "title": "Copilot helps Christa find her inner star 🌟",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-29T18:33:49.000Z",
      "url": "https://www.youtube.com/watch?v=oQtkaHzUYlY",
      "thumbnail": "https://i.ytimg.com/vi/oQtkaHzUYlY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video frames Copilot as helping Christa \"find the star within\" against a sky full of stars. It closes with a clear call to action to download and try Copilot via the link in the creator's bio.",
        "bullets": [
          "Theme: finding your inner star / personal empowerment",
          "Copilot is presented as the assisting tool",
          "Mentions a sky full of stars as the visual/metaphoric motif",
          "Clear call to action to download and try Copilot",
          "Download link referenced as \"link in bio\""
        ],
        "takeaways": [
          "This is a consumer-facing promotion positioning Copilot as a personal/creative aid.",
          "The description contains a direct call to action to download Copilot via a social \"link in bio.\"",
          "Messaging emphasizes emotional/user-experience appeal rather than technical details."
        ],
        "tags": [
          "Copilot",
          "Christa",
          "find your star",
          "stars",
          "download",
          "link in bio",
          "promo",
          "uplifting",
          "AI"
        ]
      }
    },
    {
      "id": "BYtYm-xyKR8",
      "title": "Bringing In $251K A Year With 3 Jobs In The Bay Area",
      "channel": "CNBC Make It",
      "published_at": "2026-01-29T17:47:46.000Z",
      "url": "https://www.youtube.com/watch?v=BYtYm-xyKR8",
      "thumbnail": "https://i.ytimg.com/vi/BYtYm-xyKR8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Naseema McElroy, 44, is a labor and delivery nurse in Brentwood, California who also runs a personal finance brand and brings in $251K a year across three jobs. After accumulating nearly $1 million in debt in 2015, she started Financially Intentional to document her debt-payoff journey and was debt-free by 2017.",
        "bullets": [
          "Labor and delivery nurse and personal finance creator based in Brentwood, CA.",
          "Founded Financially Intentional to document debt payoff and money lessons.",
          "Nearly $1M in debt in 2015; became debt-free by 2017.",
          "Earns $251K annually from three jobs in the Bay Area.",
          "Profiled in CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "High-earning, multi-job professionals in the Bay Area help sustain demand for online financial content and related digital services, implying steady local traffic for data platforms.",
          "Side businesses and content creation typically rely on cloud, streaming, and hosting services—plan capacity and reliability to support creator-driven workloads.",
          "Profiles like this indicate regional demand for low-latency access and resilient connectivity, relevant when evaluating colocation or edge deployments near Bay Area markets."
        ],
        "tags": [
          "Naseema McElroy",
          "Financially Intentional",
          "debt payoff",
          "labor and delivery nurse",
          "Bay Area",
          "side hustle",
          "CNBC Make It",
          "Millennial Money",
          "251K income",
          "personal finance"
        ]
      }
    },
    {
      "id": "t6y2cVNjCAw",
      "title": "GeForce Garage - Summer of RTX Community Build",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-29T14:01:25.000Z",
      "url": "https://www.youtube.com/watch?v=t6y2cVNjCAw",
      "thumbnail": "https://i.ytimg.com/vi/t6y2cVNjCAw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video announces the winner of the Summer of RTX r/buildapc Community Build contest, showcasing a small-form-factor GeForce RTX 5090 rig built by u/JeffersonPutnam. The description lists the full winning system specs and provides links to the PCPartPicker build, the GeForce host, and NVIDIA GeForce social channels.",
        "bullets": [
          "Winner: u/JeffersonPutnam from the r/buildapc Community Build contest.",
          "Featured system: a small-form-factor GeForce RTX 5090 rig in a Fractal Design Era 2 chassis.",
          "Key components listed: RTX 5090 Founders Edition, MSI MPG B850I Edge, Ryzen 7 9800X3D, 32GB DDR5-6000, Corsair SF1000 PSU, Corsair Nautilus 240 RS AIO.",
          "Links included: host (Dwight) Twitter and full parts list on PCPartPicker, plus GeForce social/community links."
        ],
        "takeaways": [
          "The build demonstrates community use of an RTX 5090 in enthusiast SFF systems—useful signal of high-end consumer GPU deployment scenarios.",
          "Power and cooling choices (Corsair SF1000 SFX PSU and Nautilus 240 RS AIO) highlight the PSU and thermal considerations required to integrate a top-tier GPU into compact chassis.",
          "Platform pairing (MSI B850I Edge + Ryzen 7 9800X3D) provides a concrete example of a modern CPU/motherboard combination used with the RTX 5090 for high-performance builds.",
          "Public parts list (PCPartPicker) and social/community coverage offer accessible configuration data and adoption signals that can be monitored for market and compatibility insights."
        ],
        "tags": [
          "GeForceGarage",
          "RTX5090",
          "SFF",
          "buildapc",
          "FractalEra2",
          "Ryzen7",
          "CorsairSF1000",
          "PCPartPicker"
        ]
      }
    },
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy GenAI solutions on Google Cloud, accelerating its digital transformation. The collaboration streamlined operations, boosted developer productivity, and unlocked entirely new revenue streams while compressing the company’s deployment timeline.",
        "bullets": [
          "TTEC worked with Google Cloud Consulting to rapidly prototype and deploy AI solutions.",
          "Leveraged GenAI and Google Cloud’s infrastructure to streamline operations.",
          "Efforts boosted developer productivity and shortened transformation timelines.",
          "Partnership unlocked entirely new revenue streams for TTEC.",
          "Google Cloud Consulting expanded what the company considered possible for the business."
        ],
        "takeaways": [
          "Plan for scalable cloud infrastructure to support emerging GenAI workloads and faster deployment cycles.",
          "Consider engaging cloud consulting partners to compress transformation timelines and accelerate proof-of-concept to production.",
          "Prioritize developer productivity tools and automation to speed AI solution delivery.",
          "Factor potential new revenue streams from AI initiatives into capacity, pricing, and investment planning."
        ],
        "tags": [
          "googlecloud",
          "ttec",
          "genai",
          "aideployment",
          "operationalefficiency",
          "customerexperience",
          "cloudconsulting",
          "digitaltransformation",
          "developerproductivity"
        ]
      }
    }
  ]
}