{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-30T11:01:08.770Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "gv6zK265OUE",
      "title": "Build your first GraphRAG Powered Agent! (No Graph Expert Required) | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-30T06:40:49.000Z",
      "url": "https://www.youtube.com/watch?v=gv6zK265OUE",
      "thumbnail": "https://i.ytimg.com/vi/gv6zK265OUE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this AWS Events video shows how to build a GraphRAG (knowledge-graph powered) agent in an afternoon using familiar AI tools, with a live demo using real documents. It stresses that knowledge graphs can unlock information trapped in docs, PDFs, and wikis and that this need not be a six-month project.",
        "bullets": [
          "Knowledge in docs, PDFs, and wikis is often trapped in text models can’t reason over.",
          "Knowledge graphs can unlock that trapped knowledge for AI reasoning.",
          "Building a knowledge graph is presented as achievable in an afternoon rather than a large project.",
          "Session includes a live demo using real documents and provides sample code."
        ],
        "takeaways": [
          "Enabling AI to reason over your organization’s docs, PDFs, and wikis can surface operational and technical knowledge more quickly.",
          "A rapid, afternoon-scale approach lowers project timeline risk compared with long, multi-month initiatives.",
          "Live demo plus sample code provide a practical, actionable starting point for pilot projects and proof-of-concept work.",
          "Using existing AI tools to build a knowledge graph can shorten the path from concept to deployable agent."
        ],
        "tags": [
          "GraphRAG",
          "knowledge-graph",
          "retrieval-augmented-generation",
          "RAG",
          "AI",
          "AWS",
          "Neptune",
          "sample-code",
          "live-demo",
          "databases-for-ai"
        ]
      }
    },
    {
      "id": "azzmtqcIeCU",
      "title": "Cloud Cost Efficiency I The Keys to AWS Optimization | S16 E2",
      "channel": "AWS Events",
      "published_at": "2026-01-30T05:12:30.000Z",
      "url": "https://www.youtube.com/watch?v=azzmtqcIeCU",
      "thumbnail": "https://i.ytimg.com/vi/azzmtqcIeCU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This livestream explores key KPIs for AWS cost efficiency—cost per transaction, resource utilization rates, and ROI calculations—and explains how to measure, track, and optimize cloud spending using metrics frameworks that align technical performance with business outcomes. It also covers benchmarking, identifying optimization opportunities, and building dashboards to communicate value to stakeholders.",
        "bullets": [
          "Focus on KPIs: cost per transaction, resource utilization, and ROI.",
          "Learn measurement and tracking techniques for AWS spending.",
          "Use metrics frameworks to align technical performance with business outcomes.",
          "Practical benchmarking to find cost optimization opportunities.",
          "Build dashboards to communicate value to stakeholders."
        ],
        "takeaways": [
          "Measure cost per transaction to directly link cloud spend to workload outputs and prioritize high-impact optimizations.",
          "Monitor resource utilization to identify and reclaim underused capacity, reducing ongoing operational costs.",
          "Use ROI calculations to justify investments in modernization or rightsizing efforts.",
          "Benchmark performance and costs to set targets and track improvement over time.",
          "Create stakeholder-facing dashboards to translate technical metrics into business value and speed decision-making."
        ],
        "tags": [
          "AWS",
          "CloudCosts",
          "FinOps",
          "CostOptimization",
          "CloudMetrics",
          "AWSCostManagement",
          "CloudEfficiency",
          "ResourceUtilization",
          "ROI"
        ]
      }
    },
    {
      "id": "oQtkaHzUYlY",
      "title": "Copilot helps Christa find her inner star 🌟",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-29T18:33:49.000Z",
      "url": "https://www.youtube.com/watch?v=oQtkaHzUYlY",
      "thumbnail": "https://i.ytimg.com/vi/oQtkaHzUYlY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the short video uses a star-filled sky metaphor to show how Copilot helps Christa \"find the star within.\" It serves as a brief, uplifting promo with a clear call-to-action to download and try Copilot via the link in the bio.",
        "bullets": [
          "Uses a sky/stars metaphor to convey personal empowerment.",
          "Centers on Christa discovering her \"inner star.\"",
          "Functions as a short promotional piece rather than a technical demo.",
          "Includes a direct call-to-action to download and try Copilot.",
          "No transcript is available for the video."
        ],
        "takeaways": [
          "Marketing emphasizes user empowerment and approachability—evaluate Copilot for staff-facing UX and adoption potential.",
          "The call-to-action to download suggests a trial-first adoption path; plan pilot testing to assess fit before enterprise rollout.",
          "Short, emotive promos signal focus on user engagement—include adoption and training metrics when assessing ROI."
        ],
        "tags": [
          "Copilot",
          "Microsoft",
          "AI assistant",
          "empowerment",
          "stars",
          "download",
          "trial",
          "promo",
          "video",
          "marketing"
        ]
      }
    },
    {
      "id": "2GZM7wOHFcg",
      "title": "Follow the carbon, find the money: Turning sustainability into financial value",
      "channel": "PwC US",
      "published_at": "2026-01-29T18:04:28.000Z",
      "url": "https://www.youtube.com/watch?v=2GZM7wOHFcg",
      "thumbnail": "https://i.ytimg.com/vi/2GZM7wOHFcg/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Rich Goode of PwC US argues that sustainability gains traction when carbon reduction is translated into financial terms. Framing emissions outcomes as cost savings and business value helps leaders move sustainability from ambition to actionable investment and alignment.",
        "bullets": [
          "Link carbon reduction to financial impact to engage business leaders.",
          "A ton of carbon is abstract; financial value is concrete for decision-makers.",
          "Translating emissions outcomes into cost savings drives action.",
          "Understand carbon accounting fundamentals to make credible business cases.",
          "Communicate sustainability in business terms to secure alignment and investment."
        ],
        "takeaways": [
          "Quantify emissions reductions in dollar terms to justify efficiency and decarbonization investments for grid/data center projects.",
          "Use carbon accounting fundamentals to support credible reporting and investment decisions.",
          "Frame sustainability initiatives as drivers of cost savings and business value to gain executive buy-in and funding.",
          "Communicate outcomes in familiar financial language to align stakeholders and accelerate implementation."
        ],
        "tags": [
          "sustainability",
          "carbon",
          "carbon accounting",
          "financial impact",
          "business case",
          "emissions",
          "leadership",
          "ESG",
          "PwC",
          "operational resilience"
        ]
      }
    },
    {
      "id": "BYtYm-xyKR8",
      "title": "Bringing In $251K A Year With 3 Jobs In The Bay Area",
      "channel": "CNBC Make It",
      "published_at": "2026-01-29T17:47:46.000Z",
      "url": "https://www.youtube.com/watch?v=BYtYm-xyKR8",
      "thumbnail": "https://i.ytimg.com/vi/BYtYm-xyKR8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Naseema McElroy is a 44-year-old labor and delivery nurse in Brentwood, California who also runs a personal finance brand. After accumulating nearly $1 million in debt in 2015, she started the Financially Intentional business to document her debt payoff and was debt-free by 2017; the video’s title notes she brings in $251K a year working three jobs in the Bay Area.",
        "bullets": [
          "Naseema McElroy, 44, is a labor and delivery nurse and founder of Financially Intentional in Brentwood, CA.",
          "In 2015 she accumulated nearly $1 million in debt and subsequently focused on improving money management.",
          "She started Financially Intentional to document her debt payoff journey.",
          "By 2017 she had become debt-free.",
          "Video title states she earns $251K per year across three jobs in the Bay Area."
        ],
        "takeaways": [
          "High-earning, multi-job professionals who build personal brands can increase local demand for reliable digital services and platform access.",
          "Healthcare workers with side businesses highlight a need for resilient home connectivity and power for remote work and content creation.",
          "Profiles of gig/multi-income earners in the Bay Area suggest continued pressure on regional digital infrastructure and potential demand for scalable, redundant data services."
        ],
        "tags": [
          "Naseema McElroy",
          "Financially Intentional",
          "debt payoff",
          "labor and delivery nurse",
          "Bay Area",
          "multiple jobs",
          "251K income",
          "personal finance",
          "CNBC Make It",
          "Millennial Money"
        ]
      }
    },
    {
      "id": "t6y2cVNjCAw",
      "title": "GeForce Garage - Summer of RTX Community Build",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-29T14:01:25.000Z",
      "url": "https://www.youtube.com/watch?v=t6y2cVNjCAw",
      "thumbnail": "https://i.ytimg.com/vi/t6y2cVNjCAw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… NVIDIA GeForce announced the winner of the Summer of RTX r/buildapc Community Build: u/JeffersonPutnam, who built a small-form-factor GeForce RTX 5090 system. The video description lists the full parts list and links (host Dwight, PCPartPicker system spec link) and highlights chassis, GPU, motherboard, CPU, RAM, power, and AIO choices.",
        "bullets": [
          "Winner: u/JeffersonPutnam’s SFF GeForce RTX 5090 build (Summer of RTX community contest).",
          "Chassis: Fractal Design Era 2; GPU: GeForce RTX 5090 Founders Edition.",
          "Motherboard: MSI MPG B850I Edge; CPU: Ryzen 7 9800X3D; RAM: 32GB DDR5-6000.",
          "Power: Corsair SF1000 (SFX 1000W); Cooling: Corsair Nautilus 240 RS AIO.",
          "Host: Dwight (GeForce) and PCPartPicker link to full winning system specs."
        ],
        "takeaways": [
          "Flagship consumer GPUs (GeForce RTX 5090) are being integrated into small-form-factor builds—consider space and compatibility constraints when evaluating deployment options.",
          "SFF systems with high-end GPUs in this build use a high-capacity compact PSU (Corsair SF1000), underscoring power delivery requirements for top-tier cards.",
          "A 240mm AIO (Corsair Nautilus 240 RS) was chosen for cooling, highlighting thermal management needs when pairing powerful GPUs and CPUs in confined chassis.",
          "The configuration pairs a high-end GPU with a CPU featuring 3D V-Cache (Ryzen 7 9800X3D), indicating attention to balanced CPU–GPU system design for mixed workloads.",
          "Community-driven builds and published part lists (PCPartPicker) can serve as practical references for component compatibility and integration choices."
        ],
        "tags": [
          "GeForceGarage",
          "SummerOfRTX",
          "RTX5090",
          "SFF",
          "PCBuild",
          "NVIDIA",
          "FractalEra2",
          "CorsairSF1000",
          "Ryzen7",
          "PCPartPicker"
        ]
      }
    },
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy GenAI solutions on Google Cloud, streamlining operations and boosting developer productivity. The engagement compressed TTEC's digital transformation timeline and unlocked entirely new revenue streams.",
        "bullets": [
          "TTEC worked with Google Cloud Consulting to quickly prototype and deploy AI solutions.",
          "GenAI and Google Cloud infrastructure were used to streamline operations.",
          "Developer productivity improved as a result of the deployment.",
          "The project compressed TTEC's digital transformation timeline.",
          "New revenue streams were unlocked through the AI-enabled initiatives."
        ],
        "takeaways": [
          "Ensure cloud infrastructure can support GenAI workloads to enable rapid prototyping and commercialization.",
          "Faster AI deployment can shorten transformation timelines and accelerate time-to-revenue.",
          "Improving developer productivity through cloud tools translates to quicker feature delivery and operational gains.",
          "Engaging cloud consulting expertise can help compress timelines and expand what’s possible for the business."
        ],
        "tags": [
          "googlecloud",
          "ttec",
          "genai",
          "aideployment",
          "consulting",
          "customerexperience",
          "cloudinfrastructure",
          "developerproductivity",
          "digitaltransformation"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video shows Jo discovering how Copilot Groups can make route planning easier. It is published on the Microsoft Copilot channel and includes the tags #copilot, #microsoftcopilot, and #ai.",
        "bullets": [
          "Highlights route planning made easy.",
          "Features Jo exploring Copilot Groups.",
          "Published by Microsoft Copilot.",
          "Description includes hashtags: #copilot #microsoftcopilot #ai.",
          "No transcript available."
        ],
        "takeaways": [
          "If route planning is part of your operations, this video presents Copilot Groups as an example worth reviewing.",
          "Use the clip as a starting point to assess whether AI-driven group coordination could match your field routing needs.",
          "Consider a deeper evaluation or demo to determine applicability for crew dispatch and logistics workflows."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "Copilot Groups",
          "route-planning",
          "logistics",
          "Jo"
        ]
      }
    }
  ]
}