{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-23T14:50:32.052Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI w audycie to już codzienność — w podcaście Katarzyna Chojniak i Alicja Barska omawiają praktyczne zastosowania narzędzi AI w procesie badania, takie jak analiza pełnych populacji transakcji, konwersacyjni asystenci Clara AI oraz platforma KPMG Clara do zarządzania badaniem w czasie rzeczywistym. Rozmowa porusza też korzyści dla klientów, zmiany w roli i kompetencjach audytorów oraz wyzwania związane z bezpieczeństwem danych i regulacjami.",
        "bullets": [
          "AI Transaction Scoring Tool — analiza pełnych populacji zamiast próbkowania",
          "Clara AI — konwersacyjny asystent i wyspecjalizowani agenci wspomagający audyt",
          "Wsparcie AI w dokumentacji i analizie ujawnień",
          "Platforma KPMG Clara — zarządzanie badaniem i komunikacja z klientem w czasie rzeczywistym",
          "Omówione wyzwania: adaptacja audytorów, bezpieczeństwo danych i środowisko regulacyjne"
        ],
        "takeaways": [
          "Wzrost zapotrzebowania na moc obliczeniową i magazyn danych — pełne analizy populacji wymagają skalowalnej infrastruktury",
          "Konieczność silnych mechanizmów bezpieczeństwa i zgodności — dane finansowe muszą być chronione i zgodne z regulacjami",
          "Wsparcie dla narzędzi real-time wymaga niskich opóźnień i integracji systemów — warto ocenić API i łączność z platformami audytowymi",
          "Inwestycja w kompetencje zespołu — obsługa narzędzi AI oraz interpretacja wyników stają się kluczowe",
          "Możliwość poprawy komunikacji z klientami i automatyzacji procesów — potencjalne oszczędności czasu i lepsza jakość raportowania"
        ],
        "tags": [
          "AI",
          "audyt",
          "KPMG",
          "Clara",
          "analiza-danych",
          "bezpieczeństwo-danych",
          "innowacje",
          "transformacja-cyfrowa",
          "zarządzanie-badaniem",
          "próbkowanie"
        ]
      }
    },
    {
      "id": "6hu7hYLiu08",
      "title": "Get Step-By-Step Fixes with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-21T20:14:00.000Z",
      "url": "https://www.youtube.com/watch?v=6hu7hYLiu08",
      "thumbnail": "https://i.ytimg.com/vi/6hu7hYLiu08/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Copilot provides real-time visual support for home projects and repairs. It can see what you see and deliver step-by-step instructions for issues like leaky pipes or overflowing washing machines, offering clear, actionable guidance.",
        "bullets": [
          "Real-time visual assistance for home repair tasks",
          "Delivers step-by-step instructions based on what Copilot sees",
          "Examples include fixing leaky pipes and addressing overflowing washing machines",
          "Focused on clear, actionable guidance for on-the-spot troubleshooting",
          "Aims to support users through home projects and repairs"
        ],
        "takeaways": [
          "Real-time, visual troubleshooting could help on-site technicians diagnose issues faster",
          "Step-by-step guidance may reduce reliance on remote specialists for routine fixes",
          "Clear, actionable instructions can help standardize maintenance processes and reduce errors",
          "Capability to ‘see what you see’ could be leveraged for documenting repair workflows and training"
        ],
        "tags": [
          "Copilot",
          "Microsoft",
          "real-time support",
          "visual assistance",
          "home repairs",
          "troubleshooting",
          "step-by-step",
          "plumbing",
          "appliance repair",
          "guidance"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, NVIDIA GeForce posted the 4K launch trailer for Arknights: Endfield highlighting NVIDIA DLSS 4 with Multi Frame Generation. The trailer shows the 3D real-time strategy RPG captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 Multi Frame Generation 4X Mode and includes links to the game and GeForce social channels.",
        "bullets": [
          "Arknights: Endfield launch trailer emphasizes NVIDIA DLSS 4 with Multi Frame Generation.",
          "Game is a 3D real-time strategy RPG where you play the Endministrator across Talos-II.",
          "Footage captured on GeForce RTX 5080 at 4K Ultra Settings using DLSS4 MFG 4X Mode.",
          "Description links to the official game site and multiple Arknights/GeForce social channels.",
          "Includes hashtags: #ArknightsEndfield, #RTXOn, #DLSS4."
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is being used for 4K real-time rendering—relevant when evaluating GPU capabilities for high‑resolution streaming or virtualized graphics workloads.",
          "Footage captured on an RTX 5080 signals use of current high‑end GPU hardware for DLSS4-enabled titles; consider RTX 50‑series compatibility when planning hardware refreshes.",
          "Adoption of DLSS4 in a launch title implies ongoing developer support for advanced AI upscaling—monitor SDK/driver support for deployment in cloud or data‑center gaming services."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "RTX5080",
          "4K",
          "NVIDIA",
          "GeForce",
          "Gaming",
          "Trailer",
          "RealTimeStrategy"
        ]
      }
    },
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This video shows how Rate Insurance boosts agent efficiency using Agentforce and Gemini. It also points viewers to learn more about the Google Cloud and Salesforce partnership via the provided link.",
        "bullets": [
          "Shows Rate Insurance boosting agent efficiency.",
          "Highlights the use of Agentforce and Gemini.",
          "Includes a link to the Google Cloud and Salesforce partnership.",
          "Invites viewers to watch how these tools are applied in practice."
        ],
        "takeaways": [
          "The video highlights agent efficiency as a goal—watch to see concrete examples that may inform operational priorities.",
          "A provided link to the Google Cloud and Salesforce partnership is a starting point for evaluating vendor integration and collaboration.",
          "Identify whether Agentforce and Gemini are relevant to your environment by reviewing the demo and linked partnership details."
        ],
        "tags": [
          "Rate Insurance",
          "Agentforce",
          "Gemini",
          "Google Cloud",
          "Salesforce",
          "agent efficiency",
          "partnership",
          "insurance"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Charly Stoever, 35, is a financial coach who lives rent-free in Portland, Oregon by pet sitting full time. Over the past 18 months she has lived out of two suitcases and earned about $60,000 a year; the video is part of CNBC Make It's Millennial Money series.",
        "bullets": [
          "Charly Stoever, 35, works full-time as a pet sitter and is a financial coach.",
          "She lives rent-free in Portland, Oregon by pet sitting.",
          "She has lived out of two suitcases for the last 18 months.",
          "Her reported annual income from this lifestyle is $60,000.",
          "This profile is part of CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "Nontraditional, mobile lifestyles (e.g., full-time pet sitting) can alter residential occupancy patterns; grid planners should monitor such trends for potential impacts on local energy demand.",
          "Gig-based income that enables rent-free or transient living may lead to more variable and distributed residential electricity use—consider incorporating lifestyle-driven variability into demand forecasting.",
          "Profiles emphasizing mobility and minimal possessions suggest a need for flexible, localized load management and short-term demand-response strategies in neighborhoods attracting transient residents."
        ],
        "tags": [
          "pet sitting",
          "rent-free",
          "Portland",
          "financial coach",
          "nomad",
          "60k",
          "two suitcases",
          "CNBC Make It",
          "Millennial Money",
          "lifestyle"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights a giant bubble of carbon dioxide that can store 20 megawatts of energy. It presents this CO2-based battery as a tool to address renewable energy variability and to help drive a global shift to cleaner energy.",
        "bullets": [
          "Giant bubble of carbon dioxide used as an energy storage medium.",
          "Reported storage capacity: 20 megawatts.",
          "Addresses fluctuations in renewable energy supply.",
          "Presented as a battery technology to support the transition to clean energy globally.",
          "Content framed by IEEE Spectrum with tags emphasizing tech and innovation."
        ],
        "takeaways": [
          "A 20 MW storage unit targets large-scale power needs—relevant for grid operators and large facilities evaluating bulk storage options.",
          "Designed to mitigate renewable intermittency, so it could play a role in smoothing supply from wind and solar assets.",
          "Frames CO2-based storage as a decarbonization-aligned option to consider alongside other storage technologies.",
          "Decision-makers should assess how a 20 MW CO2 battery would integrate with existing grid or data-center energy management strategies."
        ],
        "tags": [
          "ieee",
          "tech",
          "innovation",
          "energy",
          "battery",
          "carbon-dioxide",
          "CO2",
          "storage",
          "renewables",
          "clean-energy"
        ]
      }
    }
  ]
}