{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-19T04:38:13.517Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "6L86-OnOXV0",
      "title": "How I Built A $1M/Year Business - And Helped My Parents Retire",
      "channel": "CNBC Make It",
      "published_at": "2026-01-17T15:00:09.000Z",
      "url": "https://www.youtube.com/watch?v=6L86-OnOXV0",
      "thumbnail": "https://i.ytimg.com/vi/6L86-OnOXV0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Tuan Le vowed at 15 to help his parents retire after his family emigrated from Vietnam to Toronto in 2015. Ten years later his social video production company, ShortsCut, brings in over $1 million USD a year in sales, and he now pays his parents' rent and living expenses so they no longer have to work full time.",
        "bullets": [
          "Tuan Le emigrated from Vietnam to Toronto in 2015 and made a personal promise at age 15 to help his parents retire.",
          "He founded ShortsCut, a social video production company.",
          "ShortsCut generates over $1 million USD in annual sales.",
          "Le now covers his parents' rent and living expenses, enabling them to stop working full time.",
          "Video produced by CNBC Make It with staff credits listed in the description."
        ],
        "takeaways": [
          "A social video production business can scale to >$1M/year within a decade, indicating sustained digital-media demand that affects infrastructure needs.",
          "Owners of high-growth video businesses will likely require reliable storage, bandwidth and delivery (CDN) solutions to support content production and distribution.",
          "Long-term growth stories from small production shops suggest predictable, ongoing workload for hosting and archival services rather than one-off spikes.",
          "Immigrant-founded creative companies can be significant customers — consider outreach and products tailored to fast-growing independent studios."
        ],
        "tags": [
          "Tuan Le",
          "ShortsCut",
          "social video production",
          "entrepreneurship",
          "immigrant entrepreneur",
          "CNBC Make It",
          "Toronto",
          "1M revenue",
          "family support"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This giant carbon dioxide bubble battery can store 20 megawatts of energy and provides about 8 hours of storage. It’s presented as a solution to manage fluctuating renewable generation and to help accelerate the global shift to clean energy.",
        "bullets": [
          "Giant bubble of carbon dioxide used as an energy storage system.",
          "Stores 20 megawatts of power.",
          "Provides roughly 8 hours of energy storage.",
          "Aims to address intermittency of renewable energy sources.",
          "Positioned as a tool to support the global transition to clean energy."
        ],
        "takeaways": [
          "Provides multi-hour (≈8 hr) storage at a 20 MW scale—useful for peak shifting and extended backup planning.",
          "Can help smooth variable renewable output, aiding grid integration of wind and solar.",
          "Relevant for resilience planning where sustained backup power is needed.",
          "Fits into long-term decarbonization and storage-capacity planning discussions."
        ],
        "tags": [
          "CO2",
          "carbon-dioxide",
          "battery",
          "energy-storage",
          "renewables",
          "grid",
          "clean-energy",
          "innovation",
          "IEEE",
          "tech"
        ]
      }
    },
    {
      "id": "OINppmPan0o",
      "title": "Figure Skating | Making Team USA presented by Xfinity with Apolo Ohno",
      "channel": "Team USA",
      "published_at": "2026-01-16T19:30:36.000Z",
      "url": "https://www.youtube.com/watch?v=OINppmPan0o",
      "thumbnail": "https://i.ytimg.com/vi/OINppmPan0o/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Figure skating duo Vadym Kolesnik and Emilia Zingas sit down with Apolo Ohno on an episode of Making Team USA presented by Xfinity ahead of the Winter Olympics. The short preview emphasizes the pair’s partnership as \"built on trust.\"",
        "bullets": [
          "Guests: Vadym Kolesnik and Emilia Zingas.",
          "Host/interviewer: Apolo Ohno.",
          "Program: Making Team USA, presented by Xfinity.",
          "Context: released ahead of the Winter Olympics.",
          "Theme highlighted: \"Built on trust.\""
        ],
        "takeaways": [
          "Branded Olympic content (Team USA + Xfinity) highlights the importance of reliable streaming and delivery during peak event windows—plan capacity and CDN readiness accordingly.",
          "Sponsor-presented episodes place extra emphasis on quality and uptime to protect brand relationships—prioritize monitoring and SLAs for sponsored media.",
          "Short-form athlete interviews increase demand for fast on-demand access and metadata management—ensure storage, indexing, and low-latency delivery pipelines are in place.",
          "Coordination with rights holders and event timelines suggests the need for secure content workflows and clear content-management practices ahead of major event releases."
        ],
        "tags": [
          "figure skating",
          "Vadym Kolesnik",
          "Emilia Zingas",
          "Apolo Ohno",
          "Making Team USA",
          "Xfinity",
          "Winter Olympics",
          "Team USA",
          "athlete interview",
          "trust"
        ]
      }
    },
    {
      "id": "RalzsofAYHM",
      "title": "29-year-old spent $20,000 to open a store in New York — now it brings in $1.6 million a year",
      "channel": "CNBC Make It",
      "published_at": "2026-01-16T17:00:48.000Z",
      "url": "https://www.youtube.com/watch?v=RalzsofAYHM",
      "thumbnail": "https://i.ytimg.com/vi/RalzsofAYHM/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Abby Price started Abbode as a Parsons graduate student, selling dried floral arrangements to New York locals on Facebook beginning in 2019. By March 2022 she had a Nolita storefront selling bouquets and home decor and generated enough cashflow to buy a $15,000 embroidery machine—an item she later said was bought “on a total whim”—while the shop’s secret sat covered in dust in the basement for a year.",
        "bullets": [
          "Founded by Abby Price while she was a graduate student at Parsons School of Design.",
          "Began selling dried floral arrangements to New York locals via Facebook in 2019.",
          "By March 2022 operated a rented storefront in Nolita selling bouquets and home decor.",
          "Cashflow from the storefront funded a $15,000 embroidery machine purchase.",
          "The shop’s 'secret' remained stored in the basement, covered in dust, for a year."
        ],
        "takeaways": [
          "Growth from online sales to a physical storefront can lead small retailers to acquire capital equipment—plan for potential localized increases in electrical or infrastructure demand.",
          "Cashflow-driven equipment purchases by small businesses suggest demand for on-site power and connectivity may rise even without external financing.",
          "Capital equipment may be purchased but not immediately deployed; expect variable and lagged usage patterns when forecasting load or capacity needs."
        ],
        "tags": [
          "Abby Price",
          "Abbode",
          "Parsons School of Design",
          "dried florals",
          "Facebook sales",
          "Nolita",
          "storefront",
          "embroidery machine",
          "small business",
          "capital equipment"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI już teraz wpływa na obszar cen transferowych — od monitorowania rentowności i porównań benchmarkingowych po automatyzację dokumentacji. W podcaście eksperci KPMG podkreślają, że AI nie zastąpi doradców, lecz wzmocni ich pracę, jednocześnie zwracając uwagę na ryzyka związane z danymi, bezpieczeństwem i RODO oraz na potrzebę integracji z ERP i uporządkowania procesów przed wdrożeniem.",
        "bullets": [
          "Zastosowania AI: monitorowanie rentowności, analizy porównawcze (benchmarki) i automatyzacja dokumentacji cen transferowych.",
          "Rola doradców: AI ma wspierać, a nie zastępować ekspertów podatkowych.",
          "Ryzyka: kwestie danych, bezpieczeństwa, RODO oraz problem halucynacji AI.",
          "Bezpieczne środowisko: omówiono Digital Gateway jako rozwiązanie do pracy z AI.",
          "Wdrożenie: integracja z ERP i uporządkowanie procesów jako pierwsze kroki; przedstawiono filary implementacji."
        ],
        "takeaways": [
          "Zadbaj o silne zarządzanie danymi i bezpieczeństwo — to kluczowy warunek użycia AI w procesach podatkowych.",
          "Zapewnienie integracji AI z ERP zwiększy użyteczność narzędzi analitycznych i benchmarków.",
          "Stworzenie bezpiecznego środowiska (np. podobnego do Digital Gateway) ogranicza ryzyka przy pracy z wrażliwymi danymi.",
          "Przed wdrożeniem AI uporządkuj procesy i dane — to podstawa skutecznej transformacji.",
          "Automatyzacja dokumentacji i monitoringu może zwiększyć zapotrzebowanie na niezawodne, skalowalne zasoby IT."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "podatki",
          "transfer pricing",
          "automatyzacja",
          "ERP",
          "bezpieczeństwo danych",
          "RODO",
          "Digital Gateway",
          "benchmarki"
        ]
      }
    },
    {
      "id": "dGfcT63U7Mo",
      "title": "The 2026 U.S. Olympic Figure Skating Team 🇺🇸",
      "channel": "Team USA",
      "published_at": "2026-01-15T20:43:24.000Z",
      "url": "https://www.youtube.com/watch?v=dGfcT63U7Mo",
      "thumbnail": "https://i.ytimg.com/vi/dGfcT63U7Mo/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… this short Team USA video presents the U.S. Olympic Figure Skating lineup for the 2026 Winter Olympics. The description is brief and includes the hashtag #WinterOlympics; no transcript is available.",
        "bullets": [
          "Presents the U.S. Olympic Figure Skating lineup.",
          "Published by Team USA on 2026-01-15T20:43:24.000Z.",
          "Description text: \"This U.S. Olympic Figure Skating lineup. 🔥\" with #WinterOlympics.",
          "No transcript is available for the video."
        ],
        "takeaways": [
          "Flag as Olympic-related content (Team USA, #WinterOlympics) for CDN/caching prioritization during event periods.",
          "Capture and store provided metadata (channel, publish date, hashtags) to support search, recommendations, and analytics.",
          "No transcript available — consider adding automated captioning/transcription to improve accessibility and metadata enrichment.",
          "Treat as short promotional/high-interest sports content when planning retention and delivery SLAs around the Winter Olympics timeframe."
        ],
        "tags": [
          "Team USA",
          "Figure Skating",
          "U.S. Olympic Team",
          "2026",
          "WinterOlympics",
          "Olympics",
          "Lineup",
          "Sports"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video encourages viewers to maintain momentum in workouts, projects, and personal goals by using Microsoft Copilot. It presents Copilot as a companion for sustaining progress across different kinds of tasks.",
        "bullets": [
          "Focus: keeping momentum across activities.",
          "Applies to workouts, projects, and personal goals.",
          "Positions Copilot as a supportive tool for ongoing progress.",
          "Short, motivational message rather than a feature deep-dive.",
          "Aimed at helping users stay consistent and productive."
        ],
        "takeaways": [
          "So what: For grid/data center decision-makers, Copilot’s emphasis on sustaining momentum suggests it can support ongoing projects and operational initiatives.",
          "So what: Use of Copilot may help teams maintain consistent progress on long-term infrastructure or modernization efforts.",
          "So what: Encouraging staff to leverage Copilot could aid in keeping routine tasks and follow-ups moving forward.",
          "So what: Framing Copilot as a productivity companion may help adoption for project continuity and goal attainment."
        ],
        "tags": [
          "Microsoft Copilot",
          "productivity",
          "momentum",
          "workouts",
          "projects",
          "personal goals",
          "AI assistant",
          "motivation",
          "task management",
          "workflow"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video highlights how precision and speed are critical in high-frequency trading and features the Dell PowerEdge R770AP server powered by Intel® Xeon® 6 processors. It states the server helps maximize gains and minimize losses by performing hundreds of trades in seconds and positions Intel Xeon 6 CPUs as defining the future of finance.",
        "bullets": [
          "Focus on high-frequency trading where every second matters.",
          "Showcases Dell PowerEdge R770AP server with Intel® Xeon® 6 processors.",
          "Claims improved precision and speed to perform hundreds of trades in seconds.",
          "Aims to help maximize gains and minimize losses in trading.",
          "Video is from Intel Business and includes links and subscription info."
        ],
        "takeaways": [
          "Prioritize low-latency, high-performance servers for HFT workloads.",
          "Consider Dell PowerEdge R770AP with Intel Xeon 6 CPUs when evaluating trading infrastructure.",
          "Investing in faster compute can directly impact trade execution and financial risk.",
          "Use Intel Business resources for additional IT guidance and vendor information."
        ],
        "tags": [
          "high-frequency trading",
          "HFT",
          "Dell PowerEdge R770AP",
          "Intel Xeon 6",
          "low-latency",
          "finance tech",
          "data center",
          "trading servers",
          "Intel Business"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video presents Copilot as something that 'brought [the] creative spark' back and invites viewers to download and try it via the link in bio. No transcript is available, and the description is a brief promotional call to action.",
        "bullets": [
          "Description states Copilot 'brought [the] creative spark' back to life.",
          "Direct call to action: download Copilot and try it via link in bio.",
          "No transcript provided for more detail.",
          "Promotional, not technical — focused on inspiration and trial."
        ],
        "takeaways": [
          "Copilot is framed as a creativity-restoring tool — consider evaluating it for ideation or creative workflows.",
          "The primary action offered is a hands-on trial (download via link in bio) to judge fit.",
          "Description contains no technical or performance details — obtain documentation before procurement decisions.",
          "Treat this as a promotional prompt to test functionality rather than as a source of implementation guidance."
        ],
        "tags": [
          "Copilot",
          "Microsoft",
          "creativity",
          "AI",
          "download",
          "call-to-action",
          "productivity",
          "demo",
          "link-in-bio"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights the open-world martial arts RPG Where Winds Meet while showcasing DLSS 4 with Multi Frame Generation and #RTXOn. The clip credits creator @DigitalDreamsyt and invites viewers to experience the game with NVIDIA GeForce enhancements.",
        "bullets": [
          "Open-world martial arts RPG: Where Winds Meet",
          "Demonstrates DLSS 4 with Multi Frame Generation",
          "Promotes RTX On visual features",
          "Produced/shared by @DigitalDreamsyt",
          "Published on NVIDIA GeForce channel"
        ],
        "takeaways": [
          "The video emphasizes DLSS 4 with Multi Frame Generation — a specific NVIDIA graphics feature to account for in hardware/software support assessments.",
          "RTX On is showcased, indicating the content leverages NVIDIA ray-tracing and related GPU capabilities.",
          "Content may be relevant when evaluating GPU compatibility and driver support for modern gaming/graphics workloads."
        ],
        "tags": [
          "WhereWindsMeet",
          "DLSS4",
          "MultiFrameGeneration",
          "RTXOn",
          "open-world",
          "martial-arts-RPG",
          "NVIDIAGeForce",
          "DigitalDreamsyt",
          "gaming",
          "graphics"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this Intel Business video is titled \"Taha Khalifa (Intel) | Intel Business\" and appears on Intel's channel focused on IT topics. The channel offers resources, guidance, and expert insights spanning data centers to devices, and directs viewers to subscribe and connect via the Intel Business website and social channels.",
        "bullets": [
          "Video title: Taha Khalifa (Intel) | Intel Business.",
          "Intel Business channel provides IT information covering data centers to devices.",
          "Offers resources, guidance, and expert insights to support IT projects.",
          "Includes subscription link and channel URL.",
          "Provides website and social links (X, LinkedIn, Facebook) for further connection."
        ],
        "takeaways": [
          "Intel Business is positioned as a centralized resource for data center and device-related IT guidance.",
          "Decision-makers can leverage the channel's expert insights to inform and accelerate IT project planning.",
          "Use the Intel Business website and social channels to access additional resources and stay updated.",
          "Subscribe to the channel to receive ongoing content relevant to IT and data center management."
        ],
        "tags": [
          "Intel Business",
          "Taha Khalifa",
          "Intel",
          "IT resources",
          "data center",
          "devices",
          "IT projects",
          "expert insights",
          "subscribe",
          "technology"
        ]
      }
    },
    {
      "id": "kSocjh8PZnQ",
      "title": "Rynek dóbr luksusowych w obliczu transformacji | Andrzej Marczak, Tomasz Wiśniewski",
      "channel": "KPMG Poland",
      "published_at": "2026-01-13T10:23:31.000Z",
      "url": "https://www.youtube.com/watch?v=kSocjh8PZnQ",
      "thumbnail": "https://i.ytimg.com/vi/kSocjh8PZnQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This KPMG ON AIR episode reviews trends reshaping the luxury goods market, including a shift from ownership to experiences, rising importance of ESG, the emergence of \"affordable luxury,\" and personalization. The discussion also covers Poland's growing but fragmented luxury market, luxury tourism and hotels, the art market, generational preferences (Gen Z), and the future role of AI and craftsmanship.",
        "bullets": [
          "Global trends: \"luxury fatigue\" and concentration of spending (top 2% account for ~40% of the market).",
          "Experience-led luxury and personalization are rising priorities for consumers.",
          "ESG and responsible luxury—eco-leathers, certifications and sustainability—are increasingly important.",
          "Poland: market is growing domestically but remains fragmented; rising interest in luxury tourism, hotels and art.",
          "Future directions include AI, renewed focus on craftsmanship, and engagement with younger consumers (Gen Z)."
        ],
        "takeaways": [
          "Expect higher demand for secure, scalable compute and data services to support personalization and AI-driven luxury experiences.",
          "Plan for sustainability requirements and potential certifications—energy efficiency and renewable sourcing may be strategic priorities.",
          "Ensure resilient connectivity and capacity to support luxury hotels, tourism peaks and digital services tied to premium experiences.",
          "Consider flexible scaling strategies for a growing but fragmented Polish luxury market and evolving demand patterns driven by younger consumers."
        ],
        "tags": [
          "luxury",
          "ESG",
          "AI",
          "personalization",
          "Poland",
          "luxury-travel",
          "affordable-luxury",
          "GenZ",
          "art-market",
          "KPMG"
        ]
      }
    }
  ]
}