{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-30T17:59:39.587Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "z-X9MYi1Rr0",
      "title": "Leveraging tax credits and incentives for sustainability projects",
      "channel": "PwC US",
      "published_at": "2026-01-30T13:27:25.000Z",
      "url": "https://www.youtube.com/watch?v=z-X9MYi1Rr0",
      "thumbnail": "https://i.ytimg.com/vi/z-X9MYi1Rr0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Randa Barsoum of PwC US highlights tax credits and incentives for sustainability beyond the usual energy-focused programs — including state and local abatements, location-based incentives, and R&D tax credits tied to innovation like reimagining packaging or processes. The key message: viewing sustainability investments through a broader tax lens can unlock meaningful tax value for businesses.",
        "bullets": [
          "Energy incentives are only part of the tax picture for sustainability.",
          "State and local abatements can provide additional tax relief.",
          "Location-based incentives may influence site and investment decisions.",
          "R&D tax credits can apply to innovation efforts tied to sustainability.",
          "Broad tax thinking can increase the value of sustainability investments."
        ],
        "takeaways": [
          "Don’t assume energy credits are the only tax benefit—identify state/local abatements and location-based incentives when planning sites or upgrades.",
          "Include potential R&D tax credits in the financial case for sustainability-driven innovation and process changes.",
          "Adopt a broader tax perspective on sustainability investments to maximize tax value and improve project economics."
        ],
        "tags": [
          "sustainability",
          "tax-credits",
          "incentives",
          "state-local-abatements",
          "location-based-incentives",
          "R&D-tax-credits",
          "PwC",
          "corporate-tax",
          "ESG"
        ]
      }
    },
    {
      "id": "PxnMl4M2pww",
      "title": "Why data is critical to sustainable supply chains",
      "channel": "PwC US",
      "published_at": "2026-01-30T13:24:27.000Z",
      "url": "https://www.youtube.com/watch?v=PxnMl4M2pww",
      "thumbnail": "https://i.ytimg.com/vi/PxnMl4M2pww/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, David Linich, Sustainability Principal at PwC US, explains that reliable, high-quality data enables organizations to scenario plan, protect margins, and deliver sustainable, high-quality products at the right place and time. With conditions changing week by week, he emphasizes that data-driven decision-making is critical to building resilient, modern supply chains.",
        "bullets": [
          "Reliable, high-quality data underpins scenario planning.",
          "Data helps organizations protect margins amid disruption.",
          "Enables delivery of sustainable, high-quality products to the right place and time.",
          "Rapidly changing conditions (week by week) increase the need for timely data.",
          "Data-driven decision-making is essential for resilient, modern supply chains."
        ],
        "takeaways": [
          "Use high-quality supply chain data to scenario plan equipment sourcing and deployment timelines.",
          "Leverage data to anticipate tariff shifts and other disruptions to protect project margins.",
          "Ensure data informs procurement to secure sustainable, high-quality components on schedule and maintain uptime.",
          "Build data-driven processes to increase operational resilience as market conditions change rapidly."
        ],
        "tags": [
          "data",
          "supply chain",
          "sustainability",
          "scenario planning",
          "resilience",
          "margins",
          "PwC",
          "operational resilience",
          "ESG"
        ]
      }
    },
    {
      "id": "gv6zK265OUE",
      "title": "Build your first GraphRAG Powered Agent! (No Graph Expert Required) | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-30T06:40:49.000Z",
      "url": "https://www.youtube.com/watch?v=gv6zK265OUE",
      "thumbnail": "https://i.ytimg.com/vi/gv6zK265OUE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this AWS Events session demonstrates how to build a GraphRAG-powered agent that uses knowledge graphs to make information in documents, PDFs, and wikis accessible to AI. The talk includes a live demo on real documents and provides sample code, emphasizing you can build this in an afternoon rather than a six-month project.",
        "bullets": [
          "Knowledge in docs, PDFs, and wikis is often inaccessible to models.",
          "Knowledge graphs are presented as a way to unlock that trapped information.",
          "Building a knowledge graph is framed as achievable in an afternoon, not a massive project.",
          "Session includes a live demo using real documents.",
          "Sample notebook/code is provided for hands-on follow-up."
        ],
        "takeaways": [
          "You can make institutional documentation searchable and usable by AI via knowledge graphs.",
          "Implementation is presented as fast—feasible in an afternoon—so long multi-month projects may not be required.",
          "Approach leverages AI tools teams already use, reducing the need for new infrastructure or expertise.",
          "Live demo and sample code enable practical, hands-on adoption steps for teams evaluating this tech."
        ],
        "tags": [
          "graph-rag",
          "knowledge-graph",
          "ai-agents",
          "databases-for-ai",
          "aws-events",
          "live-demo",
          "sample-code",
          "document-knowledge"
        ]
      }
    },
    {
      "id": "oQtkaHzUYlY",
      "title": "Copilot helps Christa find her inner star 🌟",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-29T18:33:49.000Z",
      "url": "https://www.youtube.com/watch?v=oQtkaHzUYlY",
      "thumbnail": "https://i.ytimg.com/vi/oQtkaHzUYlY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights Copilot helping Christa \"find the star within.\" It invites viewers to download and try Copilot via the link in the channel bio.",
        "bullets": [
          "No transcript available; summary based solely on description.",
          "Central idea: Copilot helps Christa discover her inner \"star.\"",
          "Call-to-action: Download and try Copilot (link in bio).",
          "Published by Microsoft Copilot on 2026-01-29.",
          "Short, promotional consumer-facing piece."
        ],
        "takeaways": [
          "Public-facing promotion and trial availability could generate internal interest—expect inquiries from staff wanting to try Copilot.",
          "Be ready to assess support and onboarding needs if employees pursue the publicly available trial.",
          "Coordinate with procurement and compliance teams to respond to potential adoption requests prompted by the campaign."
        ],
        "tags": [
          "Copilot",
          "Microsoft",
          "Christa",
          "inner-star",
          "AI",
          "download",
          "promo",
          "video"
        ]
      }
    },
    {
      "id": "BYtYm-xyKR8",
      "title": "Bringing In $251K A Year With 3 Jobs In The Bay Area",
      "channel": "CNBC Make It",
      "published_at": "2026-01-29T17:47:46.000Z",
      "url": "https://www.youtube.com/watch?v=BYtYm-xyKR8",
      "thumbnail": "https://i.ytimg.com/vi/BYtYm-xyKR8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Naseema McElroy, 44, is a labor and delivery nurse in Brentwood, California who started a personal finance brand after carrying nearly $1 million in debt in 2015 and becoming debt-free by 2017. She documents that journey through her business Financially Intentional and now brings in $251K a year working three jobs in the Bay Area.",
        "bullets": [
          "Naseema McElroy is a 44-year-old labor and delivery nurse based in Brentwood, CA.",
          "She accumulated nearly $1 million in debt in 2015 and paid it off by 2017.",
          "Founded Financially Intentional to document her debt-payoff journey.",
          "Now earns $251K annually across three jobs in the Bay Area.",
          "Profiled in CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "An employee can hold multiple income streams while maintaining a demanding primary role (nurse with three jobs earning $251K).",
          "Large personal debt burdens (nearly $1M) can exist even among skilled professionals—financial-wellness support could be relevant to workforce stability.",
          "Employees may monetize personal expertise or experiences via side businesses (Financially Intentional), so consider clear policies for external business activities and brand representation.",
          "High-profile coverage (CNBC feature) can raise visibility for staff-led side ventures—be aware of reputational and PR implications."
        ],
        "tags": [
          "Naseema McElroy",
          "Financially Intentional",
          "debt payoff",
          "personal finance",
          "multiple jobs",
          "Bay Area",
          "labor and delivery nurse",
          "CNBC Make It",
          "Millennial Money"
        ]
      }
    },
    {
      "id": "t6y2cVNjCAw",
      "title": "GeForce Garage - Summer of RTX Community Build",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-29T14:01:25.000Z",
      "url": "https://www.youtube.com/watch?v=t6y2cVNjCAw",
      "thumbnail": "https://i.ytimg.com/vi/t6y2cVNjCAw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this GeForce Garage video presents the winning entry of the Summer of RTX r/buildapc Community Build Contest by u/JeffersonPutnam — a small‑form‑factor GeForce RTX 5090 system. Host Dwight walks through the SFF build and the description lists full system specs and links to the PCPartPicker build and GeForce social channels.",
        "bullets": [
          "Winner: u/JeffersonPutnam — SFF GeForce RTX 5090 rig.",
          "Key components: Fractal Design Era 2 chassis, GeForce RTX 5090 Founders Edition, MSI MPG B850I Edge motherboard, Ryzen 7 9800X3D, 32GB Teamgroup DDR5‑6000, Corsair SF1000 PSU, Corsair Nautilus 240 RS AIO.",
          "PCPartPicker link provided for the complete parts list (https://pcpartpicker.com/list/hxnCRV).",
          "Hosted by Dwight (Twitter: @_MightyPotato) and promoted across GeForce social channels.",
          "Video tied to Summer of RTX community contest and uses hashtags #GeForceGarage #RTXOn #GeForceRTX50."
        ],
        "takeaways": [
          "This is a community-built, consumer‑grade system centered on the GeForce RTX 5090 Founders Edition (consumer GPU, not a data‑center SKU).",
          "The build uses a mini‑ITX platform (MSI MPG B850I Edge) and Fractal Era 2 chassis, showing a compact form factor for high‑end consumer components.",
          "Power delivery is provided by a 1000W SFX unit (Corsair SF1000), indicating significant single‑system power provisioning for an SFF build.",
          "CPU cooling is handled with a 240mm AIO (Corsair Nautilus 240 RS), highlighting liquid cooling considerations in tight enclosures.",
          "System combines a high‑end consumer CPU (Ryzen 7 9800X3D) and 32GB DDR5‑6000 RAM — representative of high‑performance consumer workloads rather than server configurations."
        ],
        "tags": [
          "GeForceGarage",
          "RTX5090",
          "SFF",
          "BuildAPC",
          "SummerOfRTX",
          "FractalEra2",
          "Ryzen9800X3D",
          "DDR5-6000",
          "CorsairSF1000"
        ]
      }
    },
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy AI solutions that unlocked new revenue streams and accelerated their digital transformation. They leveraged GenAI and Google Cloud infrastructure to streamline operations and boost developer productivity, with consulting help compressing timelines and expanding what was possible for the business.",
        "bullets": [
          "TTEC worked with Google Cloud Consulting to fast-track AI prototyping and deployment.",
          "GenAI and Google Cloud infrastructure were used to improve operations and developer productivity.",
          "The engagement compressed TTEC's digital transformation timeline.",
          "AI deployment enabled exploration of entirely new revenue streams.",
          "Consulting expanded the company’s ambitions for AI-driven customer experience solutions."
        ],
        "takeaways": [
          "Robust cloud infrastructure is central to supporting GenAI deployments and operational improvements.",
          "Partnering with cloud consulting can significantly shorten time-to-deployment for AI initiatives.",
          "AI-enabled services can create new revenue opportunities for customer experience providers.",
          "Improvements in developer productivity can accelerate overall transformation and reduce project timelines."
        ],
        "tags": [
          "googlecloud",
          "ttec",
          "genai",
          "aideployment",
          "operationalefficiency",
          "customerexperience",
          "googlecloudplatform",
          "generativeai",
          "consulting"
        ]
      }
    },
    {
      "id": "6B29VDvPPzc",
      "title": "Build Knowledge Graph-powered AI Agents For Your Use Case | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-26T17:41:05.000Z",
      "url": "https://www.youtube.com/watch?v=6B29VDvPPzc",
      "thumbnail": "https://i.ytimg.com/vi/6B29VDvPPzc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the session presents knowledge graphs as a solution to AI agents' lack of company-specific understanding and demonstrates building a knowledge graph automatically from raw documents and connecting it to an agent. No graph expertise is required, and the talk includes an end-to-end demo (with a link to a prior episode comparing VectorDB vs GraphDB).",
        "bullets": [
          "Knowledge graphs can give AI agents understanding of your company-specific information.",
          "Demonstrates automatic construction of a knowledge graph from raw documents.",
          "Shows connecting the knowledge graph to an AI agent for business-aware responses.",
          "No graph theory or query expertise needed—end-to-end build is shown.",
          "References prior episode comparing VectorDB vs GraphDB for Gen AI agents."
        ],
        "takeaways": [
          "You can leverage existing document stores to create knowledge graphs that make AI agents context-aware, reducing manual data curation effort.",
          "Automated graph-building pipelines can lower the need for specialized graph engineering staff when deploying business-aware AI.",
          "Graph-powered agents provide more relevant, company-specific answers—factor this capability into vendor and architecture evaluations for critical systems.",
          "Consider the database architecture trade-offs (graph vs vector) when designing AI infrastructure; see the referenced episode for a comparison."
        ],
        "tags": [
          "knowledge-graph",
          "ai-agent",
          "graphdb",
          "vectordb",
          "genai",
          "databases-for-ai",
          "automation",
          "enterprise-ai",
          "raw-documents",
          "aws-events"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the short video highlights how Copilot Groups makes route planning easy as Jo discovers its capabilities. It presents Microsoft Copilot as an AI tool for group-based route planning and coordination.",
        "bullets": [
          "Focuses on route planning made easy.",
          "Centers on Copilot Groups as the featured capability.",
          "Follows a character named Jo discovering the feature.",
          "Positions the capability within Microsoft Copilot's AI offerings.",
          "Uses hashtags #copilot #microsoftcopilot #ai to frame the content."
        ],
        "takeaways": [
          "Presents Copilot Groups' route-planning capability — relevant to coordinating field teams and maintenance routes.",
          "Frames the feature as group-focused AI assistance, worth evaluating for collaborative planning needs.",
          "Emphasis on ease of use suggests potential to reduce planning overhead and speed coordination decisions.",
          "As part of Microsoft Copilot, this is an option to consider when assessing AI tools for logistics and operations workflow integration."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "routeplanning",
          "CopilotGroups",
          "productivity",
          "logistics",
          "team-collaboration",
          "automation"
        ]
      }
    }
  ]
}