{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-19T14:54:43.626Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "6L86-OnOXV0",
      "title": "How I Built A $1M/Year Business - And Helped My Parents Retire",
      "channel": "CNBC Make It",
      "published_at": "2026-01-17T15:00:09.000Z",
      "url": "https://www.youtube.com/watch?v=6L86-OnOXV0",
      "thumbnail": "https://i.ytimg.com/vi/6L86-OnOXV0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Tuan Le emigrated from Vietnam to Toronto in 2015 and vowed at 15 to help his parents retire. Ten years later his social video production company, ShortsCut, is bringing in over $1 million USD a year in sales, and he now pays his parents' rent and living expenses so they no longer have to work full time.",
        "bullets": [
          "Tuan Le promised at 15 to help his parents retire after immigrating to Toronto in 2015.",
          "He founded ShortsCut, a social video production company.",
          "ShortsCut generates over $1 million USD annually in sales.",
          "Le now covers his parents' rent and living expenses so they no longer work full time.",
          "The video was produced by CNBC Make It (Produced & Edited by Zach Green)."
        ],
        "takeaways": [
          "High-revenue social video businesses like ShortsCut represent a potential customer segment for digital infrastructure providers.",
          "Growing demand for social video production implies needs for scalable storage, bandwidth, and media-processing capacity — factor this into capacity planning.",
          "Offering creator-focused services (fast uploads, transcoding, CDN, archival) could capture revenue from successful content-production companies.",
          "Partnerships or visibility via media outlets can surface fast-growing creator businesses as enterprise customers."
        ],
        "tags": [
          "Tuan Le",
          "ShortsCut",
          "social video",
          "entrepreneurship",
          "CNBC Make It",
          "immigrant success",
          "family support",
          "small business",
          "content creation",
          "1M/year"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video presents a giant carbon dioxide \"bubble\" battery that can store 20 megawatts of energy and — per the title — provides about 8 hours of storage. The description frames this technology as a way to manage fluctuating renewable output and to help drive the global shift to clean energy.",
        "bullets": [
          "Giant carbon dioxide bubble battery stores 20 megawatts of energy.",
          "Title indicates approximately 8 hours of storage duration.",
          "Intended to address the intermittency of renewable energy sources.",
          "Presented as a technology to support the global transition to clean energy."
        ],
        "takeaways": [
          "Offers grid-scale storage capability (20 MW for ~8 hours) useful for balancing renewable variability.",
          "Could serve as a multi-hour backup or resilience option for data centers and critical infrastructure.",
          "May enable higher renewable penetration by smoothing fluctuations in generation.",
          "Relevant for planners evaluating large-scale, long-duration energy storage options for decarbonization."
        ],
        "tags": [
          "CO2-battery",
          "carbon-dioxide",
          "energy-storage",
          "grid-storage",
          "renewable-energy",
          "battery",
          "clean-energy",
          "innovation",
          "data-centers",
          "ieee-spectrum"
        ]
      }
    },
    {
      "id": "OINppmPan0o",
      "title": "Figure Skating | Making Team USA presented by Xfinity with Apolo Ohno",
      "channel": "Team USA",
      "published_at": "2026-01-16T19:30:36.000Z",
      "url": "https://www.youtube.com/watch?v=OINppmPan0o",
      "thumbnail": "https://i.ytimg.com/vi/OINppmPan0o/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Figure skating duo Vadym Kolesnik and Emilia Zingas sit down with Apolo Ohno ahead of the Winter Olympics in an episode of Making Team USA presented by Xfinity. The short profile highlights their partnership as “built on trust.”",
        "bullets": [
          "Interview features pair skaters Vadym Kolesnik and Emilia Zingas with host Apolo Ohno.",
          "Episode is part of the Making Team USA series presented by Xfinity.",
          "Focus of the segment is the duo’s partnership and the theme “built on trust.”",
          "Context is a lead-up to the Winter Olympics.",
          "Promoted via Team USA’s digital channels (YouTube, social links listed)."
        ],
        "takeaways": [
          "Trust is a core element for high-performance teams—prioritize reliability and cross-team confidence in operations.",
          "Prepare and communicate ahead of major events; pre-event profiles and readiness checks help align teams for peak performance.",
          "Leverage multimedia and social channels to humanize teams and build stakeholder engagement around key initiatives.",
          "Sponsorship and partner branding (e.g., presented by Xfinity) can amplify visibility—consider strategic partnerships for major rollouts.",
          "Clear distribution links across platforms increase reach—maintain consistent channels for audience and stakeholder access."
        ],
        "tags": [
          "Vadym Kolesnik",
          "Emilia Zingas",
          "Apolo Ohno",
          "Figure Skating",
          "Making Team USA",
          "Winter Olympics",
          "Trust",
          "Xfinity",
          "Team USA",
          "Interview"
        ]
      }
    },
    {
      "id": "RalzsofAYHM",
      "title": "29-year-old spent $20,000 to open a store in New York — now it brings in $1.6 million a year",
      "channel": "CNBC Make It",
      "published_at": "2026-01-16T17:00:48.000Z",
      "url": "https://www.youtube.com/watch?v=RalzsofAYHM",
      "thumbnail": "https://i.ytimg.com/vi/RalzsofAYHM/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Abby Price started Abbode as a Parsons grad student, selling dried floral arrangements on Facebook in 2019 and expanded to a Nolita storefront by March 2022. Strong shop cashflow let her buy a $15,000 embroidery machine on a whim, and for a year a key element of her business sat covered in dust in the store basement.",
        "bullets": [
          "Founded Abbode while a Parsons student; began selling dried florals on Facebook in 2019.",
          "Opened a physical storefront in Nolita by March 2022 selling bouquets and home decor.",
          "Business cashflow funded a $15,000 embroidery machine purchase.",
          "Price describes the equipment purchase as made \"on a total whim.\"",
          "A crucial part of the business sat unused in the shop basement for a year."
        ],
        "takeaways": [
          "On-site production equipment (e.g., a $15,000 embroidery machine) can introduce new localized electrical loads for small retailers.",
          "Rapid growth from online sales to physical storefronts may create sudden, unpredictable capacity needs in urban areas.",
          "Reliable power and flexible capacity planning support small businesses that add manufacturing or equipment-driven services.",
          "Unused or intermittently used equipment can become an operational risk if brought online without advance infrastructure checks."
        ],
        "tags": [
          "Abby Price",
          "Abbode",
          "Parsons School of Design",
          "dried florals",
          "Nolita storefront",
          "embroidery machine",
          "small business",
          "cashflow",
          "home decor"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… W podcaście KPMG ON AIR eksperci z Zespołu ds. Cen Transferowych omawiają, jak AI zmienia podejście do cen transferowych — od monitorowania rentowności i benchmarków, przez automatyzację dokumentacji, po integrację z ERP. Poruszane są też ryzyka (dane, bezpieczeństwo, RODO, halucynacje), potrzeba uporządkowania procesów, bezpiecznych środowisk (Digital Gateway) oraz rola AI jako wsparcia dla doradców i rozwoju kompetencji pracowników.",
        "bullets": [
          "Zastosowania AI: monitorowanie rentowności, inteligentne benchmarki i automatyzacja dokumentacji cen transferowych.",
          "AI ma wzmacniać pracę doradców podatkowych, a nie ich zastępować.",
          "Ryzyka: ochrona danych, bezpieczeństwo, RODO oraz problem halucynacji AI.",
          "Digital Gateway przedstawiony jako bezpieczne środowisko do pracy z AI.",
          "Wdrożenie: integracja z ERP, uporządkowanie procesów i etapowe podejście jako fundament transformacji."
        ],
        "takeaways": [
          "Zadbaj o bezpieczne środowisko przetwarzania danych (np. izolowane rozwiązania jak Digital Gateway) przed wdrożeniem AI.",
          "Upewnij się, że integracja AI z ERP i systemami finansowymi jest zgodna z politykami bezpieczeństwa i ochrony danych.",
          "Priorytetyzuj uporządkowanie procesów i jakości danych — to kluczowy krok przed automatyzacją i monitorowaniem rentowności.",
          "Planuj szkolenia i rozwój kompetencji zespołów, bo AI będzie wspierać, a nie zastępować ekspertów podatkowych i finansowych."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "podatki",
          "automatyzacja",
          "ERP",
          "bezpieczeństwo danych",
          "RODO",
          "Digital Gateway",
          "monitorowanie rentowności"
        ]
      }
    },
    {
      "id": "dGfcT63U7Mo",
      "title": "The 2026 U.S. Olympic Figure Skating Team 🇺🇸",
      "channel": "Team USA",
      "published_at": "2026-01-15T20:43:24.000Z",
      "url": "https://www.youtube.com/watch?v=dGfcT63U7Mo",
      "thumbnail": "https://i.ytimg.com/vi/dGfcT63U7Mo/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this Team USA video presents the U.S. Olympic Figure Skating lineup for the 2026 Winter Olympics. The brief description uses an enthusiastic tone (emoji) and includes the #WinterOlympics hashtag.",
        "bullets": [
          "Video title: The 2026 U.S. Olympic Figure Skating Team",
          "Channel: Team USA",
          "Published: 2026-01-15T20:43:24.000Z",
          "No transcript available; description is a single-line announcement with an emoji",
          "Includes hashtag: #WinterOlympics"
        ],
        "takeaways": [
          "Olympic-themed content may attract heightened viewer interest around event dates—consider capacity and CDN readiness if hosting or serving similar assets",
          "Short promotional videos can create bursts of traffic when posted; ensure monitoring/alerting for streaming performance",
          "Metadata (title, channel, hashtags, publish time) is concise—optimize delivery and caching rules for short-form promotional clips"
        ],
        "tags": [
          "figure skating",
          "Team USA",
          "2026 Olympics",
          "Winter Olympics",
          "U.S. Olympic Team",
          "figure skating lineup",
          "sports",
          "Olympics"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video encourages using Microsoft Copilot to keep momentum by stacking small wins. It frames Copilot as a way to sustain progress across workouts, projects, and personal goals.",
        "bullets": [
          "Emphasizes stacking small wins to maintain momentum.",
          "Applies to workouts, projects, and personal goals.",
          "Positions Microsoft Copilot as a tool to support ongoing progress.",
          "Focus is on sustaining momentum rather than single achievements."
        ],
        "takeaways": [
          "If maintaining steady progress is a priority, consider whether Copilot’s small-wins approach could help keep long infrastructure or upgrade projects on track.",
          "Explore applying a 'stack small wins' mindset to repetitive operational tasks to improve consistency and reduce drift.",
          "Assess whether tools that help sustain momentum could reinforce team productivity during multi-phase deployments or maintenance cycles."
        ],
        "tags": [
          "Microsoft Copilot",
          "Copilot",
          "productivity",
          "small wins",
          "momentum",
          "workouts",
          "projects",
          "personal goals",
          "motivation",
          "self-improvement"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This Intel Business video highlights how precision and speed matter in high-frequency trading, showcasing the Dell PowerEdge R770AP server powered by Intel® Xeon® 6 processors. The description states the platform helps maximize gains and minimize losses by performing hundreds of trades in seconds and frames Intel Xeon 6 CPUs as defining the future of finance.",
        "bullets": [
          "Focuses on high-frequency trading (HFT) use case.",
          "Features Dell PowerEdge R770AP server.",
          "Powered by Intel® Xeon® 6 processors.",
          "Emphasizes precision and speed to execute hundreds of trades in seconds.",
          "Positions Intel Xeon 6 performance as shaping finance's future."
        ],
        "takeaways": [
          "Low-latency, high-performance CPUs are presented as critical for HFT outcomes.",
          "The Dell PowerEdge R770AP with Intel Xeon 6 is highlighted as a candidate platform for trading workloads.",
          "Systems engineered for rapid, precise execution (hundreds of trades/sec) can help maximize gains and minimize losses.",
          "Decision-makers should evaluate server+CPU combinations for speed and precision when designing trading infrastructure."
        ],
        "tags": [
          "high-frequency trading",
          "HFT",
          "Intel Xeon 6",
          "Dell PowerEdge R770AP",
          "low-latency",
          "trading infrastructure",
          "finance tech",
          "data center",
          "Intel Business",
          "servers"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The video says Copilot restored a lost creative spark and invites viewers to try it. Viewers are directed to download Copilot via the link in the channel's bio.",
        "bullets": [
          "Copilot is presented as a way to revive creativity.",
          "Short, promotional message with a clear call to action.",
          "Viewers are instructed to download Copilot from the link in bio.",
          "Message is concise and focused on user trial.",
          "No technical details or features are described."
        ],
        "takeaways": [
          "The video positions Copilot as a productivity/creativity tool worth testing by teams.",
          "Grid and data center decision-makers can follow the call to action to download and trial Copilot for internal ideation workflows.",
          "Because the description gives no technical details, any evaluation should include hands-on testing to assess fit for operational needs."
        ],
        "tags": [
          "Copilot",
          "Microsoft Copilot",
          "creativity",
          "download",
          "AI assistant",
          "productivity",
          "call to action",
          "creative tools"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video showcases the open-world martial arts RPG Where Winds Meet running with DLSS 4 and Multi Frame Generation. It emphasizes the game's visuals with #RTXOn and credits DigitalDreamsyt for the footage.",
        "bullets": [
          "Open-world martial arts RPG: Where Winds Meet",
          "Features DLSS 4 with Multi Frame Generation",
          "Highlights #RTXOn visuals",
          "Footage credited to DigitalDreamsyt"
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is being showcased in contemporary game demos.",
          "RTX-enabled visual features are a focal point for promotional content.",
          "Third-party creators (DigitalDreamsyt) are used to present technology demonstrations."
        ],
        "tags": [
          "Where Winds Meet",
          "DLSS 4",
          "Multi Frame Generation",
          "RTXOn",
          "open-world",
          "martial arts RPG",
          "DigitalDreamsyt",
          "game footage"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video is posted on the Intel Business channel and titled \"Taha Khalifa (Intel) | Intel Business.\" The channel offers IT resources, guidance, and expert insights spanning data centers to devices, and includes links to subscribe and connect via Intel Business website and social channels.",
        "bullets": [
          "Video title features Taha Khalifa and is hosted on the Intel Business channel.",
          "Channel focus: IT information and guidance from data centers to endpoint devices.",
          "Offers resources and expert insights to support IT projects.",
          "Includes a subscribe link and links to Intel Business website and social profiles (X, LinkedIn, Facebook).",
          "Aimed at helping IT teams get projects done correctly with vendor-provided materials."
        ],
        "takeaways": [
          "Intel Business positions itself as a centralized resource for data center and device-related IT projects—use the channel for technical guidance and planning.",
          "Decision-makers can follow the channel and website to access expert insights and resources relevant to data center operations and deployments.",
          "Use the provided social and website links to stay updated and to find more in-depth materials for project execution and vendor engagement."
        ],
        "tags": [
          "Intel Business",
          "Taha Khalifa",
          "Intel",
          "data centers",
          "IT resources",
          "IT projects",
          "devices",
          "enterprise IT",
          "data center management"
        ]
      }
    },
    {
      "id": "kSocjh8PZnQ",
      "title": "Rynek dóbr luksusowych w obliczu transformacji | Andrzej Marczak, Tomasz Wiśniewski",
      "channel": "KPMG Poland",
      "published_at": "2026-01-13T10:23:31.000Z",
      "url": "https://www.youtube.com/watch?v=kSocjh8PZnQ",
      "thumbnail": "https://i.ytimg.com/vi/kSocjh8PZnQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… KPMG ON AIR podcast episode features Andrzej Marczak and Tomasz Wiśniewski discussing how the luxury goods market is being reshaped by trends such as experiential luxury, ESG (responsible luxury), and the rise of \"affordable luxury,\" with Poland continuing to grow despite global declines. The episode covers customer segmentation, Gen Z preferences, personalization, luxury in hospitality and film, the Polish art market and tourism, and future drivers like AI and craftsmanship.",
        "bullets": [
          "Global trends: \"luxury fatigue,\" concentration of spending (top 2% = 40% of market) and growth of \"affordable luxury\"",
          "Shift from ownership to experiences, strong emphasis on personalization and exclusive customer experiences",
          "Gen Z favors experiences over possessions; new aspirational consumer segments expand product categories",
          "ESG and responsible luxury gaining importance (e.g., eco-leathers, certifications) across the industry",
          "Poland: a growing but fragmented market, with opportunities in art, luxury tourism, hotels/spa, and emerging tech (AI)"
        ],
        "takeaways": [
          "ESG emphasis implies rising demand for low‑carbon, certified infrastructure—data center operators should prioritize energy efficiency and renewable sourcing to meet client expectations and reporting needs.",
          "Mention of AI and personalization points to increased compute and low‑latency requirements; plan capacity and modular scaling for AI workloads and real‑time customer experiences.",
          "Growth in luxury hospitality, film and digital experiences in Poland suggests need for high availability and localized capacity—ensure redundancy and regional presence to support premium services.",
          "Concentrated high‑value customers and expanding aspirational segments mean traffic and peak demand variability—design flexible scaling and demand‑management strategies to handle spikes."
        ],
        "tags": [
          "luksus",
          "ESG",
          "Polska",
          "AI",
          "personalizacja",
          "turystyka",
          "hotele",
          "rynek luksusowy",
          "KPMG",
          "podcast"
        ]
      }
    }
  ]
}