{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-28T18:59:15.008Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy GenAI solutions, unlocking new revenue streams while streamlining operations and boosting developer productivity. The collaboration leveraged Google Cloud's infrastructure to compress TTEC's digital transformation timeline and expand the company's commercial ambitions.",
        "bullets": [
          "Rapid prototyping and deployment of AI solutions with Google Cloud Consulting.",
          "Use of GenAI and Google Cloud infrastructure to improve operations.",
          "Focus on boosting developer productivity to accelerate delivery.",
          "Engagement unlocked entirely new revenue streams for TTEC.",
          "Consulting compressed the digital transformation timeline and expanded business ambitions."
        ],
        "takeaways": [
          "Ensure infrastructure can support GenAI workloads to enable rapid prototyping and deployment.",
          "Partnering with cloud consulting can materially shorten transformation timelines.",
          "Investments that boost developer productivity speed time-to-market and operational efficiency.",
          "New revenue opportunities from AI deployments can justify infrastructure and consulting spend."
        ],
        "tags": [
          "googlecloud",
          "ttec",
          "genai",
          "aideployment",
          "operationalefficiency",
          "customerexperience",
          "googlecloudplatform",
          "generativeai",
          "cloudconsulting",
          "digitaltransformation"
        ]
      }
    },
    {
      "id": "yUpQ9pWA9WE",
      "title": "Watch Live: Fed Chair Jerome Powell Holds News Conference | WSJ",
      "channel": "WSJ News",
      "published_at": "2026-01-27T20:49:24.000Z",
      "url": "https://www.youtube.com/watch?v=yUpQ9pWA9WE",
      "thumbnail": "https://i.ytimg.com/vi/yUpQ9pWA9WE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Federal Reserve Chair Jerome Powell speaks to reporters following the Fed's two-day policy-setting meeting in a live WSJ news conference. The video presents his post-meeting remarks to the press.",
        "bullets": [
          "Jerome Powell holds a WSJ-hosted news conference.",
          "Event follows the Federal Reserve's two-day policy-setting meeting.",
          "Powell speaks directly to reporters.",
          "WSJ provided live coverage of the session.",
          "Description includes tags: #JeromePowell #Fed #WSJ"
        ],
        "takeaways": [
          "Monitor the news conference for post-meeting guidance that could signal shifts in monetary policy.",
          "Be prepared for market volatility around the briefing that may affect financing and capital availability.",
          "Ensure monitoring and risk-management systems are active during and after the event to capture any rapid market moves.",
          "Maintain contingency plans for potential short-term impacts on operational costs or funding conditions."
        ],
        "tags": [
          "JeromePowell",
          "Fed",
          "WSJ",
          "FederalReserve",
          "newsconference",
          "policymeeting",
          "live",
          "monetarypolicy"
        ]
      }
    },
    {
      "id": "5CyVBSbHmbA",
      "title": "Year-end toolkit: Strengthening audit committee collaboration",
      "channel": "PwC US",
      "published_at": "2026-01-27T17:20:31.000Z",
      "url": "https://www.youtube.com/watch?v=5CyVBSbHmbA",
      "thumbnail": "https://i.ytimg.com/vi/5CyVBSbHmbA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This PwC Year-end Toolkit episode addresses how finance teams can strengthen collaboration with audit committees, streamline year-end accounting and reporting, and respond to expanding oversight responsibilities. It highlights emerging areas of focus including AI oversight, enterprise risk management, cyber risk in the age of AI, and elevating proxy disclosures.",
        "bullets": [
          "Guidance on improving management–audit committee communication and collaboration.",
          "Overview of key year‑end accounting and reporting issues finance teams should be ready to address.",
          "Discussion of AI oversight: risks, opportunities, and control considerations.",
          "Considerations for enhancing enterprise risk oversight and navigating cyber risks influenced by AI.",
          "Recommendations for elevating proxy disclosures and additional resources (replay and guide links provided)."
        ],
        "takeaways": [
          "Expect audit committees to probe AI governance and controls—ensure documentation and readiness to explain AI use and related controls.",
          "Frame year‑end reporting and accounting topics clearly for governance to help a packed committee agenda stay focused.",
          "Elevate enterprise risk and cyber risk updates (including AI‑related implications) to the committee to support oversight and decision‑making.",
          "Prepare to enhance proxy disclosures where governance, risk, or transformation initiatives materially affect stakeholders."
        ],
        "tags": [
          "audit-committee",
          "year-end",
          "finance",
          "governance",
          "AI",
          "enterprise-risk",
          "cyber-risk",
          "proxy-disclosures",
          "PwC"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights how Copilot Groups makes route planning easy as Jo discovers their capabilities. The short description emphasizes Microsoft Copilot and AI using related hashtags.",
        "bullets": [
          "Route planning made easy.",
          "Jo discovers the power of Copilot Groups.",
          "Focus on Copilot Groups as a capability within Microsoft Copilot.",
          "Description includes hashtags: #copilot #microsoftcopilot #ai."
        ],
        "takeaways": [
          "So what: Simplified route planning could be relevant for coordinating field teams and maintenance routes.",
          "So what: Copilot Groups suggests a team-oriented AI feature worth evaluating for collaborative planning tasks.",
          "So what: AI-assisted routing may help reduce planning time and improve operational responsiveness.",
          "So what: Consider a small pilot to assess Copilot Groups’ fit for logistics or site-visit scheduling."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "route-planning",
          "copilot-groups",
          "productivity",
          "field-operations",
          "logistics",
          "Jo"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI in audit is presented as a current, practical toolset that helps auditors automate repetitive tasks, analyse full data populations and support decision-making. KPMG ON AIR hosts Katarzyna Chojniak and Alicja Barska outline concrete tools (AI Transaction Scoring Tool, Clara AI, KPMG Clara and Clara for Clients), shifts from sampling to whole-population analysis, and the related benefits, implementation challenges and data/security considerations.",
        "bullets": [
          "AI tools enable analysis of full populations instead of sampling, improving coverage and insights.",
          "Specific solutions discussed: AI Transaction Scoring Tool, Clara AI (conversational assistants/agents) and the KPMG Clara platform.",
          "AI supports documentation, disclosure analysis and real-time audit management and client communication.",
          "Adoption changes the auditor role and requires new competencies and adaptation efforts.",
          "Key challenges highlighted include data security, regulatory environment and potential AI-related risks."
        ],
        "takeaways": [
          "Greater data coverage from AI-driven full-population analysis can yield more accurate, comprehensive audit insights for infrastructure and asset-heavy operations.",
          "Real-time audit management and client-facing platforms improve transparency and timeliness of reporting for large-scale facilities.",
          "Data security and regulatory compliance are critical when applying AI to audits of sensitive grid/data center information.",
          "Investing in auditor skills and change management is necessary to realise AI benefits and adapt processes without increasing risk."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMG",
          "KPMG Clara",
          "Clara AI",
          "AI Transaction Scoring",
          "audyt automatyzacja",
          "bezpieczeństwo danych",
          "regulacje",
          "innowacje"
        ]
      }
    }
  ]
}