{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-28T04:20:12.371Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "gv6zK265OUE",
      "title": "Build your first GraphRAG Powered Agent! (No Graph Expert Required) | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-27T20:55:49.000Z",
      "url": "https://www.youtube.com/watch?v=gv6zK265OUE",
      "thumbnail": "https://i.ytimg.com/vi/gv6zK265OUE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this AWS Events session demonstrates how to build a GraphRAG-powered knowledge graph in an afternoon using familiar AI tools, with a live demo using real documents. It stresses that knowledge trapped in docs, PDFs, and wikis can be unlocked for reasoning without a six-month project.",
        "bullets": [
          "Knowledge often sits trapped in documents, PDFs, and wikis and is hard for models to reason over.",
          "Knowledge graphs can unlock that information for AI-driven reasoning.",
          "The session shows you can build a knowledge graph quickly—an afternoon, not months.",
          "Live demo with real documents to illustrate the process.",
          "No deep graph expertise or six-month project required."
        ],
        "takeaways": [
          "If your facility’s operational docs and runbooks are accessible, you can make them queryable by AI much faster than expected.",
          "A quick knowledge-graph build enables models to reason over internal documents for decisions and troubleshooting.",
          "You can leverage existing AI tools and real documents without committing to a long, specialized development project."
        ],
        "tags": [
          "GraphRAG",
          "knowledge-graph",
          "RAG",
          "AI",
          "Databases-for-AI",
          "live-demo",
          "documents",
          "PDFs",
          "wikis",
          "AWS-Events"
        ]
      }
    },
    {
      "id": "yUpQ9pWA9WE",
      "title": "Watch Live: Fed Chair Jerome Powell Holds News Conference | WSJ",
      "channel": "WSJ News",
      "published_at": "2026-01-27T20:49:24.000Z",
      "url": "https://www.youtube.com/watch?v=yUpQ9pWA9WE",
      "thumbnail": "https://i.ytimg.com/vi/yUpQ9pWA9WE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Federal Reserve Chair Jerome Powell speaks to reporters following the Federal Reserve's two-day policy-setting meeting. The event is presented as a live news conference by WSJ News.",
        "bullets": [
          "Jerome Powell addresses reporters after the Fed's two-day policy-setting meeting.",
          "Event labeled as a live news conference by WSJ News.",
          "Description provides no transcript of the remarks.",
          "Video metadata includes hashtags #JeromePowell, #Fed, and #WSJ."
        ],
        "takeaways": [
          "Treat this news conference as the official Fed communication following the policy meeting and review it for any formal statements.",
          "Obtain the recording or official transcript to confirm any details relevant to financing, budgeting, or timing decisions.",
          "Record and archive pertinent quotes or timestamps for internal decision-making and audit trails."
        ],
        "tags": [
          "JeromePowell",
          "Fed",
          "WSJ",
          "Federal Reserve",
          "policy meeting",
          "news conference",
          "live",
          "economy"
        ]
      }
    },
    {
      "id": "MuQmKCWjSYI",
      "title": "Deutsche Bank accelerates Cloud journeys with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-27T17:39:29.000Z",
      "url": "https://www.youtube.com/watch?v=MuQmKCWjSYI",
      "thumbnail": "https://i.ytimg.com/vi/MuQmKCWjSYI/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Google Cloud Consulting partnered with Deutsche Bank to design novel learning experiences that trained thousands of engineers to become fluent in cloud engineering. They used Generative AI to create personalized, interactive training that blends on‑demand convenience with instructor‑led effectiveness, with Google Cloud Consulting Learning Services supplying the creative innovation and technical expertise to build the Deutsche Bank Cloud Engineering Program and massively accelerate the bank’s cloud journey.",
        "bullets": [
          "Designed novel learning experiences that trained thousands of engineers in cloud engineering.",
          "Applied Generative AI to produce personalized, interactive training content.",
          "Blended on‑demand learning with instructor‑led sessions for greater effectiveness.",
          "Google Cloud Consulting Learning Services provided creative and technical expertise.",
          "Program aimed to massively accelerate Deutsche Bank’s cloud journey."
        ],
        "takeaways": [
          "AI-driven, personalized training can scale skill development across large engineering teams.",
          "Blended on‑demand plus instructor‑led formats combine convenience with training effectiveness.",
          "Working with consulting learning specialists speeds program design and technical enablement.",
          "Rapid upskilling programs support and can accelerate organizational cloud adoption and related data center transition planning."
        ],
        "tags": [
          "Deutsche Bank",
          "Google Cloud",
          "Cloud Engineering",
          "Generative AI",
          "Training",
          "Learning Services",
          "Cloud Consulting",
          "Workforce Development",
          "Cloud Adoption",
          "Personalized Learning"
        ]
      }
    },
    {
      "id": "5CyVBSbHmbA",
      "title": "Year-end toolkit: Strengthening audit committee collaboration",
      "channel": "PwC US",
      "published_at": "2026-01-27T17:20:31.000Z",
      "url": "https://www.youtube.com/watch?v=5CyVBSbHmbA",
      "thumbnail": "https://i.ytimg.com/vi/5CyVBSbHmbA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this PwC episode in the Year‑end toolkit series focuses on strengthening finance teams’ collaboration with audit committees during the year‑end accounting and reporting process. It covers practical areas including communication and collaboration, key year‑end issues, AI oversight, enterprise risk, evolving cyber risk in the age of AI, and elevating proxy disclosures, with time‑stamped segments and links to further resources.",
        "bullets": [
          "Guidance on improving management–audit committee communication and collaboration at year‑end.",
          "Overview of key year‑end accounting and reporting issues finance teams should be ready to address.",
          "Discussion of AI oversight: risks, opportunities, and needed controls for governance.",
          "Focus on enhancing enterprise risk oversight and navigating cyber risk amid AI advances.",
          "Considerations for elevating proxy disclosures and related governance reporting."
        ],
        "takeaways": [
          "Ensure concise, targeted updates to audit committees on AI use and controls in operations to demonstrate oversight and risk management.",
          "Prepare clear documentation of year‑end accounting impacts from transformation initiatives to streamline committee review.",
          "Prioritize cyber risk and AI‑related threat assessments in governance reporting to inform committee oversight and resource allocation.",
          "Align enterprise risk metrics and escalation paths so audit committees can track material risks and remediation progress."
        ],
        "tags": [
          "audit-committee",
          "year-end",
          "finance",
          "AI-oversight",
          "enterprise-risk",
          "cyber-risk",
          "proxy-disclosures",
          "governance",
          "reporting",
          "PwC"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, route planning made easy—Jo discovers the power of Copilot Groups. The short video highlights Copilot Groups on the Microsoft Copilot channel and emphasizes simplified route planning.",
        "bullets": [
          "Title: Zip Up, Clip In, Copilot On",
          "Channel: Microsoft Copilot",
          "Focus: Copilot Groups for route planning",
          "Highlights Jo discovering the power of Copilot Groups",
          "Includes hashtags: #copilot #microsoftcopilot #ai"
        ],
        "takeaways": [
          "Copilot Groups are presented as a tool to simplify route planning for field teams.",
          "Simpler route planning could reduce coordination time for maintenance and service visits.",
          "Evaluate Copilot Groups for potential efficiency gains in logistics and dispatch operations.",
          "The content signals Microsoft Copilot positioning AI features for operational workflows."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "route-planning",
          "copilot-groups",
          "logistics",
          "field-operations",
          "operations"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI w audycie to już codzienność — narzędzia KPMG wspierają automatyzację powtarzalnych zadań, analizę dużych zbiorów danych i podejmowanie lepiej uzasadnionych decyzji. Rozmówczynie opisują konkretne rozwiązania (AI Transaction Scoring Tool, Clara AI, KPMG Clara), korzyści dla klientów oraz wyzwania związane z bezpieczeństwem danych, regulacjami i zmianą kompetencji audytorów.",
        "bullets": [
          "AI Transaction Scoring Tool umożliwia analizę pełnych populacji zamiast tradycyjnego próbkowania.",
          "Clara AI działa jako konwersacyjny asystent i zestaw wyspecjalizowanych agentów wspierających audyt.",
          "KPMG Clara zapewnia zarządzanie badaniem w czasie rzeczywistym, a Clara for Clients ułatwia komunikację z klientem.",
          "AI wspiera dokumentację i analizę ujawnień, zmieniając rolę audytora i wymagane kompetencje.",
          "Wdrażanie wiąże się z wyzwaniami: bezpieczeństwo danych, środowisko regulacyjne i potencjalne zagrożenia AI."
        ],
        "takeaways": [
          "Przygotuj systemy i dostęp do danych — audyty oparte na AI coraz częściej będą analizować pełne populacje danych, nie tylko próbki.",
          "Zadbaj o integrację i przejrzystość procesów — real‑time management audytu wymaga lepszej widoczności i współpracy z zespołami audytowymi.",
          "Priorytetem jest bezpieczeństwo i zgodność — przed udostępnieniem danych audytorom sprawdź wymagania regulacyjne i mechanizmy ochrony danych.",
          "Oceniaj partnerów pod kątem zarządzania AI i kompetencji zespołu — istotne są governance AI, kontrole oraz umiejętność interpretacji wyników."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMG",
          "KPMG Clara",
          "Clara AI",
          "analiza pełnej populacji",
          "bezpieczeństwo danych",
          "innowacje w audycie",
          "kompetencje audytorów"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield has officially launched and the release trailer highlights support for NVIDIA DLSS 4 with Multi Frame Generation. The game is a 3D real-time strategy RPG where you play the Endministrator exploring Talos-II, and the trailer was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 Multi Frame Generation 4X Mode.",
        "bullets": [
          "Arknights: Endfield officially launched; genre: 3D real-time strategy RPG.",
          "Features NVIDIA DLSS 4 with Multi Frame Generation (link provided).",
          "Trailer captured on GeForce RTX 5080 at 4K Ultra with DLSS 4 MFG 4X Mode.",
          "Official game site and social channels listed for more information.",
          "NVIDIA GeForce-produced trailer promoting DLSS 4 and RTX capture."
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is being adopted in new game releases—note compatibility and driver support requirements for testing or deployment.",
          "The trailer demonstrates 4K Ultra capture using a GeForce RTX 5080 with DLSS 4 MFG 4X Mode—plan for GPU-class hardware capable of high-resolution capture and AI frame generation workloads.",
          "For QA, streaming, or content pipelines, ensure infrastructure (GPU, drivers, capture/storage) can handle 4K captures and DLSS 4 workflows as shown in this example."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "RTX5080",
          "4K",
          "NVIDIA",
          "GeForce",
          "gaming",
          "launch"
        ]
      }
    }
  ]
}