{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-21T11:46:46.118Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "wicD8G0rn1Y",
      "title": "New: AWS Lambda tenant isolation | Serverless Office Hours",
      "channel": "AWS Events",
      "published_at": "2026-01-21T08:04:52.000Z",
      "url": "https://www.youtube.com/watch?v=wicD8G0rn1Y",
      "thumbnail": "https://i.ytimg.com/vi/wicD8G0rn1Y/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this episode demos AWS Lambda's new tenant isolation mode for building secure multi-tenant SaaS applications. It provides dedicated execution environments per tenant to silo cached data and execution contexts, reduce infrastructure complexity, enable faster scaling during traffic spikes, and include automatic tenant-identifier logging for easier tenant-specific debugging.",
        "bullets": [
          "Dedicated execution environments per tenant to prevent cross-tenant data exposure",
          "Siloed cached data and execution contexts for stronger isolation",
          "Reduces infrastructure complexity while maintaining security boundaries",
          "Enables faster scaling during traffic spikes",
          "Built-in monitoring with automatic tenant identifier logging for debugging"
        ],
        "takeaways": [
          "Stronger isolation lowers risk of cross-tenant data leaks and supports compliance needs",
          "Simplified infrastructure can reduce operational overhead and management complexity",
          "Faster, tenant-aware scaling improves performance during peak traffic",
          "Automatic tenant logging speeds tenant-specific troubleshooting and incident response"
        ],
        "tags": [
          "AWS Lambda",
          "tenant isolation",
          "serverless",
          "multi-tenant",
          "SaaS",
          "security",
          "monitoring",
          "scaling",
          "execution environments",
          "office hours"
        ]
      }
    },
    {
      "id": "jOC3G_N20lY",
      "title": "Year-end toolkit: Cash flow classification",
      "channel": "PwC US",
      "published_at": "2026-01-20T22:41:11.000Z",
      "url": "https://www.youtube.com/watch?v=jOC3G_N20lY",
      "thumbnail": "https://i.ytimg.com/vi/jOC3G_N20lY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this PwC episode in the year-end toolkit series focuses on the statement of cash flows, highlighting areas of investor and regulator attention. It reviews SEC comment letter themes, practical classification issues for complex transactions (debt restructurings, payment processing arrangements, and business combinations), reminders and best practices, and a FASB project on targeted improvements.",
        "bullets": [
          "Overview and key reminders on preparing the statement of cash flows.",
          "Discussion of SEC comment letter themes related to cash flow presentation.",
          "Practical considerations for debt restructurings and their cash flow classification.",
          "Guidance on payment processing arrangements and business combinations.",
          "Update on the FASB project addressing targeted improvements to the statement of cash flows."
        ],
        "takeaways": [
          "Ensure cash flow presentation anticipates investor and regulator scrutiny when preparing year-end reporting.",
          "Review classification and disclosure for debt restructurings to reflect appropriate cash flow treatment.",
          "Evaluate payment processing arrangements for how receipts and outflows are presented on the statement of cash flows.",
          "Confirm business combination cash flow classification and related disclosures are clear and complete.",
          "Monitor SEC comment letter trends and the FASB targeted-improvements project for potential impacts on year-end reporting."
        ],
        "tags": [
          "statement of cash flows",
          "cash flow classification",
          "SEC comment letters",
          "debt restructurings",
          "payment processing",
          "business combinations",
          "FASB",
          "year-end reporting",
          "PwC",
          "accounting guidance"
        ]
      }
    },
    {
      "id": "3wQ_yte0TTo",
      "title": "Build Voice Agents with Amazon Nova 2 Sonic &amp; AgentCore | AWS Show and Tell",
      "channel": "AWS Events",
      "published_at": "2026-01-20T22:10:10.000Z",
      "url": "https://www.youtube.com/watch?v=3wQ_yte0TTo",
      "thumbnail": "https://i.ytimg.com/vi/3wQ_yte0TTo/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This episode introduces Amazon Nova 2 Sonic and demonstrates how to build production-ready voice agents using Amazon Bedrock AgentCore and Strands BidiAgent. It highlights Nova 2 Sonic features (polyglot voices, 1M-token context windows, asynchronous tool calling), WebSocket bidirectional streaming, and includes hands-on Python examples plus a workshop link.",
        "bullets": [
          "Nova 2 Sonic: polyglot voices, 1-million-token context windows, and asynchronous tool calling.",
          "AgentCore bidirectional streaming (WebSocket) enables real-time, two-way voice communication.",
          "Strands BidiAgent integrates with Nova Sonic to handle interruptions and agent-to-agent collaboration.",
          "Practical Python code examples and best practices for building production-ready voice agents.",
          "Workshop materials and code samples available on GitHub: https://github.com/aws-samples/amazon-nova-samples/tree/main/speech-to-speech/amazon-nova-2-sonic/workshops"
        ],
        "takeaways": [
          "WebSocket-based bidirectional streaming for ultra-responsive voice interactions indicates a need to evaluate low-latency network and throughput capacity.",
          "Support for 1-million-token context windows and advanced model features suggests higher compute and memory demands when hosting or supporting inference.",
          "Polyglot voice capabilities and agent-to-agent collaboration enable broader multilingual and multi-agent deployments—plan for scaling and orchestration.",
          "Available hands-on Python demos and workshop materials make it easier to prototype, evaluate, and pilot deployments in controlled environments."
        ],
        "tags": [
          "Amazon Nova 2",
          "Nova Sonic",
          "Amazon Bedrock",
          "AgentCore",
          "Strands BidiAgent",
          "bidirectional streaming",
          "voice agents",
          "speech-to-speech",
          "Python",
          "workshop"
        ]
      }
    },
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video shows how Rate Insurance boosts agent efficiency using Agentforce and Gemini. The description also points viewers to learn more about the Google Cloud and Salesforce partnership via the provided link.",
        "bullets": [
          "Highlights Rate Insurance improving agent efficiency with Agentforce and Gemini.",
          "References the Google Cloud and Salesforce partnership (link provided).",
          "Frames the content as a demonstration of a customer use case.",
          "Aimed at viewers interested in cloud + CRM solutions for customer service operations."
        ],
        "takeaways": [
          "For grid/data center decision-makers: this video signals a potential vendor integration (Google Cloud + Salesforce) to evaluate when planning cloud/CRM deployments.",
          "Assess Agentforce and Gemini as part of a short-list for projects targeting measurable agent efficiency improvements.",
          "Use the video and partnership link as an initial input to determine whether deeper technical evaluation or capacity planning is needed before procurement.",
          "Treat the content as a demo-level overview—not a technical specification—so follow up with vendors for infrastructure and support details."
        ],
        "tags": [
          "Google Cloud",
          "Salesforce",
          "Rate Insurance",
          "Agentforce",
          "Gemini",
          "agent efficiency",
          "cloud CRM",
          "partnership",
          "customer service",
          "case study"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Charly Stoever, 35, is a financial coach who lives rent-free in Portland by pet sitting full time, spending the last 18 months living out of two suitcases and earning $60,000 a year. This episode is a CNBC Make It Millennial Money profile detailing how she supports that lifestyle.",
        "bullets": [
          "Charly Stoever, 35, is a financial coach and full-time pet sitter.",
          "She lives rent-free in Portland, Oregon, by pet sitting.",
          "Has lived out of two suitcases for the past 18 months.",
          "Brings in $60,000 per year.",
          "Profiled in CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "Location-independent earners (example: $60K annual income while living nomadically) increase demand for consistently reliable network and power — prioritize uptime and resilience.",
          "Mobile lifestyles underscore the value of distributed and edge infrastructure to reduce latency for users who work from varied locations.",
          "Decentralized work patterns suggest data-center planning should account for more dispersed traffic patterns and peak loads outside traditional office hubs.",
          "Opportunity for tailored services (secure remote access, backup, and lightweight edge compute) targeted at gig and mobile professionals."
        ],
        "tags": [
          "Charly Stoever",
          "pet-sitting",
          "rent-free",
          "financial-coach",
          "Portland",
          "digital-nomad",
          "CNBC-Make-It",
          "Millennial-Money"
        ]
      }
    },
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Dr. Anna Chacon is a 39-year-old dermatologist in Miami, FL who runs her own private practice and, per the video title, earns $900,000 a year. Her reported net worth is about $6 million, comprised of $3.2 million in investments, a $1.9 million home, and a $1.1 million office building.",
        "bullets": [
          "Dr. Anna Chacon, age 39, is a dermatologist in Miami, FL with a private practice.",
          "Video title states she earns $900,000 annually.",
          "Total net worth reported at about $6 million.",
          "Net worth breakdown: $3.2M investments, $1.9M home, $1.1M office building.",
          "Content source: CNBC Make It (no transcript available)."
        ],
        "takeaways": [
          "Medical professionals owning office buildings can contribute to local commercial load profiles—assess capacity needs for small medical offices.",
          "High-income residents and practice owners in Miami may demand reliable power and service continuity for both residential and commercial properties.",
          "Private medical practices in owned office space may have elevated needs for backup power and uptime compared with typical small businesses."
        ],
        "tags": [
          "dermatologist",
          "Miami",
          "private practice",
          "high income",
          "net worth",
          "investments",
          "home",
          "office building",
          "CNBC Make It"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video presents a giant bubble of carbon dioxide that can store 20 megawatts of energy and deliver about 8 hours of power. It’s framed as a way to smooth the fluctuations of renewable energy and help drive the global shift to clean energy.",
        "bullets": [
          "Technology uses a large carbon dioxide \"bubble\" as the energy storage medium.",
          "Claims storage capacity of 20 megawatts and roughly 8 hours of discharge.",
          "Intended to address variability in renewable energy supply.",
          "Positioned as a solution to support the transition to clean energy worldwide."
        ],
        "takeaways": [
          "Offers a multi-hour storage option (20 MW for ~8 hours) useful for peak shifting and longer-duration load support.",
          "Can help integrate variable renewables by providing predictable discharge during low-generation periods.",
          "May serve as a backup or resilience resource for critical loads such as data centers and local grids.",
          "Worth evaluating alongside other long-duration storage solutions when planning renewables integration and decarbonization strategies."
        ],
        "tags": [
          "CO2-battery",
          "long-duration-storage",
          "renewables",
          "energy-storage",
          "grid",
          "battery",
          "clean-energy",
          "IEEE"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI już teraz zmienia podejście do cen transferowych, m.in. w monitorowaniu rentowności, analizach porównawczych i automatyzacji dokumentacji. W podcaście eksperci KPMG omawiają praktyczne wdrożenia, integrację z ERP i inteligentne benchmarki, wskazują na ryzyka (dane, RODO, halucynacje) oraz podkreślają, że AI wzmocni, a nie zastąpi doradców — przy czym kluczowe są uporządkowane procesy i bezpieczne środowiska pracy jak Digital Gateway.",
        "bullets": [
          "Zastosowania AI: monitorowanie rentowności, analizy porównawcze, automatyzacja dokumentacji cen transferowych.",
          "AI wspiera pracę doradców i rozwój młodszych pracowników, ale ich nie zastąpi.",
          "Główne ryzyka: bezpieczeństwo danych, zgodność z RODO oraz problem halucynacji modeli.",
          "Digital Gateway wymieniony jako bezpieczne środowisko do pracy z AI.",
          "Wdrożenie: integracja z ERP, inteligentne benchmarki i porządkowanie procesów jako pierwsze kroki."
        ],
        "takeaways": [
          "Zabezpieczyć infrastrukturę i dostęp (np. rozwiązania typu Digital Gateway) dla pracy z wrażliwymi danymi transfer pricingu.",
          "Priorytet dla zgodności z RODO i polityk bezpieczeństwa przy uruchamianiu narzędzi AI w centrach danych.",
          "Zapewnić gotowość systemów ERP i platform analitycznych do integracji z rozwiązaniami AI i inteligentnymi benchmarkami.",
          "Przygotować zasoby (moc obliczeniową, storage, audytowalność) na automatyzację dokumentacji i analiz.",
          "Uporządkowanie procesów biznesowych jako warunek skalowalnego i bezpiecznego wdrożenia AI."
        ],
        "tags": [
          "podatki",
          "AI",
          "ceny transferowe",
          "KPMG",
          "Digital Gateway",
          "RODO",
          "ERP",
          "automatyzacja",
          "bezpieczeństwo danych",
          "benchmarki"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video encourages keeping momentum on workouts, projects, and personal goals by using Copilot. It presents Copilot as a companion to help sustain steady progress.",
        "bullets": [
          "Encourages maintaining momentum with Copilot",
          "Targets workouts, projects, and personal goals",
          "Frames Copilot as a tool for ongoing progress",
          "Emphasizes steady, continued effort rather than one-off pushes"
        ],
        "takeaways": [
          "Sustained momentum matters: tools that help teams make consistent progress can aid delivery of long-running infrastructure projects.",
          "Operational relevance: using assistants to track and reinforce small, repeatable wins may support maintenance schedules and incremental upgrades.",
          "Pilot consideration: evaluate Copilot in small team pilots to see if it helps staff maintain progress on complex, ongoing data center initiatives."
        ],
        "tags": [
          "Copilot",
          "Microsoft Copilot",
          "momentum",
          "productivity",
          "workouts",
          "projects",
          "personal goals",
          "motivation",
          "assistant"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights how the Dell PowerEdge R770AP server, powered by Intel® Xeon® 6 processors, provides the precision and speed required for high-frequency trading, executing hundreds of trades in seconds to help maximize gains and minimize losses. It frames Intel Xeon 6 CPUs’ high-performance capabilities as defining the future of finance.",
        "bullets": [
          "Focus on high-frequency trading where every second matters.",
          "Dell PowerEdge R770AP server powered by Intel Xeon 6 processors is showcased.",
          "Claims of precision and speed enabling hundreds of trades in seconds.",
          "Positioned to help maximize gains and minimize losses in trading.",
          "Intel Business offers IT resources, guidance, and expert insights."
        ],
        "takeaways": [
          "Consider servers like the Dell PowerEdge R770AP with Intel Xeon 6 for latency-sensitive trading workloads.",
          "High-frequency trading benefits from hardware that emphasizes compute performance and low latency.",
          "Investing in high-performance CPU/server combinations can directly affect trade execution speed and financial outcomes.",
          "Use Intel Business resources for guidance when planning and deploying finance-focused IT infrastructure."
        ],
        "tags": [
          "high-frequency trading",
          "HFT",
          "Intel Xeon 6",
          "Dell PowerEdge R770AP",
          "low-latency",
          "finance",
          "data center",
          "servers",
          "performance"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video positions Copilot as a tool that revived a lost creative spark and encourages viewers to try it. It includes a direct call-to-action to download Copilot via the link in the creator's bio.",
        "bullets": [
          "Message: Copilot brought creativity back to life.",
          "Call-to-action: Download Copilot and try it via the link in bio.",
          "Short promotional clip with no transcript provided.",
          "Emphasis on user trial/engagement."
        ],
        "takeaways": [
          "If organizations or users respond to the call-to-action, demand for AI-enabled applications could increase.",
          "Grid and data center planners should evaluate capacity and scalability to accommodate potential growth in AI workloads.",
          "Consider assessing compute (including GPU) and network resources if adoption of consumer-facing AI tools rises.",
          "Review monitoring, power, and cooling strategies to ensure reliable operation under higher utilization."
        ],
        "tags": [
          "Copilot",
          "creativity",
          "AI",
          "Microsoft",
          "download",
          "promo",
          "productivity",
          "call-to-action"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This video showcases the open-world martial arts RPG Where Winds Meet running with DLSS 4 and Multi Frame Generation. It emphasizes RTX visuals (#RTXOn) and credits @DigitalDreamsyt for the footage.",
        "bullets": [
          "Open-world martial arts RPG: Where Winds Meet",
          "Features DLSS 4 with Multi Frame Generation",
          "Promoted with #RTXOn (RTX visuals)",
          "Footage credited to @DigitalDreamsyt"
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is being demonstrated in a commercial game; evaluate infrastructure support for DLSS 4/MFG when planning GPU/graphics pipelines.",
          "RTX-specific features are highlighted; ensure target hardware and drivers support NVIDIA RTX capabilities for accurate testing and deployment.",
          "Captured gameplay footage from a third party (@DigitalDreamsyt) underscores the need to validate capture and encoding workflows alongside rendering performance."
        ],
        "tags": [
          "WhereWindsMeet",
          "DLSS4",
          "MultiFrameGeneration",
          "RTXOn",
          "open-world",
          "martial-arts",
          "NVIDIA-GeForce",
          "DigitalDreamsyt",
          "gameplay"
        ]
      }
    }
  ]
}