{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-28T08:56:24.469Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "gv6zK265OUE",
      "title": "Build your first GraphRAG Powered Agent! (No Graph Expert Required) | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-27T20:55:49.000Z",
      "url": "https://www.youtube.com/watch?v=gv6zK265OUE",
      "thumbnail": "https://i.ytimg.com/vi/gv6zK265OUE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Your AI’s knowledge often sits locked in docs, PDFs, and wikis that models can’t reason over. The session explains that knowledge graphs can unlock that content and demonstrates building one in an afternoon using the same AI tools you already use, with a live demo on real documents—no six-month project required.",
        "bullets": [
          "Knowledge is trapped in docs, PDFs, and wikis that models can’t reason over.",
          "Knowledge graphs can unlock that embedded information.",
          "Most teams avoid building graphs because it sounds like a massive undertaking.",
          "The talk shows you can build a knowledge graph in an afternoon using existing AI tools.",
          "Live demo uses real documents and avoids a six-month project timeline."
        ],
        "takeaways": [
          "Surface operational knowledge from manuals, runbooks, and reports that currently live in documents.",
          "Use knowledge graphs to enable AI models to reason over that content for faster, more informed decisions.",
          "Prototype quickly—an afternoon build lets you validate use cases without long, costly projects.",
          "Leverage the AI tools your teams already use to reduce adoption friction and specialist hiring."
        ],
        "tags": [
          "knowledge-graphs",
          "AI",
          "documents",
          "PDFs",
          "wikis",
          "knowledge-management",
          "live-demo",
          "rapid-deployment"
        ]
      }
    },
    {
      "id": "yUpQ9pWA9WE",
      "title": "Watch Live: Fed Chair Jerome Powell Holds News Conference | WSJ",
      "channel": "WSJ News",
      "published_at": "2026-01-27T20:49:24.000Z",
      "url": "https://www.youtube.com/watch?v=yUpQ9pWA9WE",
      "thumbnail": "https://i.ytimg.com/vi/yUpQ9pWA9WE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Federal Reserve Chair Jerome Powell speaks to reporters following the Federal Reserve's two-day policy-setting meeting. WSJ News broadcast the live news conference; no transcript is available.",
        "bullets": [
          "Federal Reserve Chair Jerome Powell addresses reporters after a two-day policy-setting meeting.",
          "Event presented as a live news conference on WSJ News.",
          "No transcript is provided for the video.",
          "Description includes hashtags: #JeromePowell #Fed #WSJ."
        ],
        "takeaways": [
          "Watch the full WSJ news conference to capture any official Fed guidance or announcements.",
          "Have finance and strategy teams prepared to review the Fed's statements once they are released.",
          "Archive the recording and any subsequently published transcript for internal briefings and planning.",
          "Communicate internally that the Fed held a post-meeting press conference and that follow-up analysis may be needed."
        ],
        "tags": [
          "JeromePowell",
          "Fed",
          "WSJ",
          "FederalReserve",
          "news",
          "live",
          "press-conference",
          "policy"
        ]
      }
    },
    {
      "id": "MuQmKCWjSYI",
      "title": "Deutsche Bank accelerates Cloud journeys with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-27T17:39:29.000Z",
      "url": "https://www.youtube.com/watch?v=MuQmKCWjSYI",
      "thumbnail": "https://i.ytimg.com/vi/MuQmKCWjSYI/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Google Cloud Consulting Learning Services partnered with Deutsche Bank to build a Cloud Engineering Program that used Generative AI to create personalized, interactive training. The program combined on‑demand convenience with instructor‑led effectiveness, helped thousands of engineers become fluent in cloud engineering, and aimed to massively accelerate Deutsche Bank's cloud journey.",
        "bullets": [
          "Google Cloud Consulting designed the Deutsche Bank Cloud Engineering Program.",
          "Generative AI was used to create personalized, interactive training experiences.",
          "Program blended on‑demand learning with instructor‑led sessions.",
          "Thousands of engineers were trained to become fluent in cloud engineering.",
          "Consulting team supplied creative innovation and technical expertise to accelerate the cloud journey."
        ],
        "takeaways": [
          "Scaling workforce cloud skills is critical for accelerating cloud migrations and transformations.",
          "Generative AI can enable personalized, interactive training at scale to increase skill uptake.",
          "A hybrid on‑demand plus instructor‑led model balances flexibility with training effectiveness for operations teams.",
          "Partnering with experienced consulting teams can provide the design and technical expertise needed to speed program rollout and adoption."
        ],
        "tags": [
          "Deutsche Bank",
          "Google Cloud",
          "Cloud Training",
          "Generative AI",
          "Learning Services",
          "Cloud Engineering",
          "Workforce Upskilling",
          "Consulting",
          "Hybrid Learning"
        ]
      }
    },
    {
      "id": "5CyVBSbHmbA",
      "title": "Year-end toolkit: Strengthening audit committee collaboration",
      "channel": "PwC US",
      "published_at": "2026-01-27T17:20:31.000Z",
      "url": "https://www.youtube.com/watch?v=5CyVBSbHmbA",
      "thumbnail": "https://i.ytimg.com/vi/5CyVBSbHmbA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This PwC episode in the Year‑end toolkit series focuses on strengthening collaboration between management/finance teams and the audit committee, covering year‑end accounting and reporting, AI oversight, enterprise risk management, cyber risk in the age of AI, and proxy disclosures. It aims to help management streamline reporting and address expanding audit committee oversight responsibilities.",
        "bullets": [
          "Strengthening management/audit committee communication and collaboration.",
          "Key year‑end accounting and reporting issues finance teams should be ready to address.",
          "Oversight of AI: assessing risks, opportunities, and controls.",
          "Enhancing enterprise risk oversight and navigating evolving cyber risk in the age of AI.",
          "Elevating proxy disclosures and governance reporting."
        ],
        "takeaways": [
          "Prepare concise, audit‑committee‑ready year‑end reporting that highlights impacts from transformation initiatives.",
          "Document AI governance and control frameworks so the audit committee can assess associated risks and opportunities.",
          "Embed enterprise risk and AI‑related cyber risk into board‑level oversight and reporting processes.",
          "Ensure transformation and operational changes that affect financials or disclosures are surfaced early to support governance and proxy disclosure expectations."
        ],
        "tags": [
          "audit committee",
          "year-end",
          "financial reporting",
          "AI oversight",
          "enterprise risk",
          "cyber risk",
          "proxy disclosures",
          "governance",
          "PwC"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights route planning made easy as Jo discovers the power of Copilot Groups. The description emphasizes Copilot, Microsoft Copilot, and AI.",
        "bullets": [
          "Focuses on route planning made easy.",
          "Features Jo discovering Copilot Groups.",
          "Highlights the power of Copilot within Microsoft’s AI ecosystem.",
          "Description includes tags: #copilot #microsoftcopilot #ai.",
          "No transcript was provided for further detail."
        ],
        "takeaways": [
          "If your operations involve route planning, the Copilot Groups feature shown may be worth evaluating for relevant workflows.",
          "For grid and data center teams coordinating field work, simplified route planning could relate to dispatch and crew logistics.",
          "Assess compatibility with existing Microsoft Copilot tools and AI investments mentioned in the description.",
          "Use the short promo to decide whether to view the full demo or test Copilot Groups in a pilot scenario."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "copilot-groups",
          "route-planning",
          "logistics",
          "operations",
          "field-services",
          "routing"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, KPMG Poland directors Katarzyna Chojniak and Alicja Barska discuss how AI is already embedded in audit processes through tools that automate repetitive tasks, analyze large datasets and support decision-making. They outline specific solutions (AI Transaction Scoring Tool, Clara AI, KPMG Clara and Clara for Clients), benefits for clients, shifting auditor competencies, implementation challenges, data-security and regulatory concerns, and future risks.",
        "bullets": [
          "AI automates repetitive audit tasks and enables analysis of full populations rather than sampling.",
          "AI Transaction Scoring Tool analyzes entire datasets; Clara AI offers conversational assistants and specialized agents.",
          "KPMG Clara manages audits in real time and Clara for Clients modernizes client communication.",
          "Clients gain faster, more comprehensive insights; auditors’ roles and required skills are evolving.",
          "Key challenges include auditor adaptation, data security, regulatory environment and potential AI-related risks."
        ],
        "takeaways": [
          "Expect audits to use full-population AI analytics—ensure your systems provide accessible, high-quality data for analysis.",
          "Prioritize strong data security and compliance controls given the emphasis on data handling and regulatory scrutiny.",
          "Support real-time audit workflows by enabling timely data sharing, structured logging and interoperable interfaces.",
          "Invest in staff training and documentation practices so teams can interact effectively with AI-driven audit processes."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMG",
          "KPMG Clara",
          "Clara AI",
          "AI Transaction Scoring",
          "bezpieczeństwo danych",
          "regulacje",
          "innowacje"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield has officially launched and the trailer highlights NVIDIA DLSS 4 with Multi Frame Generation. The 3D real-time strategy RPG puts you in the role of the Endministrator on Talos-II; the trailer was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 Multi Frame Generation 4X Mode.",
        "bullets": [
          "Arknights: Endfield launch trailer emphasizes NVIDIA DLSS 4 with Multi Frame Generation.",
          "Game genre: 3D real-time strategy RPG — player is the Endministrator exploring Talos-II.",
          "Capture hardware/settings: GeForce RTX 5080, 4K Ultra, DLSS 4 MFG 4X Mode.",
          "Official links provided for DLSS 4 announcement and the game website.",
          "Developer and publisher social channels listed (Twitter/X, YouTube, Instagram, Facebook, TikTok)."
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is appearing in shipping titles — infrastructure planning should account for DLSS4-capable GPUs like the RTX 5080 used in the capture.",
          "Trailer capture at 4K Ultra with DLSS 4 MFG 4X Mode indicates high-performance GPU workloads for real-time rendering and capture pipelines.",
          "Ensure driver, SDK and GeForce platform compatibility when supporting or deploying games that advertise DLSS 4 features.",
          "Cloud gaming, capture, or content pipelines targeting 4K DLSS4 content may need to allocate higher GPU compute/throughput resources."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "RTX5080",
          "4K",
          "NVIDIA",
          "GeForce",
          "Gaming"
        ]
      }
    }
  ]
}