{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-19T08:57:44.022Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "6L86-OnOXV0",
      "title": "How I Built A $1M/Year Business - And Helped My Parents Retire",
      "channel": "CNBC Make It",
      "published_at": "2026-01-17T15:00:09.000Z",
      "url": "https://www.youtube.com/watch?v=6L86-OnOXV0",
      "thumbnail": "https://i.ytimg.com/vi/6L86-OnOXV0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… When he was 15, Tuan Le vowed to help his parents retire after his family emigrated from Vietnam to Toronto in 2015. Ten years later his social video production company, ShortsCut, generates over $1 million USD a year in sales and he now pays his parents' rent and living expenses so they no longer have to work full time.",
        "bullets": [
          "Tuan Le emigrated from Vietnam to Toronto in 2015 and vowed at 15 to help his parents retire.",
          "He founded ShortsCut, a social video production company.",
          "ShortsCut brings in over $1 million USD in annual sales.",
          "Tuan now covers his parents' rent and living expenses, allowing them to stop full-time work.",
          "Video produced and edited by Zach Green; reported by Kamaron McNair (CNBC Make It)."
        ],
        "takeaways": [
          "A founder-driven creative services firm can scale to seven-figure revenue — consider small, specialized vendors as potential stable partners or customers.",
          "Financial outcomes for small businesses can materially affect employee/founder wellbeing and stability — factor vendor founder motivations into vendor assessments.",
          "Growth in social video services signals sustained market demand for content production — evaluate capacity and service offerings that support content creators."
        ],
        "tags": [
          "entrepreneurship",
          "TuanLe",
          "ShortsCut",
          "social video",
          "1M revenue",
          "immigrant entrepreneur",
          "family support",
          "CNBC Make It",
          "Toronto",
          "small business"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, a giant bubble of carbon dioxide is presented as an energy storage device that can store 20 megawatts of energy. The description says these batteries are intended to help address renewable energy fluctuations and support the global shift to clean energy.",
        "bullets": [
          "Giant carbon dioxide bubble functions as an energy storage system.",
          "Described storage capacity: 20 megawatts.",
          "Framed to mitigate variability in renewable generation.",
          "Positioned as a tool to support global clean-energy transition.",
          "Presented by IEEE Spectrum (per video metadata)."
        ],
        "takeaways": [
          "20 MW scale suggests this technology could be relevant for grid-level capacity planning—assess whether that capacity aligns with your needs.",
          "Intended to smooth renewable fluctuations, so consider it as one option for integrating variable renewables into supply mixes.",
          "For data centers, evaluate whether the technology could support decarbonization or resilience goals when paired with renewables.",
          "Require further technical and commercial details (duration, efficiency, cost, deployment timeline) before procurement or integration decisions."
        ],
        "tags": [
          "co2-battery",
          "carbon-dioxide",
          "energy-storage",
          "20-MW",
          "renewable-integration",
          "grid-storage",
          "clean-energy",
          "battery-technology",
          "ieee-spectrum"
        ]
      }
    },
    {
      "id": "OINppmPan0o",
      "title": "Figure Skating | Making Team USA presented by Xfinity with Apolo Ohno",
      "channel": "Team USA",
      "published_at": "2026-01-16T19:30:36.000Z",
      "url": "https://www.youtube.com/watch?v=OINppmPan0o",
      "thumbnail": "https://i.ytimg.com/vi/OINppmPan0o/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Figure skating duo Vadym Kolesnik and Emilia Zingas sit down with Apolo Ohno on an episode of Making Team USA presented by Xfinity ahead of the Winter Olympics. The episode frames their partnership around being \"built on trust.\"",
        "bullets": [
          "Vadym Kolesnik and Emilia Zingas are featured subjects.",
          "Apolo Ohno conducts the interview.",
          "Episode is part of Making Team USA presented by Xfinity.",
          "Context: lead-up to the Winter Olympics.",
          "Core theme highlighted: trust in the partnership."
        ],
        "takeaways": [
          "Emphasis on trust underscores the value of reliable handoffs and clear responsibilities across teams and systems.",
          "Preparing before a high-stakes event aligns with testing and validation practices prior to peak-demand windows.",
          "Sponsor/partner visibility (Xfinity) highlights the importance of strong vendor relationships and service-level agreements.",
          "Featuring experienced voices (e.g., a recognized host) demonstrates the benefit of external expertise to validate readiness and communicate confidence to stakeholders."
        ],
        "tags": [
          "figure skating",
          "Vadym Kolesnik",
          "Emilia Zingas",
          "Apolo Ohno",
          "Making Team USA",
          "Xfinity",
          "Winter Olympics",
          "trust",
          "Team USA"
        ]
      }
    },
    {
      "id": "RalzsofAYHM",
      "title": "29-year-old spent $20,000 to open a store in New York — now it brings in $1.6 million a year",
      "channel": "CNBC Make It",
      "published_at": "2026-01-16T17:00:48.000Z",
      "url": "https://www.youtube.com/watch?v=RalzsofAYHM",
      "thumbnail": "https://i.ytimg.com/vi/RalzsofAYHM/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Abby Price started Abbode as a Parsons grad student selling dried floral arrangements on Facebook in 2019 and opened a Nolita storefront by March 2022. Cashflow from the shop funded a $15,000 embroidery machine that sat unused in the basement for a year, and the business now brings in $1.6 million a year.",
        "bullets": [
          "Founded Abbode while at Parsons School of Design, selling dried florals on Facebook in 2019.",
          "Opened a storefront in Nolita by March 2022.",
          "Store cashflow enabled purchase of a $15,000 embroidery machine bought on a whim.",
          "The embroidery machine sat covered in dust in the shop’s basement for a year.",
          "The business currently generates $1.6 million in annual revenue."
        ],
        "takeaways": [
          "Growing small retailers may make significant capital equipment purchases as they scale; infrastructure planners should note this potential for increased local demand.",
          "Cashflow from a successful storefront can quickly enable investments that change operational needs.",
          "Equipment acquisitions may not be immediately deployed (e.g., sat unused), so demand on utilities can be uneven or delayed.",
          "Rapid revenue growth at a single location suggests the need to monitor neighborhood business expansion when assessing capacity and support."
        ],
        "tags": [
          "Abby Price",
          "Abbode",
          "Parsons School of Design",
          "dried florals",
          "Nolita",
          "embroidery machine",
          "small business",
          "retail",
          "New York",
          "$1.6M revenue"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI już teraz zmienia podejście do cen transferowych, m.in. poprzez monitorowanie rentowności, analizy porównawcze i automatyzację dokumentacji. W podcaście eksperci KPMG (Monika Palmowska i Jakub Roszkiewicz) omawiają praktyczne zastosowania, ryzyka związane z danymi i bezpieczeństwem (w tym RODO i 'halucynacje'), integrację z ERP oraz pierwsze kroki i filary wdrożenia AI, w tym Digital Gateway i uporządkowanie procesów.",
        "bullets": [
          "Zastosowania AI: monitoring rentowności, benchmarki porównawcze, automatyzacja dokumentacji cen transferowych.",
          "AI jako wsparcie doradców podatkowych — ma wzmocnić, a nie zastąpić ekspertów.",
          "Główne ryzyka: jakość danych, bezpieczeństwo, zgodność z RODO i problem halucynacji modeli.",
          "Techniczne wsparcie i integracja: Digital Gateway jako bezpieczne środowisko oraz integracja z ERP i inteligentne benchmarki.",
          "Wdrożenie: zaczynać od uporządkowania procesów, definiowania person i rozwoju kompetencji młodszych pracowników."
        ],
        "takeaways": [
          "Zabezpiecz środowisko przetwarzania AI (np. Digital Gateway) — priorytet dla ochrony danych i operacji.",
          "Planuj integrację AI z ERP, by wykorzystać inteligentne benchmarki i automatyzację w procesach cen transferowych.",
          "Wprowadź silne zasady danych i zgodność z RODO, aby ograniczyć ryzyka związane z wykorzystaniem AI.",
          "Skoncentruj się najpierw na uporządkowaniu procesów i rozwoju kompetencji zespołu przed skalowaniem rozwiązań AI.",
          "Wykorzystanie AI do monitorowania i automatyzacji dokumentacji może poprawić efektywność operacyjną i kontrolę kosztów."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "podatki",
          "automatyzacja",
          "ERP",
          "Digital Gateway",
          "RODO",
          "bezpieczeństwo danych",
          "monitorowanie rentowności",
          "KPMG"
        ]
      }
    },
    {
      "id": "dGfcT63U7Mo",
      "title": "The 2026 U.S. Olympic Figure Skating Team 🇺🇸",
      "channel": "Team USA",
      "published_at": "2026-01-15T20:43:24.000Z",
      "url": "https://www.youtube.com/watch?v=dGfcT63U7Mo",
      "thumbnail": "https://i.ytimg.com/vi/dGfcT63U7Mo/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video announces the U.S. Olympic Figure Skating lineup for the 2026 Winter Olympics. It is a short, promotional clip published by Team USA highlighting the national team selection.",
        "bullets": [
          "Announces U.S. Olympic Figure Skating lineup",
          "Related to the 2026 Winter Olympics (#WinterOlympics)",
          "Published by Team USA",
          "Release date: 2026-01-15",
          "Promotional tone (emoji: 🔥)"
        ],
        "takeaways": [
          "Classify this asset as major seasonal sports content tied to the Winter Olympics for indexing and tagging.",
          "Source is Team USA (official organization) — treat as an authoritative channel when prioritizing feeds or caches.",
          "Time-sensitive: published Jan 15, 2026 — consider relevance during the 2026 Olympics window for caching and delivery policies.",
          "Asset purpose is announcement/promo, likely to be included in event coverage and social distribution playlists."
        ],
        "tags": [
          "team-usa",
          "figure-skating",
          "winter-olympics",
          "2026",
          "olympics",
          "us-olympic-team",
          "sports",
          "announcement",
          "skating-lineup"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Microsoft Copilot is presented as a way to keep momentum going by stacking small wins. The video suggests using Copilot to support steady progress across workouts, projects, and personal goals.",
        "bullets": [
          "Encourages stacking small wins to maintain momentum.",
          "Applies to workouts, projects, and personal goals.",
          "Frames Copilot as a tool to keep progress steady.",
          "Focuses on incremental progress rather than one-time efforts."
        ],
        "takeaways": [
          "Use Copilot to sustain momentum on long-running projects by focusing on small, achievable steps.",
          "A 'small wins' approach can help keep initiatives moving forward and reduce the risk of stalled progress.",
          "Leveraging incremental progress may improve continuity and stakeholder confidence during complex efforts."
        ],
        "tags": [
          "Microsoft Copilot",
          "Copilot",
          "productivity",
          "small wins",
          "momentum",
          "goals",
          "projects",
          "workouts"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights how the Dell PowerEdge R770AP server, powered by Intel® Xeon® 6 processors, delivers the precision and speed needed for high-frequency trading. It emphasizes that these capabilities enable hundreds of trades in seconds to help maximize gains and minimize losses and frames Intel Xeon 6 CPUs as shaping the future of finance.",
        "bullets": [
          "Focuses on high-frequency trading where every second counts.",
          "Showcases the Dell PowerEdge R770AP server with Intel® Xeon® 6 processors.",
          "Highlights precision and speed enabling hundreds of trades in seconds.",
          "Positions Intel Xeon 6 CPUs as defining the future of finance.",
          "Points viewers to Intel Business resources and subscription links."
        ],
        "takeaways": [
          "For HFT workloads, consider evaluating server platforms like the Dell PowerEdge R770AP paired with Intel Xeon 6 CPUs for their stated precision and speed.",
          "Prioritize CPU and server configurations that vendors present as optimized for rapid, high-throughput trading operations.",
          "Leverage Intel Business resources and vendor guidance when planning or scaling finance-focused infrastructure."
        ],
        "tags": [
          "high-frequency trading",
          "Intel Xeon 6",
          "Dell PowerEdge R770AP",
          "finance",
          "low-latency",
          "servers",
          "data center",
          "Intel Business"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The creative spark was out, and Copilot brought it back to life. Viewers are invited to download Copilot and try it via the link in the bio.",
        "bullets": [
          "Copilot revived a lost creative spark, per the description.",
          "Call to action: download Copilot and try it yourself.",
          "Download link referenced is located in the video's bio.",
          "No transcript was available for this video."
        ],
        "takeaways": [
          "If teams face creative or ideation roadblocks, consider a small Copilot pilot to see if it helps restore creative momentum.",
          "Use the link-in-bio call to action as an easy entry point for trialing Copilot with a limited user group.",
          "Collect user feedback and basic usage metrics during any trial to determine relevance for operational or planning workflows before wider rollout."
        ],
        "tags": [
          "Copilot",
          "creativity",
          "download",
          "link-in-bio",
          "try-it",
          "Microsoft",
          "creative-tool",
          "call-to-action"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video showcases the open-world martial arts RPG Where Winds Meet running with DLSS 4 and Multi Frame Generation. It invites viewers to experience the title with #RTXOn and credits the footage to @DigitalDreamsyt.",
        "bullets": [
          "Open-world martial arts RPG: Where Winds Meet",
          "Showcases DLSS 4 with Multi Frame Generation",
          "Promotes experiencing the game with #RTXOn",
          "Footage credited to @DigitalDreamsyt"
        ],
        "takeaways": [
          "If you host or provision game workloads, verify support for DLSS 4 and Multi Frame Generation on your GPU instances.",
          "For cloud gaming or visualization services, ensure availability of RTX-capable hardware and up-to-date drivers to enable #RTXOn features.",
          "Consider content delivery and creator partnership workflows when distributing footage or marketing assets credited to creators like @DigitalDreamsyt.",
          "If validating compatibility, test Where Winds Meet specifically for DLSS 4 + Multi Frame Generation behavior on your stack."
        ],
        "tags": [
          "Where Winds Meet",
          "DLSS4",
          "Multi Frame Generation",
          "RTXOn",
          "open-world",
          "martial-arts",
          "RPG",
          "DigitalDreamsyt"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This YouTube video is titled \"Taha Khalifa (Intel) | Intel Business\" and is hosted on the Intel Business channel. The description encourages viewers to subscribe and provides links to Intel Business resources and social channels, noting the channel offers resources, guidance, and expert insights for IT projects from data centers to devices.",
        "bullets": [
          "Video title: \"Taha Khalifa (Intel) | Intel Business\" on the Intel Business YouTube channel.",
          "Description includes a subscribe link for Intel Business.",
          "About section states the channel provides resources, guidance, and expert insights for IT projects spanning data centers to devices.",
          "Connect links provided: Intel Business website, X (Twitter), LinkedIn, and Facebook.",
          "Direct channel link included: https://www.youtube.com/intelbusiness"
        ],
        "takeaways": [
          "Intel Business positions itself as a resource hub relevant to data center and device decision-makers.",
          "Visit the Intel Business website for detailed IT-center resources and guidance.",
          "Following Intel Business on social platforms can help you stay current with expert insights for IT projects.",
          "Subscribe to the channel to receive ongoing updates and content related to IT and data center topics."
        ],
        "tags": [
          "Intel",
          "Intel Business",
          "Taha Khalifa",
          "IT",
          "Data Center",
          "Devices",
          "IT Projects",
          "YouTube",
          "Subscribe"
        ]
      }
    },
    {
      "id": "kSocjh8PZnQ",
      "title": "Rynek dóbr luksusowych w obliczu transformacji | Andrzej Marczak, Tomasz Wiśniewski",
      "channel": "KPMG Poland",
      "published_at": "2026-01-13T10:23:31.000Z",
      "url": "https://www.youtube.com/watch?v=kSocjh8PZnQ",
      "thumbnail": "https://i.ytimg.com/vi/kSocjh8PZnQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The KPMG ON AIR episode reviews shifts shaping the luxury goods market: rising emphasis on experiences and personalization, growing importance of ESG and \"affordable luxury,\" and Poland’s resilience despite global declines. Hosts Andrzej Marczak and Tomasz Wiśniewski discuss trends from luxury fatigue and market concentration to Gen Z preferences, luxury tourism and art, and future drivers such as AI and craftsmanship.",
        "bullets": [
          "Experience-led luxury and personalization are becoming central, with Gen Z prioritizing experiences over ownership.",
          "ESG and responsible-luxury practices (e.g., eco-leathers, certifications) are increasing in importance.",
          "‘Affordable luxury’ and aspirational consumers are expanding product categories beyond traditional clientele.",
          "Market concentration: the wealthiest ~2% account for roughly 40% of the luxury market.",
          "Poland’s luxury market is growing but fragmented; notable areas include hotels, spas, tourism, and the contemporary art scene; AI and craftsmanship highlighted as future influences."
        ],
        "takeaways": [
          "Growing luxury tourism, premium hotels and hospitality projects in Poland could drive localized demand for reliable power and connectivity—evaluate capacity planning in resort and urban luxury clusters.",
          "Emphasis on experiential and personalized services, plus mentions of AI, suggests rising need for low-latency compute and edge infrastructure—consider edge deployments and performance SLAs.",
          "ESG and certification trends mean luxury operators may prefer energy-efficient, sustainably powered facilities—prioritize renewable sourcing and green building credentials.",
          "Concentration of high-value customers and premium projects presents opportunities for differentiated, premium-tier data center and colocation services in affluent regions."
        ],
        "tags": [
          "luksus",
          "ESG",
          "affordable-luxury",
          "personalizacja",
          "Gen-Z",
          "Polska",
          "turystyka-luksusowa",
          "AI",
          "sztuka",
          "hotelarstwo"
        ]
      }
    }
  ]
}