{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-26T15:51:02.927Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "WiPpgBvul5Q",
      "title": "Microsoft SQL Server Innovation on AWS | Let's Talk About Data",
      "channel": "AWS Events",
      "published_at": "2026-01-26T15:25:39.000Z",
      "url": "https://www.youtube.com/watch?v=WiPpgBvul5Q",
      "thumbnail": "https://i.ytimg.com/vi/WiPpgBvul5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this session covers the latest Microsoft SQL Server innovations on AWS, highlighting RDS for SQL Server updates announced at re:Invent 2025—Developer Edition support, M7i/R7i instance support with optimized CPU, and expanded storage up to 256 TiB. It also reviews SQL Server 2025 on EC2, new cost‑optimization, storage, compute and tooling features, and demos performance gains on the latest generation instances.",
        "bullets": [
          "RDS for SQL Server adds Developer Edition support.",
          "New M7i and R7i instance support with optimized CPU.",
          "Expanded RDS storage options up to 256 TiB.",
          "SQL Server 2025 release and related EC2 cost, storage, compute and tooling features.",
          "Live demo showing SQL Server performance gains on latest generation instances."
        ],
        "takeaways": [
          "Developer Edition support and licensing changes can reduce Microsoft licensing costs for dev/test environments.",
          "Support for up to 256 TiB on RDS affects capacity planning and may enable larger DB consolidation to cloud.",
          "M7i/R7i instance support and demoed performance gains suggest evaluating latest‑gen instances for workload migration or consolidation.",
          "Availability of SQL Server 2025 on EC2 plus new tooling gives teams more modernization choices between managed RDS and self‑managed EC2 deployments."
        ],
        "tags": [
          "AWS",
          "RDS",
          "SQL Server",
          "SQLServer2025",
          "EC2",
          "reInvent2025",
          "M7i",
          "R7i",
          "DeveloperEdition",
          "256TiB"
        ]
      }
    },
    {
      "id": "9vS5kvxbPMQ",
      "title": "My Porta-Potty Business Brings In $4.3M/Year",
      "channel": "CNBC Make It",
      "published_at": "2026-01-24T15:00:30.000Z",
      "url": "https://www.youtube.com/watch?v=9vS5kvxbPMQ",
      "thumbnail": "https://i.ytimg.com/vi/9vS5kvxbPMQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Daniel Tom, 31, owns Bay Area Sanitation, which operates nearly 2,000 portable toilets servicing construction sites and events across the San Francisco Bay Area. The company reported $4.3 million in total income in 2025 and the clip was produced by CNBC Make It.",
        "bullets": [
          "Owner: Daniel Tom, 31, runs Bay Area Sanitation.",
          "Fleet size: almost 2,000 portable toilets.",
          "Service area: construction sites and events across the San Francisco Bay Area.",
          "2025 revenue: $4.3 million in total income.",
          "Video produced by CNBC Make It (Produced/Shot/Edited by Mickey Todiwala)."
        ],
        "takeaways": [
          "Scale matters: a large, dedicated fleet can support high-volume, recurring site needs—relevant when evaluating service providers.",
          "Local coverage: vendors focused on a specific region (Bay Area) can offer faster response and logistics for nearby facilities.",
          "Revenue signal: multi-million annual income can indicate operational stability and capacity when selecting contractors.",
          "Specialized providers: consider specialized sanitation vendors for construction- or event-related support to reduce internal burden."
        ],
        "tags": [
          "Daniel Tom",
          "Bay Area Sanitation",
          "porta-potty",
          "portable toilets",
          "sanitation",
          "small business",
          "entrepreneurship",
          "CNBC Make It",
          "revenue",
          "2025"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, route planning is made easy as Jo discovers the power of Copilot Groups. The short video highlights Copilot Groups within Microsoft Copilot as a tool for simplifying route planning.",
        "bullets": [
          "Route planning is the focus and is described as made easy.",
          "Video centers on 'Copilot Groups' as the enabling feature.",
          "A character named Jo discovers the power of Copilot Groups.",
          "Description includes hashtags: #copilot #microsoftcopilot #ai"
        ],
        "takeaways": [
          "If your operations include route planning, Copilot Groups may offer ways to simplify those workflows.",
          "Decision-makers should consider evaluating Copilot Groups for planning and coordination use cases.",
          "Short, focused demos like this can help communicate potential value to operational teams."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "copilot-groups",
          "route-planning",
          "logistics",
          "planning",
          "productivity",
          "operations"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… KPMG Poland directors Katarzyna Chojniak and Alicja Barska explain how AI is already embedded in audit work, using tools like an AI Transaction Scoring Tool, Clara AI conversational assistants and the KPMG Clara platform to analyze full populations, manage audits in real time and improve client communication. They also address how these technologies change auditors' roles, required competencies, implementation challenges, data security and regulatory issues, potential risks and future directions.",
        "bullets": [
          "AI tools (Transaction Scoring, Clara AI and specialized agents) enable analysis of full data populations and automate repetitive tasks.",
          "KPMG Clara and Clara for Clients support real-time audit management and modern client communication.",
          "Shift from sampling to full-population analysis changes evidence gathering and decision-making in audits.",
          "Auditors must develop new competencies; organisations face adoption challenges when implementing AI.",
          "Data security, regulatory environment and AI-related risks are key considerations."
        ],
        "takeaways": [
          "Expect audits to use full-population datasets—ensure your systems can provide complete, high-quality data for AI analysis.",
          "Real-time, continuous audit platforms may require more frequent data access and tighter collaboration with auditors.",
          "Prioritise data security and regulatory compliance when sharing operational and financial data with AI-enabled audit tools.",
          "Invest in staff skills and internal processes to engage effectively with AI-driven audit workflows and client-facing platforms."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMG",
          "KPMG Clara",
          "Clara AI",
          "transaction-scoring",
          "audit-innovation",
          "data-security",
          "regulation",
          "full-population-analysis"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield has officially launched and the trailer highlights NVIDIA DLSS 4 with Multi Frame Generation. The footage was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 Multi Frame Generation 4X Mode, and the game is described as a 3D real-time strategy RPG where you play the Endministrator of Endfield Industries.",
        "bullets": [
          "Official launch of Arknights: Endfield, a 3D real-time strategy RPG.",
          "Trailer features NVIDIA DLSS 4 with Multi Frame Generation (4X Mode).",
          "Captured on GeForce RTX 5080 at 4K Ultra settings.",
          "Game setting: Talos-II, role of the Endministrator of Endfield Industries.",
          "Links provided for game site and social channels."
        ],
        "takeaways": [
          "DLSS 4 Multi Frame Generation is being used in a commercial game release—relevant when evaluating modern real-time rendering toolchains.",
          "Footage captured on an RTX 5080 at 4K Ultra with DLSS4 4X Mode signals reliance on high-end GPU capabilities for showcase content.",
          "Support for DLSS4/Multi Frame Generation should be considered when planning hardware, drivers, and software stacks for high-resolution interactive or cloud-rendered workloads.",
          "Testing DLSS4 modes for image quality and resource implications is advisable for deployments targeting 4K real-time content."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "RTX5080",
          "NVIDIA",
          "GeForce",
          "4K",
          "MultiFrameGeneration",
          "RTS",
          "Endfield"
        ]
      }
    }
  ]
}