{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-18T19:36:42.145Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "6L86-OnOXV0",
      "title": "How I Built A $1M/Year Business - And Helped My Parents Retire",
      "channel": "CNBC Make It",
      "published_at": "2026-01-17T15:00:09.000Z",
      "url": "https://www.youtube.com/watch?v=6L86-OnOXV0",
      "thumbnail": "https://i.ytimg.com/vi/6L86-OnOXV0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Tuan Le emigrated from Vietnam to Toronto and vowed at 15 to help his parents retire. Ten years later his social video production company, ShortsCut, generates over $1 million USD a year in sales, and he now covers his parents' rent and living expenses so they no longer work full time.",
        "bullets": [
          "Tuan Le emigrated from Vietnam to Toronto and made a personal vow at age 15 to support his parents' retirement.",
          "He founded ShortsCut, a social video production company.",
          "ShortsCut brings in over $1 million USD per year in sales.",
          "Le now pays his parents' rent and living expenses so they no longer work full time.",
          "Video produced by CNBC Make It with credited production team and additional footage."
        ],
        "takeaways": [
          "Demand for scalable video production translates into significant digital workload — plan infrastructure capacity for growth in video-heavy services.",
          "High-revenue creator-driven businesses need reliable, cost-predictable hosting and delivery to maintain operations and growth.",
          "Supporting mission-driven founders can produce stable long-term customers; reliability and responsive service are key retention factors."
        ],
        "tags": [
          "Tuan Le",
          "ShortsCut",
          "CNBC Make It",
          "entrepreneurship",
          "creator economy",
          "social video",
          "small business",
          "immigrant success",
          "family support",
          "million-dollar business"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This giant bubble of carbon dioxide is presented as a battery that can store 20 megawatts of energy and provide about eight hours of storage. The description frames the technology as a way to smooth fluctuating renewable output and help power the global shift to clean energy.",
        "bullets": [
          "Giant CO2 bubble functions as an energy storage battery.",
          "Stores 20 megawatts of energy and offers roughly eight hours of storage.",
          "Aims to address the intermittency of renewable energy resources.",
          "Positioned as a tool to support the global transition to clean energy."
        ],
        "takeaways": [
          "Offers multi-hour, megawatt-scale storage that could provide sustained backup or load shifting for grids and large facilities.",
          "Can help integrate variable renewable generation by storing excess output and releasing it during shortfalls.",
          "Worth evaluating for long-duration energy resiliency and decarbonization planning given its stated 8-hour capability."
        ],
        "tags": [
          "CO2 battery",
          "carbon dioxide",
          "energy storage",
          "8-hour storage",
          "20 MW",
          "renewable energy",
          "grid storage",
          "clean energy",
          "IEEE Spectrum",
          "innovation"
        ]
      }
    },
    {
      "id": "OINppmPan0o",
      "title": "Figure Skating | Making Team USA presented by Xfinity with Apolo Ohno",
      "channel": "Team USA",
      "published_at": "2026-01-16T19:30:36.000Z",
      "url": "https://www.youtube.com/watch?v=OINppmPan0o",
      "thumbnail": "https://i.ytimg.com/vi/OINppmPan0o/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, figure skating duo Vadym Kolesnik and Emilia Zingas sit down with Apolo Ohno on this episode of Making Team USA presented by Xfinity. The short interview, framed around the theme \"Built on trust,\" comes ahead of the Winter Olympics and is part of Team USA's #MTUSA content.",
        "bullets": [
          "Interview features Vadym Kolesnik and Emilia Zingas with Apolo Ohno.",
          "Theme emphasized in the description: \"Built on trust.\"",
          "Conversation is timely—positioned ahead of the Winter Olympics.",
          "Episode is part of Making Team USA presented by Xfinity.",
          "Published as Team USA content and tagged #MTUSA."
        ],
        "takeaways": [
          "Trust and teamwork are highlighted as foundational for high-stakes performance—valuable when designing teams or incident-response processes.",
          "Veteran mentorship (Apolo Ohno) is presented as a resource for readiness—consider formal mentorship programs to accelerate skill transfer.",
          "Timely storytelling around major events (e.g., the Olympics) can strengthen stakeholder engagement—plan communications to align with key milestones.",
          "Brand partnerships (Xfinity/Team USA) support content distribution—leverage strategic partnerships to amplify important messaging."
        ],
        "tags": [
          "figure skating",
          "Vadym Kolesnik",
          "Emilia Zingas",
          "Apolo Ohno",
          "Winter Olympics",
          "Making Team USA",
          "Xfinity",
          "MTUSA",
          "Team USA",
          "trust"
        ]
      }
    },
    {
      "id": "RalzsofAYHM",
      "title": "29-year-old spent $20,000 to open a store in New York — now it brings in $1.6 million a year",
      "channel": "CNBC Make It",
      "published_at": "2026-01-16T17:00:48.000Z",
      "url": "https://www.youtube.com/watch?v=RalzsofAYHM",
      "thumbnail": "https://i.ytimg.com/vi/RalzsofAYHM/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Abby Price founded Abbode while a graduate student at Parsons, selling dried floral arrangements on Facebook in 2019 and later opening a Nolita storefront by March 2022 selling bouquets and home decor. Store cashflow financed a $15,000 embroidery machine she bought \"on a total whim,\" which sat covered in dust in the shop's basement for a year.",
        "bullets": [
          "Price launched Abbode as a Parsons grad student, selling dried florals on Facebook in 2019.",
          "By March 2022 she operated a storefront in New York’s Nolita neighborhood.",
          "The shop sold bouquets and home decor.",
          "Cashflow from the storefront funded a $15,000 embroidery machine purchase.",
          "The embroidery machine remained unused in the shop’s basement for a year."
        ],
        "takeaways": [
          "Small retail operators may self-fund significant electrical equipment purchases (e.g., a $15,000 embroidery machine), which can create localized demand when brought online.",
          "Purchased equipment can remain idle for extended periods, so short-term load forecasts should account for delayed activation of new assets.",
          "Growth from online sales to a physical storefront illustrates how scaling a business can change local infrastructure needs.",
          "Unpredictable, on-a-whim capital expenditures by small businesses suggest the value of flexible grid capacity planning for micro-load variability."
        ],
        "tags": [
          "Abby Price",
          "Abbode",
          "Parsons School of Design",
          "dried florals",
          "Nolita",
          "embroidery machine",
          "small business",
          "retail storefront",
          "home decor",
          "Facebook sales"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… W podcaście KPMG ON AIR eksperci Monika Palmowska i Jakub Roszkiewicz omawiają, jak AI już zmienia podejście do cen transferowych — od monitorowania rentowności i analiz porównawczych po automatyzację dokumentacji. Poruszane są też ograniczenia i ryzyka (np. RODO, halucynacje, bezpieczeństwo danych), praktyczne kroki wdrożeniowe (integracja z ERP, uporządkowanie procesów) oraz rola bezpiecznych środowisk pracy z AI (Digital Gateway).",
        "bullets": [
          "AI wspiera monitorowanie rentowności i analizy porównawcze w cenach transferowych.",
          "Automatyzacja dokumentacji cen transferowych przyspiesza procesy, ale nie zastępuje doradców — raczej je wzmacnia.",
          "Ryzyka: ochrona danych, bezpieczeństwo, RODO oraz zjawisko 'halucynacji' modeli AI.",
          "Digital Gateway wskazany jako bezpieczne środowisko do pracy z AI.",
          "Wdrożenie: integracja z ERP, inteligentne benchmarki oraz uporządkowanie procesów jako fundament transformacji."
        ],
        "takeaways": [
          "Priorytet dla infrastruktury: zapewnić bezpieczne i zgodne z RODO środowisko do pracy z AI (np. Digital Gateway).",
          "Zadbaj o integrację ERP i stabilne kanały danych, by wykorzystać inteligentne benchmarki i analizy AI.",
          "Uporządkowanie i udokumentowanie procesów to warunek skutecznego wdrożenia AI.",
          "Planuj programy szkoleniowe — AI ma wzmacniać doradców i rozwijać kompetencje młodszych pracowników."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "podatki",
          "automatyzacja",
          "dokumentacja",
          "ERP",
          "bezpieczeństwo danych",
          "RODO",
          "Digital Gateway",
          "monitorowanie rentowności"
        ]
      }
    },
    {
      "id": "dGfcT63U7Mo",
      "title": "The 2026 U.S. Olympic Figure Skating Team 🇺🇸",
      "channel": "Team USA",
      "published_at": "2026-01-15T20:43:24.000Z",
      "url": "https://www.youtube.com/watch?v=dGfcT63U7Mo",
      "thumbnail": "https://i.ytimg.com/vi/dGfcT63U7Mo/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This video presents the U.S. Olympic figure skating lineup with an energetic, promotional tone (🔥). It is positioned for audiences following the Winter Olympics.",
        "bullets": [
          "Showcases the U.S. Olympic figure skating lineup.",
          "Description uses a fire emoji to convey excitement.",
          "Includes the #WinterOlympics hashtag to target Olympic audiences.",
          "Brief, promotional caption indicating highlight-style content."
        ],
        "takeaways": [
          "Content is Olympic-related—monitor traffic around Winter Olympics windows for potential increases in demand.",
          "Optimize CDN and caching for short, shareable highlight clips promoted via social tags.",
          "Ensure metadata and tag indexing (e.g., #WinterOlympics) are prioritized to capture trending searches.",
          "Track engagement on Olympic-tagged content to inform real-time capacity adjustments."
        ],
        "tags": [
          "winter-olympics",
          "figure-skating",
          "u-s-olympic-team",
          "olympic-lineup",
          "sports-highlights",
          "skating",
          "olympics",
          "lineup"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video urges viewers to keep momentum by stacking small wins with Copilot. It highlights using Copilot to maintain progress across workouts, projects, and personal goals.",
        "bullets": [
          "Encourages stacking small wins to sustain momentum.",
          "Positions Copilot as a tool to keep progress going.",
          "Applies to workouts, projects, and personal goals.",
          "Focuses on maintaining steady forward motion rather than big leaps."
        ],
        "takeaways": [
          "Use incremental wins to sustain long-term projects and avoid stalls.",
          "Leverage Copilot to help teams and individuals maintain steady progress on infrastructure or operational initiatives.",
          "Framing work as achievable small steps can improve consistency and completion rates for complex projects."
        ],
        "tags": [
          "Copilot",
          "momentum",
          "small-wins",
          "workouts",
          "projects",
          "personal-goals",
          "productivity",
          "motivation"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Intel presents the Dell PowerEdge R770AP server powered by Intel® Xeon® 6 processors as a platform built for the precision and speed required in high-frequency trading. The description states the system can perform hundreds of trades in seconds to help maximize gains and minimize losses, and positions Xeon 6 CPUs as defining the future of finance.",
        "bullets": [
          "Dell PowerEdge R770AP server equipped with Intel® Xeon® 6 processors",
          "Designed for high-frequency trading where precision and speed are critical",
          "Capable of performing hundreds of trades in seconds",
          "Aimed at helping maximize gains and minimize losses",
          "Positions Intel Xeon 6 CPUs as shaping the future of finance"
        ],
        "takeaways": [
          "For latency-sensitive trading, prioritize server platforms that emphasize precision and speed.",
          "The Dell PowerEdge R770AP with Intel Xeon 6 is presented as a candidate for environments executing hundreds of trades in seconds.",
          "Adopting high-performance CPU platforms can be framed as a way to help maximize gains and minimize losses in HFT contexts.",
          "Intel positions Xeon 6 performance as influential to the future direction of finance infrastructure."
        ],
        "tags": [
          "high-frequency-trading",
          "HFT",
          "Dell PowerEdge R770AP",
          "Intel Xeon 6",
          "low-latency",
          "finance",
          "servers",
          "data-center",
          "high-performance"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video says the creative spark was out and Copilot brought it back to life. It invites viewers to download Copilot and try it via the link in the bio.",
        "bullets": [
          "States Copilot revived a lost creative spark.",
          "Calls viewers to download Copilot via the link in bio.",
          "Published by Microsoft Copilot on 2026-01-14.",
          "No transcript available; only a brief promotional description is provided."
        ],
        "takeaways": [
          "The clip positions Copilot as a creativity tool — consider a short pilot to assess relevance for your teams.",
          "Use the promo CTA (link in bio) to obtain the tool for hands-on evaluation.",
          "Because the content is brief and promotional, seek out demos and documentation before any procurement decisions.",
          "Plan a focused internal trial to determine if Copilot fits existing workflows and collaboration processes."
        ],
        "tags": [
          "Copilot",
          "Microsoft Copilot",
          "creativity",
          "AI",
          "download",
          "promo",
          "link in bio",
          "2026",
          "short video"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This clip highlights the open-world martial arts RPG Where Winds Meet running with DLSS 4 and Multi Frame Generation and promoted with #RTXOn. The video is credited to @DigitalDreamsyt.",
        "bullets": [
          "Where Winds Meet — an open-world martial arts RPG.",
          "Showcases DLSS 4 with Multi Frame Generation.",
          "Promoted with #RTXOn (RTX-enabled visuals).",
          "Encourages experiencing the title with RTX on.",
          "Video credit: @DigitalDreamsyt."
        ],
        "takeaways": [
          "Presence of DLSS 4 and Multi Frame Generation signals workloads that leverage NVIDIA RTX and DLSS technologies.",
          "Grid and data center planners should verify GPU fleets support RTX/DLSS 4 features for accurate testing or hosting.",
          "Ensure drivers and NVIDIA SDKs for DLSS/RTX are maintained for compatibility with such demos.",
          "Consider evaluating real-time frame-generation performance for streaming or remote-rendering use cases."
        ],
        "tags": [
          "WhereWindsMeet",
          "DLSS4",
          "MultiFrameGeneration",
          "RTXOn",
          "OpenWorld",
          "MartialArtsRPG",
          "NVIDIA",
          "GeForce",
          "DigitalDreamsyt"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this Intel Business video features Taha Khalifa and directs viewers to Intel Business channels and resources. The channel offers resources, guidance, and expert insights for IT projects covering data centers to devices, with links to subscribe and connect.",
        "bullets": [
          "No transcript available for this video.",
          "Video title: Taha Khalifa (Intel) | Intel Business.",
          "Channel provides resources and expert guidance for IT projects from data centers to devices.",
          "Description includes links to subscribe and to Intel Business website and social channels.",
          "Focus is on connecting viewers with Intel Business resources and insights."
        ],
        "takeaways": [
          "Use the Intel Business website and channels as a centralized source for IT and data center guidance.",
          "Subscribe and follow Intel Business social accounts to receive updates and expert insights relevant to infrastructure projects.",
          "Leverage the provided resources when planning or executing data center and device-related IT initiatives."
        ],
        "tags": [
          "Intel",
          "Intel Business",
          "Taha Khalifa",
          "IT",
          "datacenter",
          "devices",
          "IT projects",
          "resources"
        ]
      }
    },
    {
      "id": "kSocjh8PZnQ",
      "title": "Rynek dóbr luksusowych w obliczu transformacji | Andrzej Marczak, Tomasz Wiśniewski",
      "channel": "KPMG Poland",
      "published_at": "2026-01-13T10:23:31.000Z",
      "url": "https://www.youtube.com/watch?v=kSocjh8PZnQ",
      "thumbnail": "https://i.ytimg.com/vi/kSocjh8PZnQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… W podcaście KPMG ON AIR eksperci KPMG (Andrzej Marczak i Tomasz Wiśniewski) omawiają aktualne trendy kształtujące rynek dóbr luksusowych: nacisk na doświadczenia, rosnące znaczenie ESG, zjawisko „affordable luxury”, personalizację oraz preferencje pokolenia Z. Poruszono też sytuację Polski (wzrost rynku mimo globalnych spadków, rozproszenie), znaczenie sztuki i turystyki oraz przyszłość sektora z uwzględnieniem AI i rzemiosła.",
        "bullets": [
          "Globalne trendy: „luxury fatigue”, doświadczenia ponad posiadanie, affordable luxury.",
          "Skupienie rynku: ~2% klientów odpowiada za 40% wartości rynku.",
          "Rosnąca rola personalizacji i ekskluzywnych doświadczeń oraz preferencje Pokolenia Z.",
          "ESG i odpowiedzialny luksus (ekoskóry, certyfikacje) jako kluczowy kierunek.",
          "Polska: rynek rośnie mimo globalnych spadków; uwzględnienie sztuki, turystyki i hoteli."
        ],
        "takeaways": [
          "ESG w centrum uwagi: planuj strategie zasilania i certyfikacji energetycznej, które odpowiadają na rosnące wymagania zrównoważonego rozwoju klientów branży luksusowej.",
          "Rosnące wykorzystanie AI i personalizacji wskazuje na zwiększone zapotrzebowanie na moc obliczeniową i niskolatencyjne usługi — rozważ skalowalność i gotowość na obciążenia związane z analityką i ML.",
          "Wzrost segmentów turystyki i luksusowych hoteli w Polsce może generować lokalne szczyty zapotrzebowania na energię i łączność — uwzględnij regionalne plany pojemności i redundancji.",
          "Dla operatorów centrów danych i sieci: integracja rozwiązań energooszczędnych i komunikowanie zgodności z ESG może stać się elementem przewagi konkurencyjnej przy pozyskiwaniu klientów z sektora luksusowego."
        ],
        "tags": [
          "luksus",
          "ESG",
          "AI",
          "personalizacja",
          "Polska",
          "turystyka",
          "rynek-luksusowy",
          "pokolenie-Z"
        ]
      }
    }
  ]
}