{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-18T18:51:05.193Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "6L86-OnOXV0",
      "title": "How I Built A $1M/Year Business - And Helped My Parents Retire",
      "channel": "CNBC Make It",
      "published_at": "2026-01-17T15:00:09.000Z",
      "url": "https://www.youtube.com/watch?v=6L86-OnOXV0",
      "thumbnail": "https://i.ytimg.com/vi/6L86-OnOXV0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, when he was 15 Tuan Le vowed to help his parents retire after his family emigrated from Vietnam to Toronto in 2015. Ten years later his social video production company, ShortsCut, brings in over $1 million USD a year and he now pays his parents' rent and living expenses so they no longer work full time.",
        "bullets": [
          "Tuan Le emigrated from Vietnam to Toronto in 2015 and vowed at 15 to help his parents retire.",
          "He founded ShortsCut, a social video production company.",
          "ShortsCut now generates over $1 million USD in annual sales.",
          "Le uses his business income to cover his parents' rent and living expenses so they no longer work full time.",
          "The story was produced by CNBC Make It."
        ],
        "takeaways": [
          "Digital video businesses can scale to seven-figure revenue quickly—expect growing demand for hosting, bandwidth, and content-delivery resources.",
          "Small, high-growth media firms may require elastic infrastructure; consider flexible, on-demand capacity and billing to support rapid scaling.",
          "Content production trends favor low-latency delivery and CDN/edge capacity to serve social/video audiences efficiently.",
          "Plan for a diverse customer base: successful SMB media clients can become steady, high-usage accounts that impact capacity and redundancy needs."
        ],
        "tags": [
          "Tuan Le",
          "ShortsCut",
          "social video",
          "video production",
          "entrepreneurship",
          "immigrant founder",
          "CNBC Make It",
          "Toronto",
          "family support",
          "$1M revenue"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… a giant bubble of carbon dioxide can store 20 megawatts of energy. The description says these new batteries are intended to help manage fluctuating renewable resources and support the global shift to clean energy.",
        "bullets": [
          "Giant CO2 bubble stores 20 megawatts of energy",
          "Presented as a new type of battery/storage solution",
          "Designed to address variability of renewable energy sources",
          "Framed as a tool to support the global clean-energy transition"
        ],
        "takeaways": [
          "20 MW storage capacity represents a potentially significant option for balancing renewable variability",
          "This CO2-based battery technology could be relevant for long-term decarbonization and resilience planning",
          "Grid and data-center planners should monitor development of this storage approach as an emerging option"
        ],
        "tags": [
          "ieee",
          "tech",
          "ieeespectrum",
          "innovation",
          "future",
          "futuristic",
          "energy",
          "battery"
        ]
      }
    },
    {
      "id": "OINppmPan0o",
      "title": "Figure Skating | Making Team USA presented by Xfinity with Apolo Ohno",
      "channel": "Team USA",
      "published_at": "2026-01-16T19:30:36.000Z",
      "url": "https://www.youtube.com/watch?v=OINppmPan0o",
      "thumbnail": "https://i.ytimg.com/vi/OINppmPan0o/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Built on trust, figure skating duo Vadym Kolesnik and Emilia Zingas sit down with Apolo Ohno ahead of the Winter Olympics on this week's episode of Making Team USA presented by Xfinity. The episode centers on their partnership and Olympic preparation.",
        "bullets": [
          "Theme: \"Built on trust\" in their skating partnership ⛸️",
          "Features: Vadym Kolesnik and Emilia Zingas",
          "Interviewer/guest: Apolo Ohno",
          "Timing: Conversation takes place ahead of the Winter Olympics",
          "Series/sponsor: Episode of Making Team USA presented by Xfinity"
        ],
        "takeaways": [
          "Highlight human elements like trust and teamwork in external communications to boost engagement with stakeholders.",
          "Showcasing preparation stories ahead of major events can build anticipation and visibility for teams or projects.",
          "Partnering with a recognizable sponsor (Xfinity) can extend reach and lend credibility to content.",
          "Short-form episodic content is a useful format for profiling teams and foregrounding relationships."
        ],
        "tags": [
          "Vadym Kolesnik",
          "Emilia Zingas",
          "Apolo Ohno",
          "Figure Skating",
          "Winter Olympics",
          "Making Team USA",
          "Xfinity",
          "Team USA",
          "MTUSA"
        ]
      }
    },
    {
      "id": "RalzsofAYHM",
      "title": "29-year-old spent $20,000 to open a store in New York — now it brings in $1.6 million a year",
      "channel": "CNBC Make It",
      "published_at": "2026-01-16T17:00:48.000Z",
      "url": "https://www.youtube.com/watch?v=RalzsofAYHM",
      "thumbnail": "https://i.ytimg.com/vi/RalzsofAYHM/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Abby Price started Abbode while a Parsons School of Design graduate student, selling dried floral arrangements on Facebook in 2019 and later opened a Nolita storefront after a $20,000 opening investment. Cashflow from the shop funded a $15,000 embroidery machine that sat in the basement for a year, and the business now generates $1.6 million in annual revenue.",
        "bullets": [
          "Founded Abbode as a Parsons grad student, selling dried floral arrangements on Facebook in 2019.",
          "Opened a Nolita storefront in March 2022 after spending $20,000 to open it.",
          "Shop cashflow financed a $15,000 embroidery machine bought “on a total whim.”",
          "The embroidery machine sat covered in dust in the shop’s basement for a year.",
          "The business now brings in $1.6 million in annual revenue."
        ],
        "takeaways": [
          "Rapid revenue growth from a modest $20K storefront investment to $1.6M/year indicates some retail/manufacturing customers can scale quickly — plan for flexible capacity options.",
          "Customer investments in equipment (a $15K embroidery machine) imply potential on-site power and space requirements that infrastructure providers should anticipate.",
          "Physical storefronts with production elements may demand reliable local utilities and predictable service levels.",
          "Cashflow-driven, opportunistic equipment purchases suggest demand for scalable, pay-as-you-grow commercial services."
        ],
        "tags": [
          "Abby Price",
          "Abbode",
          "Parsons School of Design",
          "Nolita",
          "small business",
          "retail",
          "embroidery machine",
          "dried flowers",
          "startup",
          "revenue"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… KPMG ON AIR episode explores how AI is already changing transfer pricing work—from monitoring profitability and benchmark analyses to automating transfer pricing documentation—while stressing that AI will strengthen, not replace, tax advisors. The podcast also covers implementation issues such as ERP integration, data/privacy risks (RODO, hallucinations), secure environments (Digital Gateway), upskilling younger staff, and recommended first steps including process standardization.",
        "bullets": [
          "AI use cases: profitability monitoring, comparative analyses, automation of documentation.",
          "AI seen as an augmentation tool for advisors, not a substitute.",
          "Implementation topics: ERP integration, intelligent benchmarks, and starting steps for deployment.",
          "Risks and governance: data security, privacy (RODO), and model hallucinations.",
          "Secure work environments (Digital Gateway) and process ordering are highlighted as foundations."
        ],
        "takeaways": [
          "Prioritize data governance and privacy compliance (RODO) when enabling AI tools to protect sensitive financial/tax data.",
          "Ensure secure environments (e.g., Digital Gateway or equivalent) before processing transfer-pricing data with AI.",
          "Plan technical integration (ERP and benchmarking systems) early to realize AI-driven monitoring and automation benefits.",
          "Treat AI as a force-multiplier: combine tool rollout with staff upskilling and clear advisor oversight.",
          "Start implementations by standardizing and documenting processes—this foundation is key to successful AI adoption."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "transfer pricing",
          "KPMG",
          "RODO",
          "Digital Gateway",
          "ERP integration",
          "automatyzacja",
          "monitoring rentowności",
          "podcast"
        ]
      }
    },
    {
      "id": "dGfcT63U7Mo",
      "title": "The 2026 U.S. Olympic Figure Skating Team 🇺🇸",
      "channel": "Team USA",
      "published_at": "2026-01-15T20:43:24.000Z",
      "url": "https://www.youtube.com/watch?v=dGfcT63U7Mo",
      "thumbnail": "https://i.ytimg.com/vi/dGfcT63U7Mo/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The video presents the U.S. Olympic figure skating lineup and uses an enthusiastic tone. It is explicitly positioned as Winter Olympics content.",
        "bullets": [
          "Announces a U.S. Olympic figure skating lineup",
          "Description conveys excitement (fire emoji)",
          "Includes the #WinterOlympics hashtag",
          "Focused on Olympic figure skating content"
        ],
        "takeaways": [
          "Classify this asset as Olympic sports content for tagging and search prioritization",
          "Apply Winter Olympics-related metadata and CDN caching rules to improve discoverability",
          "Monitor for increased traffic during Olympic event windows and lineup announcements"
        ],
        "tags": [
          "U.S. Olympic",
          "figure skating",
          "WinterOlympics",
          "Olympics",
          "lineup",
          "skating",
          "sports",
          "announcement"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Microsoft Copilot is presented as a tool to help users keep momentum across activities, from workouts to projects and personal goals. The messaging emphasizes stacking small wins to maintain steady progress.",
        "bullets": [
          "Frames Copilot as a companion for sustaining momentum across diverse tasks.",
          "Emphasizes incremental progress—'stacking small wins'—rather than one-time leaps.",
          "Applies to personal, fitness, and project-oriented contexts.",
          "High-level, motivational positioning without feature details."
        ],
        "takeaways": [
          "So what: The description positions Copilot as useful for sustaining progress—decision-makers can view it as a potential support for long-running initiatives.",
          "So what: Emphasis on incremental wins suggests value in workflows that depend on steady, repeatable progress rather than single events.",
          "So what: Grid/data center leaders may consider Copilot as a tool to explore for supporting phased projects or ongoing operational goals, but should validate fit with specific technical and integration requirements.",
          "So what: The description is high-level—conduct practical evaluations and pilot tests to confirm real-world benefits for your environment."
        ],
        "tags": [
          "Microsoft Copilot",
          "productivity",
          "momentum",
          "small wins",
          "goals",
          "projects",
          "workouts",
          "personal productivity",
          "AI assistant",
          "workflow"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights how the Dell PowerEdge R770AP server, powered by Intel® Xeon® 6 processors, delivers the precision and speed needed for high-frequency trading where trades execute in seconds. It positions Intel Xeon 6 CPUs as a high-performance option shaping the future of finance and points viewers to Intel Business for further IT resources.",
        "bullets": [
          "Focus on high-frequency trading (HFT) workloads where low latency matters.",
          "Showcases Dell PowerEdge R770AP equipped with Intel Xeon 6 processors.",
          "Claims precision and speed help maximize gains and minimize losses during rapid trades.",
          "Frames Intel Xeon 6 CPUs as defining high-performance computing for finance.",
          "Directs viewers to Intel Business for resources, guidance, and expert insights."
        ],
        "takeaways": [
          "Evaluate low-latency server platforms like the Dell PowerEdge R770AP with Intel Xeon 6 for HFT use cases.",
          "Prioritize CPU performance when assessing infrastructure that directly impacts trade execution speed and potential financial outcomes.",
          "Leverage Intel Business resources and guidance when planning or upgrading data center deployments for finance workloads."
        ],
        "tags": [
          "high-frequency-trading",
          "HFT",
          "Dell PowerEdge R770AP",
          "Intel Xeon 6",
          "low-latency",
          "finance",
          "data-center",
          "server-performance"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video states that Copilot revived a lost creative spark and encourages viewers to download and try Copilot via the link in the creator's bio. No transcript is available for further details.",
        "bullets": [
          "Copilot is credited with bringing back creative spark.",
          "Clear call to action to download and try Copilot.",
          "Download link provided in the creator's bio.",
          "No transcript is available for the video."
        ],
        "takeaways": [
          "If enhancing creative ideation is relevant to your grid/data center teams, consider testing Copilot to evaluate fit.",
          "Use the link in bio to initiate a quick trial and gather user feedback from engineering or operations staff.",
          "Assess whether Copilot-driven ideation produces actionable ideas for design, troubleshooting, or process improvements."
        ],
        "tags": [
          "Microsoft Copilot",
          "Copilot",
          "creativity",
          "creative spark",
          "download",
          "link-in-bio",
          "try Copilot",
          "promotion"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video showcases the open-world martial arts RPG Where Winds Meet running with NVIDIA technologies — DLSS 4 with Multi Frame Generation and #RTXOn. The clip is credited to @DigitalDreamsyt.",
        "bullets": [
          "Features the game Where Winds Meet (open-world martial arts RPG)",
          "Highlights DLSS 4 with Multi Frame Generation",
          "Promotes #RTXOn (ray tracing enabled)",
          "Video credit: @DigitalDreamsyt"
        ],
        "takeaways": [
          "Use of DLSS 4 and Multi Frame Generation indicates reliance on NVIDIA graphics technologies — ensure availability of hardware that supports these features when planning deployments.",
          "The #RTXOn tag suggests ray-tracing features may be utilized — consider GPUs with ray-tracing acceleration for fidelity parity in testing or hosting.",
          "Confirm driver and SDK compatibility for DLSS 4/Multi Frame Generation in your software stack before rolling out or benchmarking workloads.",
          "For cloud gaming or remote-rendering scenarios, evaluate potential impacts on GPU provisioning and streaming performance due to DLSS 4/MFG-enabled rendering."
        ],
        "tags": [
          "Where Winds Meet",
          "DLSS4",
          "MultiFrameGeneration",
          "RTXOn",
          "open-world",
          "martial-arts",
          "NVIDIA",
          "GeForce",
          "DigitalDreamsyt"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this Intel Business video features Taha Khalifa. The Intel Business channel provides IT information—from data centers to devices—and offers resources, guidance, and expert insights to help IT projects get done.",
        "bullets": [
          "Video title: Taha Khalifa (Intel) | Intel Business (no transcript provided).",
          "Intel Business covers topics spanning data centers to devices.",
          "Channel promises resources, guidance, and expert insights for IT projects.",
          "Subscribe link and Intel Business website are included in the description.",
          "Social links provided: X, LinkedIn, and Facebook for additional connection."
        ],
        "takeaways": [
          "Intel Business is a source of resources and expert guidance relevant to data center and device decisions.",
          "Decision-makers can use the channel and website to find materials to support IT project planning and execution.",
          "Subscribing and following the listed social channels helps stay updated on Intel’s IT content and insights."
        ],
        "tags": [
          "Intel",
          "Intel Business",
          "Taha Khalifa",
          "IT",
          "data centers",
          "devices",
          "IT projects",
          "resources",
          "expert insights",
          "subscribe"
        ]
      }
    },
    {
      "id": "kSocjh8PZnQ",
      "title": "Rynek dóbr luksusowych w obliczu transformacji | Andrzej Marczak, Tomasz Wiśniewski",
      "channel": "KPMG Poland",
      "published_at": "2026-01-13T10:23:31.000Z",
      "url": "https://www.youtube.com/watch?v=kSocjh8PZnQ",
      "thumbnail": "https://i.ytimg.com/vi/kSocjh8PZnQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… KPMG ON AIR hosts Andrzej Marczak and Tomasz Wiśniewski discuss current drivers of the luxury goods market—emphasis on experiential luxury, ESG and “affordable luxury”—and why Poland’s market is still growing despite global declines. The episode covers consumer segments (top spenders, aspirational buyers, Gen Z), personalization, luxury in hospitality and arts, and future themes such as AI and craftsmanship.",
        "bullets": [
          "Trend toward experience-driven luxury and ‘affordable luxury’ alongside traditional high-end demand.",
          "ESG and responsible-luxury practices (e.g., eco-leathers, certifications) gaining importance.",
          "Top 2% of customers account for ~40% of the market; aspirational consumers and Gen Z shift demand.",
          "Poland’s luxury market is growing but fragmented; local art, hotels and premium tourism highlighted.",
          "Future-facing topics include personalization, AI, and preserving craftsmanship/human dimension."
        ],
        "takeaways": [
          "Experience-driven and personalized luxury (noted in the episode) implies rising demand for low-latency, reliable digital services—consider capacity and edge placement strategies.",
          "References to AI and personalization suggest increasing compute and storage needs—evaluate GPU/accelerator capacity and scalable infrastructure.",
          "ESG emphasis in luxury points to priority for energy-efficient data center design, renewable energy sourcing and transparent sustainability reporting.",
          "Poland’s growing but dispersed luxury ecosystem (hotels, tourism, art) underscores value of local capacity and resilient connectivity to serve regional premium customers."
        ],
        "tags": [
          "luxury",
          "ESG",
          "AI",
          "personalization",
          "Poland",
          "affordable-luxury",
          "luxury-tourism",
          "KPMG",
          "art-market",
          "experience-economy"
        ]
      }
    }
  ]
}