{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-31T13:14:46.514Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "6B29VDvPPzc",
      "title": "Build Knowledge Graph-powered AI Agents For Your Use Case | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-31T06:10:50.000Z",
      "url": "https://www.youtube.com/watch?v=6B29VDvPPzc",
      "thumbnail": "https://i.ytimg.com/vi/6B29VDvPPzc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This session demonstrates how to automatically build a knowledge graph from raw documents and connect it to an AI agent so the agent can understand your business. The talk emphasizes no graph expertise is required and includes an end-to-end build demo.",
        "bullets": [
          "Knowledge graphs address the problem of AI agents not understanding company-specific information.",
          "The session shows building a knowledge graph automatically from raw documents.",
          "The graph is connected to an AI agent so the agent can understand your business.",
          "No graph-query or graph-theory expertise required to follow the workflow.",
          "An end-to-end demo is presented; a prior episode compares VectorDB vs GraphDB for Gen AI agents."
        ],
        "takeaways": [
          "If you need AI agents that understand your organization, knowledge graphs can be built automatically from your documents.",
          "Automated graph construction reduces reliance on specialized graph-query expertise.",
          "An end-to-end demo is provided to evaluate how such a solution might be integrated or deployed."
        ],
        "tags": [
          "knowledge-graph",
          "AI-agents",
          "graph-database",
          "vector-database",
          "enterprise-AI",
          "databases-for-AI",
          "AWS-Events",
          "document-automation",
          "end-to-end-demo"
        ]
      }
    },
    {
      "id": "z-X9MYi1Rr0",
      "title": "Leveraging tax credits and incentives for sustainability projects",
      "channel": "PwC US",
      "published_at": "2026-01-30T13:27:25.000Z",
      "url": "https://www.youtube.com/watch?v=z-X9MYi1Rr0",
      "thumbnail": "https://i.ytimg.com/vi/z-X9MYi1Rr0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Randa Barsoum of PwC US highlights that energy tax credits are only part of the sustainability-incentive picture and that less obvious options can also provide meaningful value. She points to state and local abatements, location-based incentives, and R&D tax credits tied to innovation in packaging or processes, with the key message that a broader view of tax opportunities can unlock value from sustainability investments.",
        "bullets": [
          "Energy incentives are important but not the whole story.",
          "State and local abatements can support sustainability projects.",
          "Location-based incentives influence site and investment decisions.",
          "R&D tax credits apply to innovation efforts like reimagining packaging or processes.",
          "Viewing sustainability investments through a broader tax lens can unlock meaningful value."
        ],
        "takeaways": [
          "Factor state and local abatements and location-based incentives into site-selection and investment models to lower lifecycle costs.",
          "Assess eligible R&D tax credits when pursuing process or product innovations linked to sustainability.",
          "Expand tax strategy beyond energy credits to capture a wider set of incentives that improve project returns.",
          "Coordinate sustainability planning with tax and finance teams to identify and document incentive eligibility."
        ],
        "tags": [
          "sustainability",
          "tax-credits",
          "incentives",
          "r&d-credits",
          "state-local-abatements",
          "location-incentives",
          "sustainability-finance",
          "data-centers",
          "grid",
          "PwC"
        ]
      }
    },
    {
      "id": "oQtkaHzUYlY",
      "title": "Copilot helps Christa find her inner star 🌟",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-29T18:33:49.000Z",
      "url": "https://www.youtube.com/watch?v=oQtkaHzUYlY",
      "thumbnail": "https://i.ytimg.com/vi/oQtkaHzUYlY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the short video frames Copilot as helping Christa \"find the star within,\" using a starry-sky metaphor to convey personal empowerment. It closes with a clear call to action to download and try Copilot via the link in the bio.",
        "bullets": [
          "No transcript available; summary relies on the provided description.",
          "Uses a starry-sky metaphor to position Copilot as enabling inner potential.",
          "Centers on a personal, uplifting message focused on an individual (Christa).",
          "Ends with a direct call to action: download and try Copilot (link in bio)."
        ],
        "takeaways": [
          "The messaging is consumer- and user-focused—expect marketing to drive interest and user expectations.",
          "A direct download call-to-action implies easy access for trials—consider arranging internal pilot evaluations.",
          "Emphasis on personal empowerment suggests users will value intuitive, supportive UX—prioritize usability and training in evaluations.",
          "Marketing visibility may increase internal demand for Copilot—plan for license, integration, and support assessments before rollout."
        ],
        "tags": [
          "Microsoft Copilot",
          "Copilot",
          "Christa",
          "AI assistant",
          "personal empowerment",
          "download",
          "marketing",
          "video"
        ]
      }
    },
    {
      "id": "BYtYm-xyKR8",
      "title": "Bringing In $251K A Year With 3 Jobs In The Bay Area",
      "channel": "CNBC Make It",
      "published_at": "2026-01-29T17:47:46.000Z",
      "url": "https://www.youtube.com/watch?v=BYtYm-xyKR8",
      "thumbnail": "https://i.ytimg.com/vi/BYtYm-xyKR8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Naseema McElroy, 44, is a labor and delivery nurse in Brentwood, California who runs a personal finance brand and—by working three jobs in the Bay Area—brings in $251K a year. After accumulating nearly $1 million in debt in 2015, she started Financially Intentional to document her debt-payoff journey and was debt-free by 2017.",
        "bullets": [
          "Earns $251K/year through three jobs in the Bay Area.",
          "44-year-old labor and delivery nurse with a personal finance brand.",
          "Had nearly $1M in debt in 2015.",
          "Started Financially Intentional to document her debt payoff.",
          "Achieved debt-free status by 2017; featured in CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "Diversified income streams can substantially increase overall revenue—consider multiple revenue sources for financial resilience.",
          "Transparent storytelling and documenting a journey can be a viable way to build a personal or company brand.",
          "Disciplined financial management can produce rapid improvement in balance sheets, even after large liabilities.",
          "Profiles of high earners in expensive regions (e.g., Bay Area) highlight the potential payoff of combining professional work with entrepreneurial efforts."
        ],
        "tags": [
          "Naseema McElroy",
          "Financially Intentional",
          "debt payoff",
          "personal finance",
          "labor and delivery nurse",
          "Bay Area",
          "multiple jobs",
          "CNBC Make It",
          "Millennial Money",
          "debt-free 2017"
        ]
      }
    },
    {
      "id": "t6y2cVNjCAw",
      "title": "GeForce Garage - Summer of RTX Community Build",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-29T14:01:25.000Z",
      "url": "https://www.youtube.com/watch?v=t6y2cVNjCAw",
      "thumbnail": "https://i.ytimg.com/vi/t6y2cVNjCAw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video highlights the winning entry of NVIDIA's Summer of RTX r/buildapc Community Build Contest by u/JeffersonPutnam: a small-form-factor PC built around a GeForce RTX 5090 Founders Edition. The host Dwight walks through the SFF build and the full parts list including a Fractal Design Era 2 chassis, Ryzen 7 9800X3D CPU, MSI MPG B850I Edge motherboard, 32GB DDR5-6000, Corsair SF1000 PSU, and Corsair Nautilus 240 RS AIO.",
        "bullets": [
          "Winner: u/JeffersonPutnam’s SFF GeForce RTX 5090 rig from the Summer of RTX community contest.",
          "Chassis: Fractal Design Era 2 (small form factor).",
          "GPU: GeForce RTX 5090 Founders Edition.",
          "Key components: Ryzen 7 9800X3D, MSI MPG B850I Edge, 32GB Teamgroup T-Create DDR5-6000.",
          "Power/cooling: Corsair SF1000 SFX PSU and Corsair Nautilus 240 RS AIO."
        ],
        "takeaways": [
          "The build pairs a flagship RTX 5090 with an SFX-grade Corsair SF1000 and a 240mm AIO, so power delivery and cooling should be a primary compatibility check for compact deployments.",
          "Using an MSI MPG B850I Edge and the Fractal Era 2 highlights motherboard and chassis form-factor constraints when integrating large GPUs into SFF systems—verify physical and connector compatibility.",
          "The system uses a modern DDR5 platform (32GB DDR5-6000) and a Ryzen 7 9800X3D CPU, indicating contemporary consumer hardware stacks that may affect memory and BIOS support considerations.",
          "This is a community showcase of a consumer Founders Edition GPU in a compact build—factor procurement and single-slot/dual-slot GPU form factors into planning for scaled deployments."
        ],
        "tags": [
          "GeForceRTX5090",
          "SFF",
          "SmallFormFactor",
          "GeForceGarage",
          "BuildAPC",
          "NVIDIA",
          "Ryzen9800X3D",
          "DDR5",
          "CorsairSF1000"
        ]
      }
    },
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy GenAI solutions, unlocking entirely new revenue streams while streamlining operations. Sreeni Alakappan, VP of App Development and Automation at TTEC, highlights that Google Cloud's infrastructure and consulting compressed their digital transformation timeline and boosted developer productivity.",
        "bullets": [
          "TTEC worked with Google Cloud Consulting to accelerate AI prototyping and deployment.",
          "The engagement focused on GenAI and leveraging Google Cloud's robust infrastructure.",
          "Efforts enabled new revenue streams in addition to operational improvements.",
          "Developer productivity was increased through the deployed solutions and tooling.",
          "Google Cloud Consulting helped compress TTEC’s digital transformation timeline."
        ],
        "takeaways": [
          "Prepare infrastructure to support accelerated GenAI prototyping and production workloads.",
          "Scalable cloud infrastructure can be a lever to shorten transformation timelines and speed time-to-market.",
          "Improving developer productivity via platform and tooling investments reduces operational friction.",
          "Meeting increased AI deployment demand may require more flexible capacity planning and managed services.",
          "New revenue opportunities from AI can justify targeted investments in cloud and data center capabilities."
        ],
        "tags": [
          "googlecloud",
          "ttec",
          "genai",
          "aideployment",
          "operational-efficiency",
          "customer-experience",
          "googlecloudplatform",
          "generativeai"
        ]
      }
    }
  ]
}