{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-30T17:07:03.342Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "z-X9MYi1Rr0",
      "title": "Leveraging tax credits and incentives for sustainability projects",
      "channel": "PwC US",
      "published_at": "2026-01-30T13:27:25.000Z",
      "url": "https://www.youtube.com/watch?v=z-X9MYi1Rr0",
      "thumbnail": "https://i.ytimg.com/vi/z-X9MYi1Rr0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Randa Barsoum, Tax Partner at PwC US, highlights that energy tax credits are only part of the picture and draws attention to less obvious incentives—such as state and local abatements, location-based incentives, and R&D tax credits tied to innovation like reimagining packaging or processes. The core message: viewing sustainability investments through a broader tax lens can unlock meaningful tax value.",
        "bullets": [
          "Energy incentives are common but not the only tax opportunities for sustainability projects.",
          "State and local abatements can support sustainability initiatives.",
          "Location-based incentives may provide additional tax value tied to where projects are sited.",
          "R&D tax credits can apply to innovation efforts, including reimagining packaging or processes.",
          "A broader tax perspective can turn sustainability investments into meaningful tax value."
        ],
        "takeaways": [
          "Don’t limit assessments to energy credits—also evaluate state and local abatements and location-based incentives when planning projects.",
          "Include potential R&D tax credits in the financial case for innovation-driven sustainability initiatives.",
          "Screen available incentives across jurisdictions to maximize tax value from sustainability investments.",
          "Treat sustainability investments as potential sources of tax value, not only as costs."
        ],
        "tags": [
          "tax credits",
          "sustainability",
          "incentives",
          "energy incentives",
          "state and local abatements",
          "location-based incentives",
          "R&D tax credits",
          "PwC",
          "sustainability investing"
        ]
      }
    },
    {
      "id": "PxnMl4M2pww",
      "title": "Why data is critical to sustainable supply chains",
      "channel": "PwC US",
      "published_at": "2026-01-30T13:24:27.000Z",
      "url": "https://www.youtube.com/watch?v=PxnMl4M2pww",
      "thumbnail": "https://i.ytimg.com/vi/PxnMl4M2pww/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… David Linich, Sustainability Principal at PwC US, argues that reliable, high-quality data lets organizations scenario plan, protect margins, and deliver sustainable, high-quality products at the right place and time. With conditions changing week by week, data-driven decision-making is presented as essential for building resilient, modern supply chains.",
        "bullets": [
          "Reliable, high-quality data is foundational for scenario planning.",
          "Data helps protect margins amid shifting tariffs and margin pressure.",
          "Enables delivery of sustainable, high-quality products to the right place and time.",
          "Supply chain conditions can change week by week, raising the need for timely insights.",
          "Data-driven decision-making is key to resilient, modern supply chains."
        ],
        "takeaways": [
          "Prioritize obtaining and maintaining high-quality supply-chain data to support scenario planning for equipment and parts procurement.",
          "Use data-driven scenarios to anticipate disruptions and protect operating margins under changing tariff and cost conditions.",
          "Incorporate sustainability metrics into supply-chain data to meet ESG goals while ensuring reliability and product quality."
        ],
        "tags": [
          "data",
          "supply-chain",
          "sustainability",
          "resilience",
          "scenario-planning",
          "margins",
          "PwC",
          "ESG",
          "operational-resilience"
        ]
      }
    },
    {
      "id": "gv6zK265OUE",
      "title": "Build your first GraphRAG Powered Agent! (No Graph Expert Required) | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-30T06:40:49.000Z",
      "url": "https://www.youtube.com/watch?v=gv6zK265OUE",
      "thumbnail": "https://i.ytimg.com/vi/gv6zK265OUE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this AWS Events session demonstrates how to build a GraphRAG (knowledge-graph-powered) agent quickly using the AI tools teams already use. It features a live demo with real documents and provides sample code so you can create a working knowledge-graph solution in an afternoon instead of a six-month project.",
        "bullets": [
          "Knowledge needed for smarter AI often sits trapped in docs, PDFs, and wikis.",
          "Knowledge graphs are presented as the way to unlock that information for reasoning.",
          "Many teams avoid building graphs because it sounds like a massive effort, but the talk argues it isn’t.",
          "The session includes a live demo using real documents and shows how to build one in an afternoon.",
          "Sample code is provided (notebook link) to jumpstart implementation."
        ],
        "takeaways": [
          "Can surface institutional knowledge from existing documents (manuals, wikis, PDFs) into AI workflows.",
          "Lower time-to-prototype (an afternoon vs. months) reduces barrier to evaluating knowledge-graph approaches.",
          "Work leverages existing AI toolchains, so organizations may not need dedicated graph experts to start.",
          "Provided sample code and live demo accelerate hands-on implementation and testing."
        ],
        "tags": [
          "GraphRAG",
          "knowledge-graph",
          "retrieval-augmented-generation",
          "RAG",
          "AI-tools",
          "AWS-Events",
          "Neptune",
          "databases-for-ai",
          "sample-code",
          "live-demo"
        ]
      }
    },
    {
      "id": "azzmtqcIeCU",
      "title": "Cloud Cost Efficiency I The Keys to AWS Optimization | S16 E2",
      "channel": "AWS Events",
      "published_at": "2026-01-30T05:12:30.000Z",
      "url": "https://www.youtube.com/watch?v=azzmtqcIeCU",
      "thumbnail": "https://i.ytimg.com/vi/azzmtqcIeCU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This livestream examines the key metrics for AWS cost efficiency, including cost per transaction, resource utilization rates, and ROI calculations. It also covers benchmarking, identifying cost optimization opportunities, and building dashboards to align technical performance with business outcomes for cloud engineers, FinOps teams, and technical leaders.",
        "bullets": [
          "Focus on KPIs: cost per transaction, resource utilization, and ROI",
          "Practical guidance on measuring, tracking, and optimizing AWS spend",
          "Approaches for benchmarking cloud efficiency to find improvement areas",
          "Identifying actionable cost optimization opportunities",
          "Building dashboards to communicate value to stakeholders"
        ],
        "takeaways": [
          "Track clear KPIs to link technical performance with financial impact",
          "Benchmarking helps prioritize where to reduce costs or reallocate resources",
          "Dashboards translate optimization work into stakeholder-facing business value",
          "ROI and cost-per-transaction metrics guide investment and capacity decisions"
        ],
        "tags": [
          "AWS",
          "CloudCosts",
          "FinOps",
          "CostOptimization",
          "CloudMetrics",
          "AWSCostManagement",
          "CloudEfficiency",
          "KPIs"
        ]
      }
    },
    {
      "id": "oQtkaHzUYlY",
      "title": "Copilot helps Christa find her inner star 🌟",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-29T18:33:49.000Z",
      "url": "https://www.youtube.com/watch?v=oQtkaHzUYlY",
      "thumbnail": "https://i.ytimg.com/vi/oQtkaHzUYlY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video shows Copilot helping Christa \"find the star within\" with a sky-full-of-stars visual. Viewers are invited to download and try Copilot via the link in the channel bio.",
        "bullets": [
          "Theme: Copilot helps Christa discover her \"inner star.\"",
          "Visual motif: a sky full of stars.",
          "Call to action: download and try Copilot (link in bio).",
          "Promotional/feel-good tone."
        ],
        "takeaways": [
          "Copilot is being promoted with user-empowerment messaging—note the consumer-facing branding approach.",
          "A trial/download link is available via the channel bio for quick hands-on evaluation.",
          "Marketing assets emphasize personal creativity; align internal adoption messaging accordingly."
        ],
        "tags": [
          "Microsoft Copilot",
          "Copilot",
          "Christa",
          "inner star",
          "stars",
          "download",
          "link-in-bio",
          "promo",
          "creativity"
        ]
      }
    },
    {
      "id": "BYtYm-xyKR8",
      "title": "Bringing In $251K A Year With 3 Jobs In The Bay Area",
      "channel": "CNBC Make It",
      "published_at": "2026-01-29T17:47:46.000Z",
      "url": "https://www.youtube.com/watch?v=BYtYm-xyKR8",
      "thumbnail": "https://i.ytimg.com/vi/BYtYm-xyKR8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Naseema McElroy, a 44-year-old labor and delivery nurse in Brentwood, California, brings in $251K a year by working three jobs and running a personal finance brand called Financially Intentional. She documented her finances after accumulating nearly $1 million in debt in 2015 and became debt-free by 2017.",
        "bullets": [
          "Earns $251K annually through three jobs plus a personal finance brand.",
          "Labor and delivery nurse based in Brentwood, California.",
          "Accumulated nearly $1 million in debt in 2015; debt-free by 2017.",
          "Founded Financially Intentional to document her debt-payoff journey.",
          "Profiled in CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "Employees may combine multiple jobs and side businesses to achieve high earnings—consider scheduling and retention strategies that account for multiple income streams.",
          "High personal debt can affect people across income levels—financial-wellness resources may be relevant for employee stability.",
          "Staff entrepreneurship (personal brands/side hustles) can coexist with primary roles—clarify policies and flexibility around outside work in high-cost regions like the Bay Area."
        ],
        "tags": [
          "Naseema McElroy",
          "Financially Intentional",
          "debt payoff",
          "multiple jobs",
          "Bay Area",
          "nurse",
          "personal finance",
          "CNBC Make It",
          "Millennial Money"
        ]
      }
    },
    {
      "id": "t6y2cVNjCAw",
      "title": "GeForce Garage - Summer of RTX Community Build",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-29T14:01:25.000Z",
      "url": "https://www.youtube.com/watch?v=t6y2cVNjCAw",
      "thumbnail": "https://i.ytimg.com/vi/t6y2cVNjCAw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This video spotlights the winning entry of NVIDIA's Summer of RTX r/buildapc Community Build Contest — u/JeffersonPutnam’s small-form-factor GeForce RTX 5090 rig. GeForce host Dwight presents the build and the description supplies the full system spec list and links.",
        "bullets": [
          "Winner: u/JeffersonPutnam — SFF GeForce RTX 5090 build from the Summer of RTX community contest.",
          "Chassis: Fractal Design Era 2; GPU: GeForce RTX 5090 Founders Edition.",
          "CPU: Ryzen 7 9800X3D on an MSI MPG B850I Edge mini‑ITX motherboard.",
          "Memory: 32GB Teamgroup T-Create Expert DDR5-6000; Power: Corsair SF1000.",
          "Cooling: Corsair Nautilus 240 RS AIO; full parts list available on PCPartPicker (link in description)."
        ],
        "takeaways": [
          "The RTX 5090 is being showcased in a compact SFF build, highlighting consumer interest in high‑performance GPUs in space‑constrained systems.",
          "Use of a 240mm AIO and a 1000W SFX PSU with a high‑end GPU signals increased cooling and power delivery demands for dense or compact deployments.",
          "Pairing a Ryzen 7 9800X3D with a mini‑ITX B850 platform illustrates current mainstream enthusiast platform choices for high‑performance consumer builds.",
          "Community showcases and contests can drive visibility and signal adoption trends that may influence procurement or product support considerations."
        ],
        "tags": [
          "GeForceGarage",
          "SummerOfRTX",
          "RTX5090",
          "SFF",
          "PCBuild",
          "r/buildapc",
          "Ryzen9800X3D",
          "FractalEra2"
        ]
      }
    },
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy GenAI solutions that unlocked new revenue streams and streamlined operations. Sreeni Alakappan says the company leveraged Google Cloud’s robust infrastructure to boost developer productivity and compress its digital transformation timeline.",
        "bullets": [
          "TTEC and Google Cloud Consulting rapidly prototyped and deployed GenAI solutions.",
          "Google Cloud’s robust infrastructure was used to streamline operations.",
          "Developer productivity was boosted through the AI deployments.",
          "New revenue streams were unlocked by the AI-enabled offerings.",
          "The partnership compressed TTEC’s digital transformation timeline and expanded business ambitions."
        ],
        "takeaways": [
          "Prioritize access to robust cloud infrastructure to support rapid GenAI prototyping and deployment.",
          "Cloud consulting can compress transformation timelines and help scale AI initiatives faster.",
          "Improving developer productivity and automation shortens time-to-value for AI projects.",
          "Successful AI deployments can create new revenue streams—plan infrastructure and operations accordingly.",
          "Expect increased demand for scalable, flexible infrastructure to support GenAI-driven workloads."
        ],
        "tags": [
          "google-cloud",
          "ttec",
          "genai",
          "ai-deployment",
          "operational-efficiency",
          "customer-experience",
          "cloud-consulting",
          "generative-ai"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights Jo discovering the power of Copilot Groups. It emphasizes that Copilot Groups makes route planning easy and includes promotional tags #copilot #microsoftcopilot #ai.",
        "bullets": [
          "Focuses on route planning made easy.",
          "Shows Jo discovering the capabilities of Copilot Groups.",
          "Promotes Microsoft Copilot using hashtags.",
          "No transcript is available for more detail."
        ],
        "takeaways": [
          "If route planning is part of your operations, note that Copilot Groups is presented as a tool aimed at simplifying that task.",
          "Consider evaluating Copilot Groups for planning workflows where streamlined routing could matter.",
          "Use the video as a prompt to gather more detailed information about Copilot Groups before making decisions."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "copilot-groups",
          "route-planning",
          "jo"
        ]
      }
    }
  ]
}