{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-28T09:55:24.512Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "gv6zK265OUE",
      "title": "Build your first GraphRAG Powered Agent! (No Graph Expert Required) | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-27T20:55:49.000Z",
      "url": "https://www.youtube.com/watch?v=gv6zK265OUE",
      "thumbnail": "https://i.ytimg.com/vi/gv6zK265OUE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the session argues that knowledge trapped in docs, PDFs, and wikis can be unlocked with knowledge graphs to make AI smarter. It promises a live demo showing how to build a GraphRAG-powered knowledge graph in an afternoon using familiar AI tools—no six-month project or graph expertise required.",
        "bullets": [
          "Knowledge in documents is often inaccessible to AI without structured representation.",
          "Knowledge graphs are presented as the solution to unlock that information.",
          "Many teams avoid graphs due to perceived complexity, but the talk counters that.",
          "Demonstrates building a GraphRAG-powered graph quickly using existing AI tools.",
          "Live demo uses real documents and emphasizes a rapid, practical approach."
        ],
        "takeaways": [
          "Access buried operational knowledge (manuals, runbooks, specs) more easily for faster troubleshooting and decisions.",
          "Shorter implementation timeframes reduce project risk and cost compared with long, specialist graph projects.",
          "Leverage your existing AI tooling—no need to hire specialized graph experts to start extracting value.",
          "A practical, demo-driven approach shows feasibility for rapid pilot deployments in grid/data center environments."
        ],
        "tags": [
          "GraphRAG",
          "knowledge-graph",
          "RAG",
          "AI",
          "databases-for-AI",
          "AWS-Events",
          "demo",
          "documents",
          "PDFs",
          "wikis"
        ]
      }
    },
    {
      "id": "yUpQ9pWA9WE",
      "title": "Watch Live: Fed Chair Jerome Powell Holds News Conference | WSJ",
      "channel": "WSJ News",
      "published_at": "2026-01-27T20:49:24.000Z",
      "url": "https://www.youtube.com/watch?v=yUpQ9pWA9WE",
      "thumbnail": "https://i.ytimg.com/vi/yUpQ9pWA9WE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Federal Reserve Chair Jerome Powell speaks to reporters following the Federal Reserve's two-day policy-setting meeting. WSJ News hosted a live news conference; no transcript of the event is available.",
        "bullets": [
          "Speaker: Federal Reserve Chair Jerome Powell",
          "Occasion: Post-meeting news conference after a two-day Fed policy meeting",
          "Format: Live press conference covered by WSJ News",
          "Transcript: No transcript available with the provided content",
          "Published: WSJ News video released Jan 27, 2026"
        ],
        "takeaways": [
          "Monitor the live feed or WSJ coverage for the Fed’s official statements, which provide primary source information on policy decisions.",
          "Ensure finance teams are prepared to review borrowing, hedging, and liquidity plans promptly after the conference.",
          "Keep an eye on market and energy-price movements following the remarks; have contingency plans for operational or cost impacts.",
          "Record or archive the conference footage for compliance and later review by strategy and procurement stakeholders."
        ],
        "tags": [
          "JeromePowell",
          "FederalReserve",
          "Fed",
          "WSJ",
          "newsconference",
          "monetarypolicy",
          "markets",
          "finance"
        ]
      }
    },
    {
      "id": "MuQmKCWjSYI",
      "title": "Deutsche Bank accelerates Cloud journeys with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-27T17:39:29.000Z",
      "url": "https://www.youtube.com/watch?v=MuQmKCWjSYI",
      "thumbnail": "https://i.ytimg.com/vi/MuQmKCWjSYI/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Google Cloud Consulting designed novel learning experiences using Generative AI to deliver personalized, interactive training that combines on-demand convenience with the effectiveness of instructor-led sessions. The Learning Services team helped build the Deutsche Bank Cloud Engineering Program, upskilling thousands of engineers and massively accelerating the bank's cloud journey.",
        "bullets": [
          "Generative AI used to create personalized, interactive training experiences.",
          "Training blends on‑demand modules with instructor‑led effectiveness.",
          "Program scaled to train thousands of Deutsche Bank engineers.",
          "Google Cloud Consulting Learning Services provided creative and technical expertise.",
          "Outcome focused on massively accelerating Deutsche Bank’s cloud journey."
        ],
        "takeaways": [
          "Personalized, AI-enabled training can scale engineer upskilling across large organizations.",
          "Combining on‑demand and instructor‑led formats can balance convenience with learning effectiveness.",
          "Engaging a consulting learning services team supplies both creative design and technical implementation support.",
          "Accelerated training programs can speed overall cloud readiness and migration efforts."
        ],
        "tags": [
          "Google Cloud Consulting",
          "Deutsche Bank",
          "Generative AI",
          "Cloud Training",
          "Cloud Engineering",
          "Learning Services",
          "Upskilling",
          "On-demand Learning",
          "Instructor-led",
          "Enterprise Cloud"
        ]
      }
    },
    {
      "id": "5CyVBSbHmbA",
      "title": "Year-end toolkit: Strengthening audit committee collaboration",
      "channel": "PwC US",
      "published_at": "2026-01-27T17:20:31.000Z",
      "url": "https://www.youtube.com/watch?v=5CyVBSbHmbA",
      "thumbnail": "https://i.ytimg.com/vi/5CyVBSbHmbA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this episode of PwC’s year-end toolkit focuses on strengthening collaboration between finance management and the audit committee as they navigate a busy year-end accounting and reporting cycle. It highlights how management can streamline reporting and address emerging oversight areas including AI, enterprise risk management, transformation initiatives, cyber risk, and proxy disclosures.",
        "bullets": [
          "Best practices for management/audit committee communication and collaboration at year-end",
          "Key year-end accounting and reporting issues finance teams should be ready to address",
          "Oversight of AI: assessing risks, opportunities, and controls",
          "Enhancing enterprise risk oversight and navigating evolving cyber risks in the AI era",
          "Elevating proxy disclosures to reflect governance and oversight activities"
        ],
        "takeaways": [
          "Keep the audit committee proactively informed about year-end accounting and reporting implications of transformation initiatives to ensure oversight and smoother sign-offs.",
          "Be prepared to discuss AI governance: document risks, opportunities, and control frameworks for audit committee review.",
          "Strengthen enterprise risk updates and cyber-risk briefings to reflect new AI-related threat vectors and oversight needs.",
          "Review and enhance proxy and external disclosures so governance and oversight of AI, transformation, and risk management are clearly communicated."
        ],
        "tags": [
          "audit committee",
          "year-end",
          "finance",
          "accounting and reporting",
          "AI oversight",
          "enterprise risk management",
          "cybersecurity",
          "proxy disclosures",
          "transformation initiatives",
          "PwC"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Jo discovers the power of Copilot Groups for making route planning easy. The brief video description highlights Copilot Groups' role in simplifying routes and uses the hashtags #copilot, #microsoftcopilot, and #ai.",
        "bullets": [
          "Focus: route planning made easy",
          "Feature highlighted: Copilot Groups",
          "Protagonist: Jo discovers the feature",
          "Hashtags: #copilot, #microsoftcopilot, #ai"
        ],
        "takeaways": [
          "Based on the description, Copilot Groups is presented as a tool to simplify route planning—decision-makers should note this capability for logistics and field operations.",
          "Watch the video to evaluate whether Copilot Groups aligns with routing needs for site visits, maintenance, or equipment delivery workflows.",
          "If the feature appears relevant, consider a small pilot to test integration with existing asset and route-management systems."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "copilot-groups",
          "route-planning",
          "demo",
          "workflow",
          "productivity"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI w audycie jest już codziennością — narzędzia wspierają powtarzalne czynności, analizę dużych zbiorów danych i podejmowanie decyzji. W podcaście KPMG ON AIR Katarzyna Chojniak i Alicja Barska omawiają praktyczne zastosowania (np. AI Transaction Scoring Tool, Clara AI, platforma KPMG Clara), korzyści dla klientów, zmiany roli audytora oraz wyzwania związane z wdrożeniem, bezpieczeństwem danych i regulacjami.",
        "bullets": [
          "AI automatyzuje powtarzalne zadania i umożliwia analizę pełnych populacji danych zamiast tradycyjnego próbkowania.",
          "Clara AI i wyspecjalizowani agenci wspierają dokumentację, analizę ujawnień i konwersacyjną pomoc audytorom.",
          "KPMG Clara umożliwia zarządzanie badaniem w czasie rzeczywistym i nowoczesną komunikację z klientem (Clara for Clients).",
          "Wdrożenie wymaga adaptacji audytorów; poruszono też kwestie bezpieczeństwa danych, regulacji i potencjalnych zagrożeń związanych z AI.",
          "Podcast prezentuje praktyczne przykłady, korzyści dla klientów oraz perspektywy rozwoju AI w procesie badania."
        ],
        "takeaways": [
          "Upewnij się, że systemy i dane są dobrze uporządkowane i dostępne — audytorzy coraz częściej analizują pełne populacje danych.",
          "Priorytetem powinna być ochrona danych i zgodność z regulacjami, bo AI w audycie podnosi wymagania dotyczące bezpieczeństwa i audytowalności.",
          "Przygotuj się na szybszą, platformową współpracę z audytorami (real‑time management, komunikacja przez klienta), co może skrócić cykle kontroli.",
          "Wspieraj rozwój kompetencji zespołów i współpracę z audytorami, aby efektywnie korzystać z narzędzi AI i minimalizować ryzyka operacyjne."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMG",
          "KPMG Clara",
          "Clara AI",
          "automatyzacja",
          "bezpieczeństwo danych",
          "regulacje",
          "pełna populacja",
          "innowacje"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield has officially launched and the trailer highlights NVIDIA DLSS 4 with Multi Frame Generation. The video was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 MFG 4X mode, and links to the game and social channels are included.",
        "bullets": [
          "Arknights: Endfield officially launched.",
          "Trailer showcases NVIDIA DLSS 4 with Multi Frame Generation.",
          "Game is a 3D real-time strategy RPG; player is the Endministrator exploring Talos-II.",
          "Footage captured on GeForce RTX 5080 at 4K Ultra with DLSS 4 MFG 4X mode.",
          "Description includes links to the game site and official social channels."
        ],
        "takeaways": [
          "NVIDIA promoting DLSS 4 indicates a shift toward AI-driven upscaling for high-fidelity real-time workloads—verify hardware support for DLSS 4 (example: RTX 5080) when planning GPU deployments.",
          "4K Ultra capture with MFG 4X underscores potential performance/throughput improvements relevant to cloud gaming, rendering, and content-delivery pipelines.",
          "Ensure software and driver stacks in data center environments support DLSS 4 and Multi Frame Generation for compatibility testing and performance validation."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "RTXOn",
          "NVIDIA",
          "RTX5080",
          "4K",
          "MultiFrameGeneration",
          "gaming",
          "real-time-RPG"
        ]
      }
    }
  ]
}