{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-29T03:10:32.430Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "7CbJoeEFyZg",
      "title": "Transforming Healthcare Document Processing Workflows with Generative AI",
      "channel": "AWS Events",
      "published_at": "2026-01-28T21:33:21.000Z",
      "url": "https://www.youtube.com/watch?v=7CbJoeEFyZg",
      "thumbnail": "https://i.ytimg.com/vi/7CbJoeEFyZg/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this session demonstrates AWS's GenAI Intelligent Document Processing (GenAIIDP) solution that uses Amazon Textract and Bedrock to automate complex medical document workflows, reducing days-long manual processes to minutes. Through live demonstrations and architecture deep-dives, attendees learn implementation strategies for scalable pipelines, integration patterns, HIPAA-compliant deployments, and ROI optimization best practices.",
        "bullets": [
          "Combines Amazon Textract and Bedrock to automate classification, data extraction, and criteria validation.",
          "Transforms manual healthcare document processing from days to minutes.",
          "Includes live demos and architecture deep-dives for practical implementation insight.",
          "Covers integration patterns with existing systems and scalable pipeline design.",
          "Highlights maintaining HIPAA compliance and strategies for maximizing ROI."
        ],
        "takeaways": [
          "Expect significant throughput gains (days to minutes), which impacts capacity planning and compute needs.",
          "Design for scalability in pipeline architecture to handle variable medical document workloads.",
          "Prioritize HIPAA-compliant deployment and data governance when selecting infrastructure and services.",
          "Plan integration points with existing systems to minimize disruption and accelerate adoption.",
          "Incorporate ROI optimization practices into deployment planning to justify resource investment."
        ],
        "tags": [
          "GenAI",
          "Intelligent Document Processing",
          "Amazon Textract",
          "Bedrock",
          "Healthcare",
          "HIPAA",
          "Scalability",
          "ROI",
          "Data Extraction",
          "Integration"
        ]
      }
    },
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy AI solutions, using GenAI and Google Cloud infrastructure to streamline operations and boost developer productivity. The engagement compressed TTEC's digital transformation timeline and unlocked new revenue streams while expanding what the company considered possible for its business.",
        "bullets": [
          "TTEC worked with Google Cloud Consulting to accelerate AI prototyping and deployment.",
          "Sreeni Alakappan (VP, App Development and Automation) highlights use of GenAI and Google Cloud infrastructure.",
          "Effort focused on streamlining operations and increasing developer productivity.",
          "Rapid prototyping enabled new revenue streams for TTEC.",
          "Google Cloud Consulting helped compress the digital transformation timeline and expand business ambitions."
        ],
        "takeaways": [
          "Engaging cloud consulting can shorten AI deployment timelines and reduce time to value.",
          "Leveraging GenAI on robust cloud infrastructure can increase developer productivity and operational efficiency.",
          "Rapid prototyping of AI solutions can reveal and enable new revenue opportunities.",
          "Strategic cloud partnerships can expand organizational ambitions and accelerate digital transformation."
        ],
        "tags": [
          "googlecloud",
          "ttec",
          "genai",
          "aideployment",
          "operationalefficiency",
          "developer-productivity",
          "digital-transformation",
          "customer-experience"
        ]
      }
    },
    {
      "id": "5CyVBSbHmbA",
      "title": "Year-end toolkit: Strengthening audit committee collaboration",
      "channel": "PwC US",
      "published_at": "2026-01-27T17:20:31.000Z",
      "url": "https://www.youtube.com/watch?v=5CyVBSbHmbA",
      "thumbnail": "https://i.ytimg.com/vi/5CyVBSbHmbA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this episode guides finance teams on strengthening engagement with audit committees during the year-end accounting and reporting cycle. It emphasizes streamlining reporting and governance collaboration while addressing emerging oversight areas such as AI, enterprise risk management, cyber risk in the age of AI, and proxy disclosures.",
        "bullets": [
          "Strengthening management/audit committee communication and collaboration (1:18)",
          "Key year-end accounting and reporting issues finance teams should be prepared to address (10:10)",
          "Oversight of AI: risks, opportunities, and controls (15:02)",
          "Enhancing enterprise risk oversight (21:33) and navigating evolving cyber risk in the age of AI (27:35)",
          "Elevating proxy disclosures and links to additional PwC resources (36:05)"
        ],
        "takeaways": [
          "Engage the audit committee early on year-end reporting and major transformation initiatives to ensure alignment on oversight and disclosure expectations.",
          "Document AI deployments with clear risk assessments, controls, and monitoring to support audit committee scrutiny and year-end reporting needs.",
          "Embed AI-related cyber risks into enterprise risk reporting and controls so audit committees have a consolidated view of material exposures.",
          "Prepare concise, decision-useful year-end materials that highlight impacts of major initiatives on financials, controls, and governance for smoother committee review."
        ],
        "tags": [
          "PwC",
          "audit committee",
          "year-end",
          "financial reporting",
          "AI oversight",
          "enterprise risk",
          "cyber risk",
          "proxy disclosures",
          "governance"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Jo discovers how Copilot Groups simplifies route planning. The short clip highlights route planning made easy with Microsoft Copilot.",
        "bullets": [
          "Route planning made easy",
          "Feature highlighted: Copilot Groups",
          "Central figure: Jo discovers the capability",
          "Associated hashtags: #copilot #microsoftcopilot #ai"
        ],
        "takeaways": [
          "Based on the description, Copilot Groups emphasizes easier route planning—relevant for teams that coordinate field routes or maintenance trips",
          "Decision-makers may want to explore Copilot Groups as a tool to streamline route coordination",
          "Evaluate Copilot Groups for potential inclusion in operational planning or dispatch workflows"
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "copilot-groups",
          "route-planning",
          "logistics",
          "field-operations",
          "productivity",
          "jo"
        ]
      }
    },
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI w audycie to już codzienność — w podcaście ekspertki KPMG omawiają praktyczne zastosowania (m.in. AI Transaction Scoring Tool, Clara AI i platforma KPMG Clara), korzyści dla klientów oraz przejście z próbkowania na analizę pełnych populacji. Rozmowa porusza też nowe kompetencje audytorów, wyzwania wdrożeniowe, kwestie bezpieczeństwa danych, środowisko regulacyjne oraz potencjalne zagrożenia i przyszłość AI w procesie badania.",
        "bullets": [
          "AI Transaction Scoring Tool umożliwia analizę pełnych populacji transakcji zamiast tradycyjnego próbkowania.",
          "Clara AI działa jako konwersacyjny asystent i zestaw wyspecjalizowanych agentów wspierających audyt.",
          "AI wspiera dokumentację oraz analizę ujawnień, a platforma KPMG Clara pozwala na zarządzanie badaniem w czasie rzeczywistym.",
          "Clara for Clients usprawnia komunikację z klientem i proces współpracy podczas audytu.",
          "Omówiono wyzwania wdrożeniowe, adaptację audytorów, bezpieczeństwo danych, regulacje i potencjalne zagrożenia związane z AI."
        ],
        "takeaways": [
          "Przygotuj się na dokładniejsze i szybsze audyty — analiza pełnych populacji może ujawnić więcej nieciągłości niż próbkowanie.",
          "Zapewnij bezpieczne i zgodne z regulacjami kanały wymiany danych z audytorem przed wdrożeniem rozwiązań AI.",
          "Wykorzystuj platformy klient‑audytor (np. Clara for Clients) do usprawnienia komunikacji i szybszego dostępu do wyników audytu.",
          "Inwestuj w kompetencje zespołów IT i operacyjnych dotyczące danych i narzędzi AI, by sprawnie współpracować podczas audytu.",
          "Monitoruj regulacje i ryzyka związane z AI — wymagają one uwagi przy udostępnianiu danych i wdrażaniu automatyzacji."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMG",
          "KPMG Clara",
          "Clara AI",
          "transaction scoring",
          "bezpieczeństwo danych",
          "innowacje",
          "regulacje"
        ]
      }
    }
  ]
}