{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-22T05:58:35.020Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "t33Fh1JZVgA",
      "title": "AI at Speed: From Investment to Performance",
      "channel": "PwC US",
      "published_at": "2026-01-21T22:48:29.000Z",
      "url": "https://www.youtube.com/watch?v=t33Fh1JZVgA",
      "thumbnail": "https://i.ytimg.com/vi/t33Fh1JZVgA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… PwC US Senior Partner and CEO Paul Griggs and CNBC’s Emma Crosby discuss how organizations are shifting from AI exploration to execution, assessing initiatives through investment discipline, performance, and measurable value. They emphasize moving early, placing capital with intent, and designing operating models that preserve resilience and performance as AI delivers measurable outcomes and supports future transformation.",
        "bullets": [
          "Shift from AI experimentation to execution with a focus on measurable value.",
          "Evaluate AI through investment discipline and performance metrics.",
          "Move early and allocate capital intentionally to AI initiatives.",
          "Design operating models that remain resilient without sacrificing performance.",
          "AI is delivering measurable outcomes today while enabling future transformation."
        ],
        "takeaways": [
          "Prioritize infrastructure investments that can demonstrate measurable ROI for AI workloads.",
          "Design resilient operating models and processes that maintain performance under AI demands.",
          "Align capital allocation early with strategic AI initiatives to avoid lagging behind execution.",
          "Use performance metrics and measurable outcomes to guide data center and grid investment decisions."
        ],
        "tags": [
          "AI investment",
          "AI performance",
          "measurable outcomes",
          "operating models",
          "resilience",
          "capital allocation",
          "PwC",
          "Davos 2026",
          "data centers",
          "infrastructure"
        ]
      }
    },
    {
      "id": "6hu7hYLiu08",
      "title": "Get Step-By-Step Fixes with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-21T20:14:00.000Z",
      "url": "https://www.youtube.com/watch?v=6hu7hYLiu08",
      "thumbnail": "https://i.ytimg.com/vi/6hu7hYLiu08/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Copilot offers real-time, visual support for home projects and repairs. It can see what you see and provide step-by-step instructions and clear guidance for issues like leaky pipes and overflowing washing machines.",
        "bullets": [
          "Real-time visual assistance for home repairs",
          "Provides step-by-step instructions based on what the camera sees",
          "Targets common household issues (e.g., leaky pipes, overflowing washers)",
          "Aims to deliver clear, actionable guidance for DIY projects",
          "Designed to support on-the-spot troubleshooting"
        ],
        "takeaways": [
          "Copilot can process visual input to deliver stepwise repair guidance — note this capability when evaluating remote-assistance tools.",
          "The service emphasizes clear, real-time instructions, which could inform expectations for operational support workflows.",
          "Shows a visual-guided troubleshooting model that could be relevant when assessing tools for on-site equipment maintenance.",
          "Although described for home use, the underlying approach highlights a capability to provide guided, camera-based troubleshooting."
        ],
        "tags": [
          "Copilot",
          "real-time support",
          "visual guidance",
          "step-by-step",
          "home repairs",
          "leaky pipes",
          "washing machine",
          "DIY",
          "remote assistance",
          "Microsoft"
        ]
      }
    },
    {
      "id": "IKkVWKdumHw",
      "title": "re:Invent 2025 - Chalk Talk - Origin management for multi-region applications with Amazon CloudFront",
      "channel": "AWS Events",
      "published_at": "2026-01-21T17:49:36.000Z",
      "url": "https://www.youtube.com/watch?v=IKkVWKdumHw",
      "thumbnail": "https://i.ytimg.com/vi/IKkVWKdumHw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this session explains origin management with Amazon CloudFront for building secure, resilient multi-region content delivery. It covers automatic failover with CloudFront and Route 53, granular origin routing using CloudFront Functions, securing origins with S3 Origin Access Control (OAC) and VPC private origins, integrating on-premises infrastructure via AWS Direct Connect, and deploying Origin Shield to optimize caching and reduce origin load.",
        "bullets": [
          "Automatic failover using CloudFront in combination with Route 53",
          "Granular origin routing implemented with CloudFront Functions",
          "Secure origins via S3 Origin Access Control (OAC) and VPC private origins",
          "Hybrid on‑prem integration through AWS Direct Connect",
          "Origin Shield to optimize cache performance and lower origin load"
        ],
        "takeaways": [
          "Improved availability: automatic failover supports multi‑region resilience and reduces downtime risk",
          "Stronger security posture: OAC and VPC private origins limit direct exposure of origin infrastructure",
          "Reduced origin load and bandwidth use: Origin Shield and caching lower demand on data center resources",
          "Greater routing control: CloudFront Functions enable fine‑grained origin selection without changing origins",
          "Easier hybrid deployment: Direct Connect allows on‑prem assets to be integrated into CDN origin strategies"
        ],
        "tags": [
          "Amazon CloudFront",
          "Origin Management",
          "Route53",
          "CloudFront Functions",
          "Origin Access Control",
          "VPC Private Origins",
          "AWS Direct Connect",
          "Origin Shield",
          "Multi-region",
          "Content Delivery"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer - Launching January 22!",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield launches worldwide January 22 and highlights NVIDIA DLSS 4 with Multi Frame Generation. The trailer was captured on a GeForce RTX 5080 at 4K Ultra settings using DLSS 4 Multi Frame Generation 4X Mode, and the game is presented as a 3D real-time strategy RPG set on Talos-II.",
        "bullets": [
          "Worldwide release date: January 22.",
          "Features NVIDIA DLSS 4 with Multi Frame Generation (4X Mode).",
          "Captured on GeForce RTX 5080 at 4K Ultra settings.",
          "Game type: 3D real-time strategy RPG (play as the Endministrator across Talos-II).",
          "Links provided for more info and official social channels."
        ],
        "takeaways": [
          "Highlights integration of NVIDIA DLSS 4 Multi Frame Generation — relevant for evaluating modern GPU-driven upscaling/acceleration technologies.",
          "Captured on an RTX 5080 at 4K Ultra — demonstrates workload targeting high-end GPU performance for real-time rendering.",
          "Launch timing (Jan 22) provides a concrete date for testing, benchmarking, or demo scheduling on compatible hardware.",
          "As a 3D real-time strategy RPG, the title represents real-time rendering workloads that may benefit from GPU-accelerated feature sets like DLSS 4."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "RTX5080",
          "4K",
          "NVIDIA",
          "MultiFrameGeneration",
          "GameLaunch",
          "RealTimeRPG",
          "GeForce"
        ]
      }
    },
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video shows how Rate Insurance boosts agent efficiency using Agentforce and Gemini as part of the Google Cloud and Salesforce partnership. Viewers are directed to a link for more information about that partnership.",
        "bullets": [
          "No transcript available; description links to Google Cloud–Salesforce partnership page.",
          "Video demonstrates Rate Insurance improving agent efficiency with Agentforce and Gemini.",
          "Highlights use of Agentforce and Gemini within the Google Cloud/Salesforce ecosystem.",
          "Provides a link to learn more about the Google Cloud and Salesforce partnership."
        ],
        "takeaways": [
          "Review the Google Cloud–Salesforce partnership details (link) to understand potential integration points and vendor offerings.",
          "If adopting Agentforce and Gemini, assess how AI/agent tools could affect cloud capacity and workload planning.",
          "Plan for integration, networking, and security considerations when supporting agent-facing cloud services."
        ],
        "tags": [
          "Google Cloud",
          "Salesforce",
          "Rate Insurance",
          "Agentforce",
          "Gemini",
          "agent efficiency",
          "cloud",
          "AI",
          "partnership"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Charly Stoever, a 35-year-old financial coach, has been pet sitting full time and living rent-free in Portland, Oregon. For the last 18 months she lived out of two suitcases while earning $60,000 a year, as featured in CNBC Make It's Millennial Money series.",
        "bullets": [
          "Charly Stoever is a 35-year-old financial coach.",
          "She lives rent-free in Portland, Oregon by pet sitting full time.",
          "She has spent 18 months living out of two suitcases.",
          "Her pet-sitting work brings in $60,000 a year.",
          "This profile is part of CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "Nontraditional, location-flexible work can generate a stable income level (~$60,000/year).",
          "Highly mobile lifestyles (living out of two suitcases) mean some workers are not tied to a single residence.",
          "Alternative housing arrangements (rent-free via pet sitting) can alter local occupancy and utility usage patterns.",
          "Grid and data center planners should account for diverse, mobile workforce lifestyles when forecasting demand and capacity needs."
        ],
        "tags": [
          "Charly Stoever",
          "pet sitting",
          "rent-free",
          "Portland",
          "financial coach",
          "Millennial Money",
          "CNBC Make It",
          "$60,000",
          "travel"
        ]
      }
    },
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Dr. Anna Chacon, 39, is a Miami-based dermatologist who runs her own private practice. Her reported net worth is about $6 million, comprised of $3.2 million in investments, a $1.9 million home and a $1.1 million office building.",
        "bullets": [
          "Age/location: 39, Miami, FL",
          "Profession: dermatologist with a private practice",
          "Reported net worth: roughly $6 million",
          "Net worth breakdown: $3.2M investments, $1.9M home, $1.1M office building",
          "Owns both residential and commercial property"
        ],
        "takeaways": [
          "Private-practice medical professionals who own their clinic buildings can be a target segment for commercial power and infrastructure solutions.",
          "A portfolio-heavy net worth suggests these owners may have capital available for facility or technology upgrades at their practices.",
          "Local, owner-operated clinics (e.g., in markets like Miami) represent a customer group to consider for tailored reliability/resilience offerings."
        ],
        "tags": [
          "dermatologist",
          "private practice",
          "net worth",
          "personal finance",
          "real estate",
          "investments",
          "Miami",
          "CNBC Make It",
          "healthcare",
          "small business"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… A giant bubble of carbon dioxide is described as able to store 20 megawatts of energy. The description frames these CO2-based batteries as a way to address fluctuating renewable generation and help power a global shift to clean energy.",
        "bullets": [
          "Uses a giant bubble of carbon dioxide as the storage medium",
          "Described capacity: 20 megawatts of energy",
          "Aimed at buffering fluctuations from renewable energy sources",
          "Presented as a technology to support a global transition to clean energy",
          "Shared with hashtags referencing IEEE, tech, and innovation"
        ],
        "takeaways": [
          "20 MW storage capacity is a headline metric to compare against grid or data-center needs",
          "Designed to buffer renewable variability, so consider it for integration with intermittent generation",
          "Positioned for large-scale impact—assess scalability and deployment timelines for your systems"
        ],
        "tags": [
          "ieee",
          "tech",
          "ieeespectrum",
          "innovation",
          "future",
          "futuristic",
          "energy",
          "battery"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Eksperci KPMG omawiają, jak AI już zmienia podejście do cen transferowych — od monitorowania rentowności, przez benchmarki i automatyzację dokumentacji, po integrację z systemami ERP. Poruszono też ryzyka i wyzwania (dane, bezpieczeństwo, RODO, halucynacje) oraz praktyczne kroki wdrożeniowe: persony, uporządkowanie procesów, bezpieczne środowiska (Digital Gateway) i rozwój kompetencji doradców.",
        "bullets": [
          "AI wspiera monitoring rentowności, analizy porównawcze i automatyzację dokumentacji cen transferowych.",
          "AI nie zastąpi doradców podatkowych, lecz może wzmocnić ich pracę i trenować młodsze kadry.",
          "Wskazano główne ryzyka: jakość danych, bezpieczeństwo, zgodność z RODO oraz problem halucynacji AI.",
          "Proponowane środowisko pracy z AI: Digital Gateway jako bezpieczna platforma.",
          "Kroki wdrożeniowe: definiowanie person, integracja z ERP, uporządkowanie procesów i budowa filarów transformacji."
        ],
        "takeaways": [
          "Wykorzystanie AI do monitorowania rentowności i benchmarków może poprawić przejrzystość kosztów operacyjnych obiektów data center.",
          "Automatyzacja dokumentacji cen transferowych zmniejsza nakład pracy administracyjnej i przyspiesza raportowanie finansowe.",
          "Przed wdrożeniem AI zapewnij zgodność z RODO i mechanizmy bezpieczeństwa danych (np. bezpieczne środowiska jak Digital Gateway).",
          "Integracja AI z ERP i uporządkowanie procesów to kluczowe pierwsze kroki przed skalowaniem rozwiązań w infrastrukturze.",
          "Szkolenie zespołów i wykorzystanie AI jako narzędzia wspierającego (nie zastępującego) ekspertów zwiększy efektywność operacyjną."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "transfer pricing",
          "podatki",
          "automatyzacja",
          "ERP",
          "monitoring rentowności",
          "bezpieczeństwo danych",
          "RODO",
          "Digital Gateway"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Whether you’re tackling workouts, projects, or personal goals, Copilot is presented as a way to keep momentum going. The emphasis is on stacking small wins to maintain steady progress.",
        "bullets": [
          "Highlights using Copilot to maintain momentum across workouts, projects, and personal goals",
          "Centers on the idea of stacking small wins to sustain progress",
          "Applies to both personal and task-based activities",
          "Focus is on steady, ongoing progress rather than one-time leaps"
        ],
        "takeaways": [
          "Prioritize incremental, trackable progress for major infrastructure or operational initiatives to keep projects moving.",
          "Encourage teams to use Copilot as a support tool to break work into small, manageable steps and sustain momentum.",
          "Set short-term, achievable milestones to maintain morale and visibility into progress across data center programs.",
          "Use a small-wins approach to shorten feedback loops and reduce long-term project fatigue."
        ],
        "tags": [
          "Microsoft Copilot",
          "momentum",
          "productivity",
          "small wins",
          "goal-setting",
          "projects",
          "workouts",
          "personal goals"
        ]
      }
    }
  ]
}