{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-20T17:55:03.975Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The video shows how Rate Insurance boosts agent efficiency using Agentforce and Gemini. A link is provided to learn more about the Google Cloud and Salesforce partnership.",
        "bullets": [
          "Rate Insurance improves agent efficiency with Agentforce and Gemini.",
          "A link is provided to learn more about the Google Cloud and Salesforce partnership.",
          "No transcript is available for the video.",
          "Content focuses on agent efficiency and tool integration."
        ],
        "takeaways": [
          "The example highlights use of Google Cloud + Salesforce-linked tools for agent workflows — evaluate integration requirements with your data center or cloud strategy.",
          "When considering similar deployments, prioritize compatibility between vendor platforms (e.g., CRM, cloud, AI services) and your existing infrastructure.",
          "Use the partnership resources link to inform procurement and architectural discussions about managed cloud and SaaS integrations."
        ],
        "tags": [
          "Google Cloud",
          "Salesforce",
          "Rate Insurance",
          "Agentforce",
          "Gemini",
          "agent efficiency",
          "cloud partnership",
          "customer support",
          "insurance tech",
          "AI"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Charly Stoever, 35, is a financial coach who has spent the last 18 months living out of two suitcases and living rent-free in Portland, Oregon by pet sitting full time. She brings in about $60,000 a year, and this profile appears in CNBC Make It’s Millennial Money series.",
        "bullets": [
          "Charly Stoever, 35, lives rent-free in Portland, Oregon by pet sitting full time.",
          "She has been living out of two suitcases for the past 18 months.",
          "Her pet-sitting work generates about $60,000 per year.",
          "The story is part of CNBC Make It’s Millennial Money series.",
          "Produced credits include Lauren Shamo (producer) and Ryan Ermey (reporter)."
        ],
        "takeaways": [
          "Demonstrates a mobile, low-footprint lifestyle that can alter local residential occupancy patterns—monitor transient occupancy trends when projecting localized load.",
          "A segment of workers earns meaningful income from nontraditional services, which may affect timing and variability of residential energy usage.",
          "Frequent travel and flexible living arrangements could correlate with different demands for broadband and cloud services—track mobility trends for data usage forecasting.",
          "Planners should consider how shifting housing and work models influence short-term versus long-term infrastructure needs in specific urban areas."
        ],
        "tags": [
          "pet sitting",
          "rent-free living",
          "financial coach",
          "nomadic lifestyle",
          "Millennial Money",
          "CNBC Make It",
          "Portland",
          "side hustle",
          "minimalism",
          "gig economy"
        ]
      }
    },
    {
      "id": "wicD8G0rn1Y",
      "title": "New: AWS Lambda tenant isolation | Serverless Office Hours",
      "channel": "AWS Events",
      "published_at": "2026-01-20T15:40:24.000Z",
      "url": "https://www.youtube.com/watch?v=wicD8G0rn1Y",
      "thumbnail": "https://i.ytimg.com/vi/wicD8G0rn1Y/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AWS Lambda's new tenant isolation mode provides dedicated execution environments per tenant, ensuring cached data and execution contexts are siloed to prevent cross-tenant data exposure. The feature aims to simplify secure multi-tenant SaaS architectures, enable faster scaling during traffic spikes, and includes automatic tenant identifier logging for easier tenant-specific debugging.",
        "bullets": [
          "Dedicated execution environments per tenant to enforce isolation.",
          "Silos cached data and execution contexts to prevent cross-tenant exposure.",
          "Reduces infrastructure complexity while enabling robust security boundaries.",
          "Improves scaling responsiveness during traffic spikes while maintaining isolation guarantees.",
          "Built-in monitoring with automatic tenant identifier logging for easier debugging."
        ],
        "takeaways": [
          "Security: Per-tenant execution environments reduce risk of cross-tenant data leakage and improve overall isolation posture.",
          "Operational simplicity: Built-in isolation can lower the need for separate tenant infrastructure, reducing management overhead.",
          "Scalability: Faster scaling during spikes while preserving isolation helps maintain tenant performance under load.",
          "Observability: Automatic tenant identifier logging makes tenant-specific troubleshooting more efficient and actionable."
        ],
        "tags": [
          "aws",
          "aws-lambda",
          "tenant-isolation",
          "serverless",
          "multi-tenant",
          "security",
          "monitoring",
          "scaling",
          "saas"
        ]
      }
    },
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Dr. Anna Chacon, 39, is a Miami-based dermatologist who runs a private practice and is said to earn $900,000 a year. Her net worth is reported at about $6 million, comprised of $3.2M in investments, a $1.9M home and a $1.1M office building.",
        "bullets": [
          "Dr. Anna Chacon, 39, dermatologist in Miami, FL with a private practice (video title cites $900,000 annual earnings).",
          "Reported total net worth: approximately $6 million.",
          "Investment holdings: $3.2 million.",
          "Real estate: $1.9 million primary residence and a $1.1 million office building.",
          "Source: CNBC Make It video published 2026-01-19 (no transcript available)."
        ],
        "takeaways": [
          "This is a single individual’s financial snapshot—not a representative sample—so avoid using it alone for demand or capacity forecasting.",
          "The description includes geographic (Miami) and commercial real estate (office building) details—useful factual inputs when mapping infrastructure needs by location.",
          "Ownership of an office building is a concrete data point: verify owner-occupied medical office prevalence before assuming on-site energy or resilience responsibilities.",
          "Treat such media profiles as qualitative context and prioritize broader, quantitative datasets for grid or data center planning decisions."
        ],
        "tags": [
          "dermatologist",
          "personal finance",
          "net worth",
          "real estate",
          "investments",
          "Miami",
          "private practice",
          "CNBC Make It"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, a giant bubble of carbon dioxide can store 20 megawatts of energy and provide about eight hours of storage. IEEE Spectrum presents this CO2-based battery as a way to smooth fluctuating renewable generation and help drive a global shift to clean energy.",
        "bullets": [
          "Uses a giant bubble of carbon dioxide as an energy storage medium",
          "Stores 20 megawatts of power",
          "Provides roughly eight hours of energy storage",
          "Aims to smooth fluctuating renewable energy supply",
          "Positioned to support a global transition to clean energy"
        ],
        "takeaways": [
          "20 MW for eight hours implies multi-hour supply suitable for load shifting or extended backup needs",
          "Can help address renewable intermittency by storing surplus generation and releasing it during lulls",
          "Presented as a scalable option to support broader clean-energy grid planning worldwide"
        ],
        "tags": [
          "ieee",
          "co2",
          "battery",
          "energy-storage",
          "renewables",
          "grid",
          "innovation",
          "future"
        ]
      }
    },
    {
      "id": "OINppmPan0o",
      "title": "Figure Skating | Making Team USA presented by Xfinity with Apolo Ohno",
      "channel": "Team USA",
      "published_at": "2026-01-16T19:30:36.000Z",
      "url": "https://www.youtube.com/watch?v=OINppmPan0o",
      "thumbnail": "https://i.ytimg.com/vi/OINppmPan0o/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Figure skating duo Vadym Kolesnik and Emilia Zingas sit down with Apolo Ohno on this episode of Making Team USA presented by Xfinity, ahead of the Winter Olympics. The segment highlights their partnership, described as \"built on trust,\" as they prepare to represent Team USA.",
        "bullets": [
          "Features ice dance partners Vadym Kolesnik and Emilia Zingas.",
          "Interview conducted by Olympian Apolo Ohno.",
          "Part of the Making Team USA series presented by Xfinity.",
          "Released ahead of the Winter Olympics.",
          "Emphasizes trust as the foundation of their partnership."
        ],
        "takeaways": [
          "Trust and strong team relationships support coordinated responses during high-stakes events—valuable for operations and incident response teams.",
          "Early preparation ahead of major events reduces risk—apply to capacity planning, redundancy, and testing before peak demand periods.",
          "Clear communication and defined roles enhance performance—mirror these principles in runbooks and escalation procedures.",
          "High-visibility periods require readiness for external scrutiny—ensure continuity plans and spokesperson coordination are in place."
        ],
        "tags": [
          "figure skating",
          "Vadym Kolesnik",
          "Emilia Zingas",
          "Apolo Ohno",
          "Making Team USA",
          "Xfinity",
          "Winter Olympics",
          "Team USA",
          "sports interview"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI już teraz zmienia podejście do cen transferowych — od monitorowania rentowności i analiz porównawczych po automatyzację dokumentacji. W podcaście eksperci KPMG, Monika Palmowska i Jakub Roszkiewicz, omawiają praktyczne zastosowania AI, związane z tym ryzyka (dane, bezpieczeństwo, RODO, halucynacje) oraz pierwsze kroki i filary wdrożenia.",
        "bullets": [
          "AI wspiera monitorowanie rentowności, benchmarki i automatyzację dokumentacji cen transferowych.",
          "Eksperci podkreślają, że AI wzmacnia pracę doradców, zamiast ich zastępować.",
          "Omówione są ryzyka związane z danymi, bezpieczeństwem i zgodnością z RODO oraz problem halucynacji.",
          "Wskazano bezpieczne środowisko pracy z AI (Digital Gateway) oraz integrację z ERP i inteligentne benchmarki.",
          "Pierwsze kroki to uporządkowanie procesów, rozwój kompetencji pracowników i określenie filarów wdrożenia."
        ],
        "takeaways": [
          "Zapewnij bezpieczne, zgodne z przepisami środowisko danych przed wdrożeniem narzędzi AI (np. Digital Gateway).",
          "Skoncentruj się na porządkowaniu procesów i integracji z ERP, by AI mogła efektywnie wspierać monitorowanie i benchmarki.",
          "Traktuj AI jako narzędzie wspierające personel — inwestuj w szkolenia i rozwój młodszych pracowników.",
          "Ustal zasady zarządzania danymi i kontroli jakości, by minimalizować ryzyka związane z bezpieczeństwem i halucynacjami."
        ],
        "tags": [
          "podatki",
          "AI",
          "cenytransferowe",
          "KPMG",
          "ERP",
          "dane",
          "bezpieczeństwo",
          "RODO"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Copilot is presented as a way to keep momentum across activities—whether workouts, projects, or personal goals—by stacking small wins. The message emphasizes sustaining progress through consistent, incremental achievements.",
        "bullets": [
          "Positions Copilot as a tool for maintaining momentum.",
          "Explicitly mentions workouts, projects, and personal goals.",
          "Promotes a \"stack small wins\" approach to progress.",
          "Frames the message around motivation and steady progress."
        ],
        "takeaways": [
          "So what: Encourage using Copilot to sustain momentum on long-running initiatives (e.g., upgrades, migrations) by breaking work into incremental milestones.",
          "So what: Small, repeatable wins can help maintain team morale and reduce fatigue during extended operational efforts.",
          "So what: A focus on consistent progress supports change management and helps keep timelines predictable.",
          "So what: Consider leveraging Copilot-driven prompts or reminders to reinforce daily/weekly checkpoints for operational teams."
        ],
        "tags": [
          "Microsoft Copilot",
          "Copilot",
          "small wins",
          "momentum",
          "productivity",
          "motivation",
          "workouts",
          "projects",
          "personal goals",
          "habit-building"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video emphasizes how the Dell PowerEdge R770AP server powered by Intel® Xeon® 6 processors provides the precision and speed needed for high-frequency trading, executing hundreds of trades in seconds to help maximize gains and minimize losses. It frames Intel Xeon 6 CPUs as a high-performance technology shaping the future of finance.",
        "bullets": [
          "Showcases Dell PowerEdge R770AP equipped with Intel® Xeon® 6 processors.",
          "Emphasizes precision and speed as critical for high-frequency trading.",
          "Claims the setup can perform hundreds of trades in seconds to maximize gains and minimize losses.",
          "Directs viewers to Intel Business resources and subscription links."
        ],
        "takeaways": [
          "For HFT workloads, prioritize low-latency, high-performance servers—example given: PowerEdge R770AP with Intel Xeon 6.",
          "Plan infrastructure to support hundreds of trades per second and validate measured performance.",
          "Use vendor resources (Intel Business) for guidance when deploying finance-focused IT solutions.",
          "Processor selection is presented as a central factor in future finance and trading infrastructure decisions."
        ],
        "tags": [
          "High-Frequency Trading",
          "HFT",
          "Intel Xeon 6",
          "Dell PowerEdge R770AP",
          "Low Latency",
          "Server Performance",
          "Finance Infrastructure",
          "Intel Business"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video presents Copilot as bringing back the creative spark and invites viewers to download and try it via the link in the bio. It's a short promotional message positioning Copilot as a creativity-restoring tool.",
        "bullets": [
          "Promotes Copilot as reviving creativity.",
          "Direct call to action: download and try via link in bio.",
          "Short promotional clip with no transcript available.",
          "Message is concise and focused on user trial."
        ],
        "takeaways": [
          "The promotional call to download may drive user interest—monitor adoption and support requests if staff begin using Copilot.",
          "A direct-download push suggests potential increases in managed endpoints—review software policies and capacity planning accordingly.",
          "Because the message is promotional and brief, validate Copilot’s claimed benefits through a controlled pilot before broad rollout."
        ],
        "tags": [
          "Copilot",
          "Creativity",
          "AI assistant",
          "Download",
          "Microsoft Copilot",
          "Promo",
          "Productivity",
          "LinkInBio"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this clip showcases Where Winds Meet, an open-world martial arts RPG, running with DLSS 4 featuring Multi Frame Generation and #RTXOn. The footage is credited to @DigitalDreamsyt.",
        "bullets": [
          "Open-world martial arts RPG: Where Winds Meet",
          "Uses DLSS 4 with Multi Frame Generation",
          "Presented with #RTXOn (ray tracing enabled)",
          "Video credit: @DigitalDreamsyt"
        ],
        "takeaways": [
          "The content highlights use of DLSS 4 with Multi Frame Generation—consider ensuring infrastructure and drivers support NVIDIA's DLSS 4 features.",
          "RTXOn indicates ray-tracing is showcased—plan for GPUs that provide NVIDIA RTX capabilities where relevant.",
          "For virtualized or cloud gaming deployments, verify compatibility with NVIDIA SDKs and hardware required to deliver DLSS and ray-tracing features."
        ],
        "tags": [
          "WhereWindsMeet",
          "DLSS4",
          "MultiFrameGeneration",
          "RTXOn",
          "OpenWorld",
          "MartialArtsRPG",
          "NVIDIA",
          "DigitalDreamsyt",
          "Gameplay"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This Intel Business video features Taha Khalifa and points viewers to subscribe and access Intel Business resources. The channel offers IT resources, guidance, and expert insights covering topics from data centers to devices to help get IT projects done right.",
        "bullets": [
          "Video title: \"Taha Khalifa (Intel) | Intel Business\" with no transcript available.",
          "Encourages subscribing to the Intel Business YouTube channel.",
          "Intel Business provides resources, guidance, and expert insights for IT projects.",
          "Covers a range of topics from data centers to devices.",
          "Provides links to the Intel Business website and social channels (X, LinkedIn, Facebook)."
        ],
        "takeaways": [
          "Use Intel Business as a centralized source of guidance and expert insight when planning or running data center projects.",
          "Accessing the channel and website can help teams find resources to reduce risk and improve execution of IT projects.",
          "Follow Intel Business social channels to stay updated on guidance spanning both devices and data center considerations."
        ],
        "tags": [
          "Intel Business",
          "Intel",
          "Taha Khalifa",
          "IT resources",
          "data center",
          "devices",
          "IT projects",
          "Intel Business Center",
          "YouTube",
          "guidance"
        ]
      }
    }
  ]
}