{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-30T03:12:33.072Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "oQtkaHzUYlY",
      "title": "Copilot helps Christa find her inner star 🌟",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-29T18:33:49.000Z",
      "url": "https://www.youtube.com/watch?v=oQtkaHzUYlY",
      "thumbnail": "https://i.ytimg.com/vi/oQtkaHzUYlY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the short video frames Copilot as helping Christa “find the star within” against imagery of a sky full of stars, conveying an uplifting, personal message. The description includes a direct call-to-action inviting viewers to download and try Copilot via the link in the bio.",
        "bullets": [
          "Uplifting, personal message: Copilot helps Christa 'find the star within.'",
          "Visual motif: a sky full of stars.",
          "Promotional call-to-action: download and try Copilot via link in bio.",
          "Posted by the Microsoft Copilot channel.",
          "No transcript or technical details provided in the description."
        ],
        "takeaways": [
          "This is consumer-facing marketing content rather than technical or infrastructure-focused material.",
          "Includes a clear CTA to drive user trials and adoption of Copilot.",
          "No operational, performance, or deployment information for grid/data center planning is provided.",
          "Messaging emphasizes brand and user empowerment, which may influence broader stakeholder perception but not technical decisions."
        ],
        "tags": [
          "Microsoft Copilot",
          "Christa",
          "empowerment",
          "stars",
          "promotional",
          "download",
          "call-to-action",
          "social-media",
          "brand"
        ]
      }
    },
    {
      "id": "2GZM7wOHFcg",
      "title": "Follow the carbon, find the money: Turning sustainability into financial value",
      "channel": "PwC US",
      "published_at": "2026-01-29T18:04:28.000Z",
      "url": "https://www.youtube.com/watch?v=2GZM7wOHFcg",
      "thumbnail": "https://i.ytimg.com/vi/2GZM7wOHFcg/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Rich Goode, Sustainability Principal at PwC US, explains that linking carbon reduction to financial impact makes sustainability tangible for business leaders. He says translating emissions outcomes into cost savings and business value—and understanding carbon accounting—helps move sustainability from ambition to action and secures alignment and investment.",
        "bullets": [
          "Carbon figures can feel abstract; financial framing makes them relatable to leaders.",
          "Translate emissions outcomes into cost savings and business value to drive action.",
          "Understanding carbon accounting fundamentals is essential for credible communication.",
          "Communicate sustainability in business terms to secure alignment and investment.",
          "Financially framed sustainability helps move initiatives from ambition to measurable results."
        ],
        "takeaways": [
          "Quantify emissions impacts in financial terms to justify sustainability investments and budget allocation.",
          "Build carbon accounting capability so emissions outcomes can be credibly translated into cost metrics.",
          "Frame proposals in ROI/cost‑savings language to gain executive buy-in and funding.",
          "Use finance-aligned metrics to drive operational implementation and measurable results."
        ],
        "tags": [
          "sustainability",
          "carbon accounting",
          "financial value",
          "ESG",
          "emissions",
          "cost savings",
          "leadership",
          "operational resilience",
          "PwC",
          "strategy"
        ]
      }
    },
    {
      "id": "BYtYm-xyKR8",
      "title": "Bringing In $251K A Year With 3 Jobs In The Bay Area",
      "channel": "CNBC Make It",
      "published_at": "2026-01-29T17:47:46.000Z",
      "url": "https://www.youtube.com/watch?v=BYtYm-xyKR8",
      "thumbnail": "https://i.ytimg.com/vi/BYtYm-xyKR8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Naseema McElroy, a 44-year-old labor and delivery nurse in Brentwood, California, started a personal finance brand called Financially Intentional after accumulating nearly $1 million in debt in 2015. The profile says she was debt-free by 2017 and the video title notes she brings in $251K a year from three jobs in the Bay Area.",
        "bullets": [
          "Naseema McElroy, 44, is a labor and delivery nurse and founder of Financially Intentional.",
          "Accumulated nearly $1 million in debt in 2015 and began documenting her debt-payoff journey.",
          "Reportedly debt-free by 2017.",
          "Video title highlights $251K annual income from three jobs in the Bay Area.",
          "Segment is part of CNBC Make It's Millennial Money series; full production credits listed in description."
        ],
        "takeaways": [
          "This profile provides a concrete Bay Area example of someone earning $251K annually across multiple jobs—use as a region-specific data point when benchmarking compensation.",
          "The subject monetized a personal finance brand (Financially Intentional) while working clinically—consider how employee side businesses might interact with company policies.",
          "A documented debt-payoff (nearly $1M to debt-free by 2017) underscores varied employee financial situations—evaluate financial-wellness offerings accordingly.",
          "Public media profiles like this can surface individual financial strategies and expectations; they may be useful references when assessing workforce narratives."
        ],
        "tags": [
          "NaseemaMcElroy",
          "labor-and-delivery",
          "nurse",
          "FinanciallyIntentional",
          "debt-payoff",
          "BayArea",
          "multiple-jobs",
          "personal-finance",
          "CNBCMakeIt",
          "MillennialMoney"
        ]
      }
    },
    {
      "id": "t6y2cVNjCAw",
      "title": "GeForce Garage - Summer of RTX Community Build",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-29T14:01:25.000Z",
      "url": "https://www.youtube.com/watch?v=t6y2cVNjCAw",
      "thumbnail": "https://i.ytimg.com/vi/t6y2cVNjCAw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This GeForce Garage video highlights the winner of the Summer of RTX r/buildapc Community Build (u/JeffersonPutnam) who assembled a small-form-factor rig built around a GeForce RTX 5090 Founders Edition. The posted parts list includes a Fractal Design Era 2 chassis, MSI MPG B850I Edge motherboard, Ryzen 7 9800X3D CPU, 32GB DDR5-6000 RAM, Corsair SF1000 PSU, and Corsair Nautilus 240 RS AIO.",
        "bullets": [
          "Winner: u/JeffersonPutnam — Summer of RTX r/buildapc community build",
          "GPU: GeForce RTX 5090 Founders Edition",
          "Chassis: Fractal Design Era 2 (SFF) with Corsair Nautilus 240 RS AIO",
          "CPU/RAM: Ryzen 7 9800X3D with 32GB Teamgroup T-Create Expert DDR5-6000",
          "Power: Corsair SF1000; full parts list on PCPartPicker"
        ],
        "takeaways": [
          "Includes a top-tier consumer GPU (GeForce RTX 5090 Founders Edition) — relevant when assessing high-performance GPU options for workstation or dense node deployments.",
          "Small-form-factor chassis (Fractal Design Era 2) paired with a 1000W SFX PSU and a 240mm AIO highlights power and cooling considerations for compact high-performance builds.",
          "Platform uses MSI MPG B850I Edge (mini-ITX) and modern DDR5-6000 memory — useful reference for compact, high-throughput single-node configurations.",
          "Full component list is available via the provided PCPartPicker link for exact part compatibility and procurement planning."
        ],
        "tags": [
          "GeForceGarage",
          "RTX5090",
          "SmallFormFactor",
          "SFF",
          "Ryzen7",
          "9800X3D",
          "DDR5",
          "BuildAPC",
          "SummerOfRTX"
        ]
      }
    },
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy GenAI solutions, which unlocked new revenue streams and accelerated their digital transformation. Sreeni Alakappan highlights how Google Cloud's infrastructure helped streamline operations and boost developer productivity while compressing the timeline for AI adoption.",
        "bullets": [
          "TTEC used Google Cloud Consulting to quickly prototype and roll out AI solutions.",
          "Generative AI and robust cloud infrastructure streamlined operations.",
          "Developer productivity improved through the cloud-enabled toolchain.",
          "The initiative opened entirely new revenue streams for TTEC.",
          "Consulting helped compress the digital transformation timeline and expand business ambitions."
        ],
        "takeaways": [
          "Cloud consulting can shorten AI adoption timelines—valuable when rapid deployment matters.",
          "Robust cloud infrastructure supports operational efficiency and developer productivity gains.",
          "Prototyping speed can translate directly into new revenue opportunities.",
          "Partnering with cloud experts can broaden what’s feasible for business transformation."
        ],
        "tags": [
          "Google Cloud",
          "TTEC",
          "GenAI",
          "Google Cloud Consulting",
          "AI deployment",
          "operational efficiency",
          "customer experience",
          "developer productivity",
          "digital transformation",
          "revenue streams"
        ]
      }
    },
    {
      "id": "gv6zK265OUE",
      "title": "Build your first GraphRAG Powered Agent! (No Graph Expert Required) | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-27T20:55:49.000Z",
      "url": "https://www.youtube.com/watch?v=gv6zK265OUE",
      "thumbnail": "https://i.ytimg.com/vi/gv6zK265OUE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this AWS Events session demonstrates how to build a GraphRAG-powered knowledge graph quickly using familiar AI tools, with a live demo that uses real documents. The presenters show a practical, short-path approach (no six-month project) and provide a sample notebook for hands-on use.",
        "bullets": [
          "Knowledge in docs, PDFs, and wikis is often unusable by models without structured graphs.",
          "Knowledge graphs (GraphRAG) can unlock that text for reasoning and retrieval.",
          "Most teams avoid building graphs because it sounds large-scale—this talk argues it can be done in an afternoon.",
          "Live demo uses real documents to show end-to-end build steps.",
          "Sample notebook is provided for replication: https://aws-neptune-customer-samples-us-east-1.s3.us-east-1.amazonaws.com/sample-notebooks/graphrag-powered-agent/Build_your_first_GraphRAG_Powered_Agent.ipynb"
        ],
        "takeaways": [
          "Quick wins: teams can extract actionable knowledge from operational documents without long multi-month projects.",
          "Faster decision support: turning existing docs into a queryable graph can improve access to institutional knowledge.",
          "Lower implementation barrier: uses familiar AI tooling and a provided sample notebook to reduce development time.",
          "Practical demo and code accelerate pilot deployments and reduce proof-of-concept friction."
        ],
        "tags": [
          "GraphRAG",
          "knowledge-graph",
          "AWS-Neptune",
          "RAG",
          "AI",
          "documents",
          "live-demo",
          "sample-code",
          "knowledge-management",
          "databases-for-AI"
        ]
      }
    },
    {
      "id": "azzmtqcIeCU",
      "title": "Cloud Cost Efficiency I The Keys to AWS Optimization | S16 E2",
      "channel": "AWS Events",
      "published_at": "2026-01-27T10:14:44.000Z",
      "url": "https://www.youtube.com/watch?v=azzmtqcIeCU",
      "thumbnail": "https://i.ytimg.com/vi/azzmtqcIeCU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this livestream examines the key metrics that drive AWS cost efficiency, including cost per transaction, resource utilization rates, and ROI calculations. It explains how to measure, track, and optimize AWS spending with metrics frameworks, benchmarking, and dashboards to align technical performance with business outcomes.",
        "bullets": [
          "Covers essential KPIs: cost per transaction, utilization rates, and ROI.",
          "Shows methods to measure and track cloud spending effectively.",
          "Explains metrics frameworks that align technical and business goals.",
          "Provides practical benchmarking and cost-optimization techniques.",
          "Guides on building dashboards to communicate value to stakeholders."
        ],
        "takeaways": [
          "Prioritize KPIs (e.g., cost per transaction) to link cloud spend to business value.",
          "Monitor resource utilization rates to identify overprovisioning and savings opportunities.",
          "Use ROI calculations to rank and justify cost-optimization efforts.",
          "Benchmark performance to set targets and measure improvement.",
          "Create stakeholder-facing dashboards to demonstrate the impact of optimization work."
        ],
        "tags": [
          "AWS",
          "CloudCosts",
          "FinOps",
          "CostOptimization",
          "CloudMetrics",
          "AWSCostManagement",
          "CloudEfficiency",
          "Benchmarking",
          "ROI",
          "Dashboards"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Jo discovers the power of Copilot Groups and how it makes route planning easy. The short blurb highlights Copilot Groups as a route-planning aid and tags the content as related to Copilot and AI.",
        "bullets": [
          "Route planning made easy is the core message.",
          "Jo is the user discovering Copilot Groups.",
          "Focus is on the power of Copilot Groups for routing.",
          "Description includes hashtags: copilot, microsoftcopilot, ai."
        ],
        "takeaways": [
          "Copilot Groups is presented as a tool that makes route planning easier—consider its relevance if your operations include routing or field teams.",
          "Assess whether the route-planning approach shown aligns with your dispatch, maintenance, or logistics workflows.",
          "Think about integration: evaluate how Copilot Groups might fit with existing operational and scheduling tools.",
          "The tags position this as part of the Copilot/AI ecosystem—factor vendor and ecosystem fit into any trial or evaluation."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "route-planning",
          "copilot-groups",
          "jo"
        ]
      }
    }
  ]
}