{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-21T02:39:12.980Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "jOC3G_N20lY",
      "title": "Year-end toolkit: Cash flow classification",
      "channel": "PwC US",
      "published_at": "2026-01-20T22:41:11.000Z",
      "url": "https://www.youtube.com/watch?v=jOC3G_N20lY",
      "thumbnail": "https://i.ytimg.com/vi/jOC3G_N20lY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this PwC year-end toolkit episode focuses on the statement of cash flows, emphasizing its continued importance to investors and regulatory scrutiny. The discussion covers SEC comment letter themes, practical considerations for debt restructurings, payment processing arrangements, and business combinations, plus reminders, best practices, and a note on the FASB project regarding targeted improvements to the statement of cash flows.",
        "bullets": [
          "Overview and key reminders for preparing the statement of cash flows.",
          "SEC comment letter themes and areas of regulatory focus.",
          "Practical considerations for cash flow treatment of debt restructurings.",
          "Guidance on payment processing arrangements and business combination cash flow classification.",
          "Update on the FASB project for targeted improvements to the statement of cash flows."
        ],
        "takeaways": [
          "Investors and regulators are focused on cash flow presentation—ensure transparent, consistent classification and disclosures.",
          "Complex transactions (debt restructurings, payment arrangements, business combinations) require careful cash flow analysis at year-end.",
          "Address common SEC comment themes proactively to reduce review risk and improve filings.",
          "Monitor the FASB targeted-improvements project and be prepared to update policies and disclosures accordingly."
        ],
        "tags": [
          "statement of cash flows",
          "cash flow classification",
          "SEC comment letters",
          "debt restructuring",
          "payment processing",
          "business combinations",
          "FASB",
          "year-end reporting",
          "PwC",
          "financial reporting"
        ]
      }
    },
    {
      "id": "3wQ_yte0TTo",
      "title": "Build Voice Agents with Amazon Nova 2 Sonic &amp; AgentCore | AWS Show and Tell",
      "channel": "AWS Events",
      "published_at": "2026-01-20T22:10:10.000Z",
      "url": "https://www.youtube.com/watch?v=3wQ_yte0TTo",
      "thumbnail": "https://i.ytimg.com/vi/3wQ_yte0TTo/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This episode introduces Amazon Nova 2 Sonic and Amazon Bedrock AgentCore enhancements for building advanced voice agents, highlighting polyglot voices, a 1‑million token context window, asynchronous tool calling, and WebSocket bidirectional streaming. It also covers Strands BidiAgent integration and provides hands-on Python demos and workshop code for developers.",
        "bullets": [
          "Nova 2 Sonic: polyglot voices, 1M token context windows, and asynchronous tool calling",
          "AgentCore bidirectional (WebSocket) streaming for real-time two-way voice interactions",
          "Strands BidiAgent integration for interruption handling and agent-to-agent collaboration",
          "Hands-on Python implementation examples and best practices for production-ready agents",
          "Workshop materials and code samples available on the provided GitHub repo"
        ],
        "takeaways": [
          "Polyglot voices and large context windows enable richer, multilingual conversational experiences",
          "WebSocket bidirectional streaming supports ultra-responsive, two-way voice interactions",
          "Asynchronous tool calling and agent-to-agent collaboration support more complex agent workflows",
          "Hands-on Python demos and workshop code ease developer adoption and implementation"
        ],
        "tags": [
          "Amazon Nova 2",
          "Nova Sonic",
          "AgentCore",
          "Bedrock",
          "Strands BidiAgent",
          "bidirectional streaming",
          "voice agents",
          "speech-to-speech",
          "Python",
          "workshop"
        ]
      }
    },
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video shows how Rate Insurance boosts agent efficiency using Agentforce and Gemini. It is presented by Google Cloud and includes a link to the Google Cloud and Salesforce partnership for more information.",
        "bullets": [
          "Demonstration of Rate Insurance improving agent efficiency with Agentforce and Gemini.",
          "Published by the Google Cloud channel.",
          "References the Google Cloud & Salesforce partnership (link provided).",
          "No transcript is available for this video."
        ],
        "takeaways": [
          "This is an example of a cloud-provider and CRM partnership applied to agent workflows—review the partnership link to understand integration scope.",
          "Decision-makers should consider whether existing infrastructure can support integrated cloud+CRM solutions showcased here.",
          "Assess networking, scalability, and operational requirements if deploying similar agent-facing services.",
          "Verify compatibility and integration requirements for any third-party tools (Agentforce, Gemini) before deployment."
        ],
        "tags": [
          "Rate Insurance",
          "Agentforce",
          "Gemini",
          "Google Cloud",
          "Salesforce",
          "agent efficiency",
          "partnership",
          "CRM",
          "cloud"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Charly Stoever, a 35-year-old financial coach in Portland, Oregon, lives rent-free by pet sitting full time and has spent the past 18 months living out of two suitcases while earning $60,000 a year. The story is part of CNBC Make It's Millennial Money series profiling how people earn, spend and save.",
        "bullets": [
          "Charly Stoever, 35, is a financial coach living rent-free in Portland by pet sitting full time.",
          "She has lived out of two suitcases for the last 18 months.",
          "Her annual income from this lifestyle is $60,000.",
          "This profile is part of CNBC Make It's Millennial Money series.",
          "Produced and reported by CNBC Make It team (producer, editor, camera, animator credited)."
        ],
        "takeaways": [
          "Location-independent professionals like the subject rely on consistent digital access and services; prioritize network reliability and uptime.",
          "Content that highlights alternative, mobile lifestyles can drive demand for scalable streaming and storage resources.",
          "Flexible, on-demand service models (billing, provisioning) may better serve users with nomadic or transient living arrangements.",
          "Operational resilience and distributed capacity planning remain important to support geographically mobile customer behaviors."
        ],
        "tags": [
          "pet sitting",
          "rent-free",
          "Portland",
          "financial coach",
          "travel",
          "digital nomad",
          "CNBC Make It",
          "Millennial Money",
          "60k",
          "two suitcases"
        ]
      }
    },
    {
      "id": "wicD8G0rn1Y",
      "title": "New: AWS Lambda tenant isolation | Serverless Office Hours",
      "channel": "AWS Events",
      "published_at": "2026-01-20T15:40:24.000Z",
      "url": "https://www.youtube.com/watch?v=wicD8G0rn1Y",
      "thumbnail": "https://i.ytimg.com/vi/wicD8G0rn1Y/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video demonstrates AWS Lambda's new tenant isolation mode for building secure multi-tenant SaaS applications. It explains how dedicated execution environments per tenant silo cached data and execution contexts, simplifies infrastructure, enables faster scaling during traffic spikes, and includes automatic tenant identifier logging for easier debugging.",
        "bullets": [
          "Tenant isolation mode provides dedicated execution environments per tenant.",
          "Siloes cached data and execution contexts to prevent cross-tenant exposure.",
          "Aims to reduce infrastructure complexity while maintaining strong isolation guarantees.",
          "Enables faster scaling during traffic spikes and includes automatic tenant identifier logging for debugging.",
          "Presented by Julian Wood with guests Anton Aleksandrov and Ayush Kulkarni from AWS."
        ],
        "takeaways": [
          "Stronger isolation guarantees support security and data-siloing requirements for multi-tenant SaaS.",
          "Reduced infrastructure complexity can lower operational burden for serverless deployments.",
          "Faster scaling during spikes helps maintain availability under variable tenant load.",
          "Built-in tenant identifier logging simplifies tenant-specific debugging and incident response."
        ],
        "tags": [
          "aws-lambda",
          "tenant-isolation",
          "multi-tenant",
          "serverless",
          "security",
          "scaling",
          "monitoring",
          "saaS"
        ]
      }
    },
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Dr. Anna Chacon, 39, is a dermatologist in Miami, FL who runs her own private practice. Her net worth is about $6 million, comprised of $3.2 million in investments, a $1.9 million home, and a $1.1 million office building.",
        "bullets": [
          "Dr. Anna Chacon, age 39, is a dermatologist based in Miami, Florida.",
          "She operates a private dermatology practice.",
          "Estimated net worth: approximately $6 million.",
          "Investments total about $3.2 million.",
          "Real estate holdings include a $1.9 million home and a $1.1 million office building."
        ],
        "takeaways": [
          "Ownership of a $1.1M office building highlights that small medical commercial properties can be part of local commercial load profiles.",
          "Presence in Miami, FL suggests regional factors (e.g., cooling demand) may affect electricity needs for similar professional practices.",
          "Private practices that combine residential and commercial real estate holdings may represent distinct behind-the-meter or on-site energy opportunities.",
          "High-net-worth professionals who own commercial space could be relevant stakeholders for local grid upgrades, distributed energy, or resilience planning."
        ],
        "tags": [
          "dermatologist",
          "Miami",
          "private practice",
          "net worth",
          "investments",
          "real estate",
          "office building",
          "personal finance",
          "Dr. Anna Chacon"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video presents a giant bubble of carbon dioxide used as a battery that can store 20 megawatts and provide about eight hours of energy. It frames the technology as a way to manage fluctuating renewable generation and help drive a global shift to clean energy.",
        "bullets": [
          "Uses a giant carbon dioxide bubble as an energy storage medium",
          "Storage capability reported as 20 megawatts",
          "Duration described as roughly eight hours of energy",
          "Aimed at addressing variability in renewable power",
          "Positioned to support the transition to clean energy worldwide"
        ],
        "takeaways": [
          "Offers multi-hour, megawatt-scale storage that could help balance intermittent renewables for grids",
          "Eight-hour duration suggests potential for overnight or extended backup capacity for critical loads",
          "Utility-scale 20 MW capacity may be relevant when evaluating options for decarbonization and resilience",
          "Decision-makers should consider emerging long-duration storage approaches as part of clean-energy planning"
        ],
        "tags": [
          "ieee",
          "tech",
          "energy",
          "battery",
          "innovation",
          "carbon-dioxide",
          "storage",
          "renewable",
          "future"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the KPMG ON AIR podcast with Monika Palmowska and Jakub Roszkiewicz discusses how AI is already reshaping transfer pricing — from monitoring profitability and comparative analyses to automating documentation — while highlighting risks like data security and GDPR. The episode emphasizes that AI will augment, not replace, tax advisors and recommends starting AI implementations by organizing processes, ensuring secure environments, and integrating with ERP systems.",
        "bullets": [
          "AI uses covered: profitability monitoring, benchmarking, and documentation automation.",
          "AI complements tax advisors' work rather than replacing them.",
          "Key risks include data privacy, security, RODO compliance, and AI hallucinations.",
          "Secure workspaces (e.g., Digital Gateway) and ERP integration are highlighted as enablers.",
          "Recommended first steps: process cleanup and building implementation pillars for AI."
        ],
        "takeaways": [
          "Provide secure, compliant infrastructure for AI workloads (consider isolated environments like Digital Gateway).",
          "Strengthen data governance and GDPR-compliant handling before deploying AI for tax processes.",
          "Ensure ERP and data pipelines can integrate with AI tools to support benchmarks and monitoring.",
          "Plan for staff upskilling and role shifts as automation reduces manual documentation work.",
          "Start AI projects with process standardization as the foundation to enable reliable automation."
        ],
        "tags": [
          "AI",
          "transfer pricing",
          "tax",
          "automation",
          "data security",
          "ERP integration",
          "compliance",
          "process transformation",
          "Digital Gateway"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Microsoft Copilot is presented as a tool to help users maintain momentum across activities like workouts, projects, and personal goals. The short message encourages stacking small wins to sustain progress with Copilot.",
        "bullets": [
          "Positions Copilot as a companion for keeping momentum.",
          "Targets a range of activities: workouts, projects, personal goals.",
          "Emphasizes stacking small wins to drive progress.",
          "Short, motivational promotional tone.",
          "No transcript available; message comes from the description only."
        ],
        "takeaways": [
          "So what: Copilot's focus on momentum can support gradual, continuous progress on long-term grid or data center initiatives.",
          "So what: Framing work as small wins could help operations teams maintain morale and steady progress during maintenance or upgrade projects.",
          "So what: Using Copilot to encourage incremental achievements may aid staff training and adoption of new processes.",
          "So what: A momentum-focused approach can make complex projects feel more manageable and sustain stakeholder engagement."
        ],
        "tags": [
          "Microsoft Copilot",
          "productivity",
          "momentum",
          "small wins",
          "workouts",
          "projects",
          "personal goals",
          "motivational",
          "AI assistant"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This video highlights how the Dell PowerEdge R770AP server, powered by Intel® Xeon® 6 processors, is used in high-frequency trading to deliver the precision and speed required to execute hundreds of trades in seconds. It positions Intel Xeon 6 CPUs as a high-performance technology shaping the future of finance.",
        "bullets": [
          "Focus on high-frequency trading (HFT) use case",
          "Showcases Dell PowerEdge R770AP server with Intel® Xeon® 6 processors",
          "Emphasizes precision and speed to maximize gains and minimize losses",
          "Claims capability to perform hundreds of trades in seconds",
          "Promotes Intel Business as a resource hub with links to more information"
        ],
        "takeaways": [
          "Consider Intel® Xeon® 6-based platforms for latency-sensitive trading workloads",
          "Evaluate Dell PowerEdge R770AP as a candidate hardware platform for HFT deployments",
          "Design capacity and configurations to support executing hundreds of trades in seconds",
          "Leverage Intel Business resources and vendor performance data when validating solutions"
        ],
        "tags": [
          "high-frequency-trading",
          "HFT",
          "Intel-Xeon-6",
          "Dell-PowerEdge-R770AP",
          "low-latency",
          "financial-technology",
          "data-center",
          "servers"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the short promo positions Copilot as a tool that restored a creative spark. Viewers are invited to download Copilot and try it via the link in the channel bio.",
        "bullets": [
          "Promotional message: Copilot 'brought [the creative spark] back to life.'",
          "Clear call to action to download and try Copilot.",
          "Distribution note: download link is in the channel bio.",
          "No transcript is available for the video."
        ],
        "takeaways": [
          "The video frames Copilot as a creativity-enhancing tool—consider a trial if creative output is a priority for your teams.",
          "Use the provided download link to run a hands-on evaluation before making larger adoption decisions.",
          "Keep evaluation focused on fit with existing workflows and measurable creative outcomes."
        ],
        "tags": [
          "Copilot",
          "Microsoft",
          "creativity",
          "AI",
          "productivity",
          "download",
          "promotion",
          "call-to-action",
          "link-in-bio"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video showcases the open-world martial arts RPG Where Winds Meet with DLSS 4 featuring Multi Frame Generation. It promotes experiencing the game with #RTXOn and credits @DigitalDreamsyt for the footage.",
        "bullets": [
          "Open-world martial arts RPG: Where Winds Meet",
          "Highlights DLSS 4 with Multi Frame Generation",
          "Promoted with #RTXOn",
          "Video footage credited to @DigitalDreamsyt"
        ],
        "takeaways": [
          "Confirms Where Winds Meet uses DLSS 4 with Multi Frame Generation — relevant when assessing support for NVIDIA frame-generation features.",
          "The #RTXOn emphasis indicates reliance on RTX-branded enhancements — consider GPU compatibility and driver support.",
          "Showcasing a graphically forward open-world RPG may inform performance and delivery considerations for hosting or demoing similar content."
        ],
        "tags": [
          "WhereWindsMeet",
          "DLSS4",
          "DLSS",
          "MultiFrameGeneration",
          "RTXOn",
          "open-world",
          "martial-arts",
          "RPG",
          "DigitalDreamsyt"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this Intel Business video is titled \"Taha Khalifa (Intel) | Intel Business\" and features content from the Intel Business channel. The channel offers IT resources, guidance, and expert insights covering topics from data centers to devices, and the description includes links to subscribe and follow Intel Business on multiple platforms.",
        "bullets": [
          "Video title: Taha Khalifa (Intel) | Intel Business",
          "No transcript available for this video",
          "Intel Business provides IT resources and expert insights across data centers to devices",
          "Description includes subscribe link and Intel Business website",
          "Social links listed: X (Twitter), LinkedIn, Facebook, and YouTube channel"
        ],
        "takeaways": [
          "Intel Business positions itself as a source of guidance and expert insights relevant to data center and IT decision-makers",
          "Decision-makers can visit the Intel Business website for additional resources and guidance for IT projects",
          "Subscribing and following the channel on social platforms can help stay updated on Intel-provided IT information"
        ],
        "tags": [
          "Intel",
          "Intel Business",
          "Taha Khalifa",
          "IT",
          "data centers",
          "devices",
          "IT projects",
          "IT resources",
          "technology",
          "YouTube"
        ]
      }
    }
  ]
}