{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-19T02:43:04.087Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "6L86-OnOXV0",
      "title": "How I Built A $1M/Year Business - And Helped My Parents Retire",
      "channel": "CNBC Make It",
      "published_at": "2026-01-17T15:00:09.000Z",
      "url": "https://www.youtube.com/watch?v=6L86-OnOXV0",
      "thumbnail": "https://i.ytimg.com/vi/6L86-OnOXV0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, when he was 15 Tuan Le emigrated from Vietnam to Toronto in 2015 and vowed to help his parents retire. Ten years later his social video production company, ShortsCut, generates over $1 million USD a year in sales, and he now covers his parents' rent and living expenses so they no longer work full time.",
        "bullets": [
          "Tuan Le emigrated from Vietnam to Toronto in 2015 at age 15.",
          "He vowed to help his parents retire and kept that promise.",
          "He founded ShortsCut, a social video production company.",
          "ShortsCut brings in over $1 million USD per year in sales.",
          "Le now pays his parents' rent and living expenses so they no longer work full time."
        ],
        "takeaways": [
          "Rapidly growing social video producers like ShortsCut represent an emerging commercial segment worth monitoring for service demand.",
          "Successful digital media startups can scale to seven-figure revenues within a decade, indicating potential steady customers for infrastructure and platform providers.",
          "Young and immigrant-founded companies are a notable source of growth in the digital content economy."
        ],
        "tags": [
          "Tuan Le",
          "ShortsCut",
          "CNBC Make It",
          "entrepreneurship",
          "social video",
          "immigrant founder",
          "million-dollar business",
          "family support",
          "Toronto",
          "2026"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This giant bubble of carbon dioxide can store 20 megawatts of power for about eight hours. The technology is presented as a multi-hour storage solution to help smooth renewable intermittency and support the global shift to clean energy.",
        "bullets": [
          "Giant carbon-dioxide bubble functions as a battery.",
          "Stores 20 megawatts of power for roughly 8 hours.",
          "Aimed at smoothing fluctuations from renewable energy sources.",
          "Positioned as a large-scale, multi-hour energy storage option.",
          "Presented by IEEE Spectrum as part of clean-energy innovation coverage."
        ],
        "takeaways": [
          "20 MW for ~8 hours implies a multi-hour, multi-megawatt resource suitable for sustained backup or load shifting.",
          "Can help smooth renewable intermittency—relevant for grids and data centers relying on variable renewables.",
          "Represents a large-scale storage option to consider when planning clean-energy integration.",
          "Description lacks technical, cost, deployment, and maturity details—obtain those before procurement or integration decisions."
        ],
        "tags": [
          "CO2-battery",
          "carbon-dioxide",
          "energy-storage",
          "8-hour-storage",
          "20-MW",
          "renewables",
          "clean-energy",
          "battery",
          "grid",
          "IEEE-Spectrum"
        ]
      }
    },
    {
      "id": "OINppmPan0o",
      "title": "Figure Skating | Making Team USA presented by Xfinity with Apolo Ohno",
      "channel": "Team USA",
      "published_at": "2026-01-16T19:30:36.000Z",
      "url": "https://www.youtube.com/watch?v=OINppmPan0o",
      "thumbnail": "https://i.ytimg.com/vi/OINppmPan0o/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Figure skating duo Vadym Kolesnik and Emilia Zingas sit down with Apolo Ohno on this week's episode of Making Team USA presented by Xfinity, filmed ahead of the Winter Olympics. The episode highlights their partnership being \"built on trust\" and is shared via Team USA's YouTube and social channels.",
        "bullets": [
          "Vadym Kolesnik and Emilia Zingas interviewed by Olympian Apolo Ohno.",
          "Episode is part of Making Team USA presented by Xfinity.",
          "Released in the lead-up to the Winter Olympics with the theme \"Built on trust.\"",
          "Distributed on Team USA YouTube and promoted across Team USA social platforms."
        ],
        "takeaways": [
          "Trust is a core theme—prioritize reliable partnerships and clear accountability with vendors and operators.",
          "Highlighting preparation ahead of major events underscores the need to plan for peak demand and continuity.",
          "Leverage respected spokespeople or case studies to build stakeholder confidence in infrastructure readiness.",
          "Use multimedia storytelling across channels to communicate preparedness and reliability to customers and partners."
        ],
        "tags": [
          "figure-skating",
          "Vadym Kolesnik",
          "Emilia Zingas",
          "Apolo Ohno",
          "Making Team USA",
          "Xfinity",
          "Winter Olympics",
          "Team USA",
          "interview",
          "trust"
        ]
      }
    },
    {
      "id": "RalzsofAYHM",
      "title": "29-year-old spent $20,000 to open a store in New York — now it brings in $1.6 million a year",
      "channel": "CNBC Make It",
      "published_at": "2026-01-16T17:00:48.000Z",
      "url": "https://www.youtube.com/watch?v=RalzsofAYHM",
      "thumbnail": "https://i.ytimg.com/vi/RalzsofAYHM/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Abby Price started Abbode as a Parsons grad student selling dried floral arrangements on Facebook in 2019 and opened a Nolita storefront by March 2022. Strong cashflow from the shop allowed her to buy a $15,000 embroidery machine, and the business kept a key part of its operation stored in the shop basement for a year.",
        "bullets": [
          "Founded while Price was a graduate student at Parsons School of Design.",
          "Started selling dried floral arrangements to New York locals on Facebook in 2019.",
          "Opened a physical storefront in Nolita by March 2022.",
          "Shop generated enough cashflow to finance a $15,000 embroidery machine bought on a whim.",
          "An important element of the business remained stored in the shop’s basement for a year."
        ],
        "takeaways": [
          "Small urban retail ventures can become cashflow-positive and make capital investments—monitor local small-business growth as a signal for changing commercial needs.",
          "Physical storefronts in dense neighborhoods can be important revenue drivers—include retail trends in urban infrastructure and capacity planning.",
          "Unexpected equipment purchases by growing businesses suggest the value of flexible provisioning for commercial tenants and customers."
        ],
        "tags": [
          "Abbode",
          "Abby Price",
          "Parsons School of Design",
          "dried floral",
          "Nolita",
          "storefront",
          "embroidery machine",
          "small business",
          "cashflow",
          "Facebook"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI już wpływa na procesy związane z cenami transferowymi — od monitorowania rentowności i porównań benchmarkingowych, przez automatyzację dokumentacji, aż po integrację z systemami ERP. W podcaście eksperci KPMG omawiają korzyści, ograniczenia i ryzyka (dane, bezpieczeństwo, RODO) oraz praktyczne kroki wdrożeniowe i konieczność uporządkowania procesów przed zastosowaniem AI.",
        "bullets": [
          "AI wspiera monitorowanie rentowności, analizy porównawcze i automatyzację dokumentacji cen transferowych.",
          "Eksperci podkreślają, że AI wzmacnia pracę doradców, ale ich nie zastąpi.",
          "Ryzyka obejmują kwestie danych, bezpieczeństwa, RODO oraz problem halucynacji modeli.",
          "Rozwiązania bezpieczne do pracy z AI (np. Digital Gateway) są rekomendowane.",
          "Wdrożenie powinno zaczynać się od uporządkowania procesów, integracji z ERP i zdefiniowania person."
        ],
        "takeaways": [
          "Zainwestuj w porządkowanie procesów i dane przed implementacją AI — to fundament skutecznej transformacji IT.",
          "Planuj integrację AI z ERP i systemami finansowymi, aby uzyskać wartościowe, automatyczne benchmarki i raporty.",
          "Priorytetem są bezpieczeństwo danych i zgodność z RODO — rozważ bezpieczne środowiska pracy z AI (np. Digital Gateway).",
          "Automatyzacja dokumentacji i monitoringu może zmniejszyć nakład pracy operacyjnej oraz poprawić kontrolę rentowności."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "transfer-pricing",
          "automatyzacja",
          "ERP",
          "bezpieczeństwo",
          "RODO",
          "benchmarki",
          "KPMG"
        ]
      }
    },
    {
      "id": "dGfcT63U7Mo",
      "title": "The 2026 U.S. Olympic Figure Skating Team 🇺🇸",
      "channel": "Team USA",
      "published_at": "2026-01-15T20:43:24.000Z",
      "url": "https://www.youtube.com/watch?v=dGfcT63U7Mo",
      "thumbnail": "https://i.ytimg.com/vi/dGfcT63U7Mo/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this Team USA video announces the U.S. Olympic Figure Skating lineup for the 2026 Winter Olympics. No transcript is available; the description only states: \"This U.S. Olympic Figure Skating lineup. 🔥 #WinterOlympics.\"",
        "bullets": [
          "Title: The 2026 U.S. Olympic Figure Skating Team 🇺🇸",
          "Channel: Team USA",
          "Published: 2026-01-15T20:43:24.000Z",
          "Description contains only a brief lineup announcement with a flame emoji and #WinterOlympics",
          "No transcript available"
        ],
        "takeaways": [
          "Event-related announcement content (Olympics) may drive short-term spikes in viewership—plan for potential increased load around the publish date and Olympic timeframe.",
          "Ensure CDN caching and video delivery optimizations are in place to minimize latency for geographically distributed viewers.",
          "Monitor playback metrics and error rates immediately after publication so capacity can be scaled quickly if demand rises.",
          "Align caching TTLs and promotion timelines so updated metadata or reuploads propagate efficiently during the event window."
        ],
        "tags": [
          "figure skating",
          "Team USA",
          "WinterOlympics",
          "2026 Olympics",
          "U.S. Olympic Team",
          "sports",
          "lineup announcement",
          "Olympics announcement"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video positions Microsoft Copilot as a helper for sustaining momentum across workouts, projects, and personal goals. It encourages building progress by stacking small wins with Copilot.",
        "bullets": [
          "Presents Copilot as a tool to keep momentum going.",
          "Targets workouts, projects, and personal goals.",
          "Focuses on stacking small wins to maintain progress.",
          "Short, motivational message from the Microsoft Copilot channel.",
          "Encourages consistent, incremental progress."
        ],
        "takeaways": [
          "Maintaining steady momentum is valuable for long-term initiatives such as upgrades, migrations, or recurring operations.",
          "Emphasizing small, consistent wins can help improve project completion rates and sustain team engagement.",
          "Assistant tools that support ongoing progress may help keep operational tasks, schedules, and documentation from stalling.",
          "Framing change as incremental progress can ease stakeholder buy-in for new workflows or automation efforts."
        ],
        "tags": [
          "Microsoft Copilot",
          "Copilot",
          "productivity",
          "momentum",
          "small wins",
          "workouts",
          "projects",
          "personal goals",
          "AI assistant"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights how the Dell PowerEdge R770AP server powered by Intel® Xeon® 6 processors delivers the precision and speed required for high-frequency trading. It says these capabilities help maximize gains and minimize losses by executing hundreds of trades in seconds and positions Intel Xeon 6 CPUs as shaping the future of finance.",
        "bullets": [
          "Focuses on high-frequency trading where every second counts.",
          "Showcases Dell PowerEdge R770AP server with Intel® Xeon® 6 processors.",
          "Emphasizes precision and speed to execute hundreds of trades in seconds.",
          "Claims these capabilities help maximize gains and minimize losses.",
          "Positions Intel Xeon 6 CPUs as defining the future of finance."
        ],
        "takeaways": [
          "For time-sensitive trading workloads, prioritize platforms emphasizing precision and speed.",
          "Consider Dell PowerEdge R770AP with Intel Xeon 6 as a candidate for HFT deployments.",
          "High-performance CPUs can directly affect trade execution speed and potential financial outcomes.",
          "Evaluate server and CPU performance specifically for low-latency, high-throughput trading tasks."
        ],
        "tags": [
          "high-frequency-trading",
          "HFT",
          "Dell-PowerEdge-R770AP",
          "Intel-Xeon-6",
          "low-latency",
          "finance",
          "data-center",
          "servers",
          "high-performance",
          "Intel-Business"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the short promotional video says Copilot restored a creative spark. It invites viewers to download Copilot and try it via the link in the bio.",
        "bullets": [
          "Promotional clip from Microsoft Copilot emphasizing renewed creativity.",
          "Core message: Copilot brought creativity back to life.",
          "Call to action: download and try Copilot via link in bio.",
          "Published by Microsoft Copilot on 2026-01-14."
        ],
        "takeaways": [
          "If your team is seeking fresh ideas, consider a hands-on trial of Copilot to explore creative approaches to documentation or planning.",
          "The quick call-to-action (link in bio) suggests low-friction access—use a small pilot to assess fit before wider adoption.",
          "Treat initial use as an experimentation phase to evaluate whether Copilot-generated ideas align with operational requirements and compliance constraints.",
          "Use trial findings to inform whether Copilot could complement existing workflows for design, troubleshooting, or knowledge capture."
        ],
        "tags": [
          "Copilot",
          "Microsoft",
          "AI",
          "Creativity",
          "Productivity",
          "Download",
          "Inspiration",
          "Call-to-action",
          "2026"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This short video highlights the open-world martial arts RPG Where Winds Meet running with DLSS 4 and Multi Frame Generation and with RTX enabled. The clip is credited to @DigitalDreamsyt.",
        "bullets": [
          "Open-world martial arts RPG: Where Winds Meet",
          "Showcases DLSS 4 with Multi Frame Generation",
          "Highlights RTX On visuals",
          "Invites viewers to experience the game",
          "Video credit: @DigitalDreamsyt"
        ],
        "takeaways": [
          "Support for DLSS 4 and Multi Frame Generation should be considered when provisioning GPU-accelerated infrastructure",
          "Ensure driver and software stacks in the data center are compatible with NVIDIA RTX and DLSS features",
          "Plan capacity and scheduling for workloads that leverage advanced frame-generation and RTX-enabled rendering"
        ],
        "tags": [
          "Where Winds Meet",
          "DLSS 4",
          "Multi Frame Generation",
          "RTXOn",
          "open-world",
          "martial-arts",
          "DigitalDreamsyt",
          "game",
          "graphics"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this YouTube video is from Intel Business and features Taha Khalifa. The Intel Business channel positions itself as a source of IT information and resources—covering topics from data centers to devices—and includes links to the Intel Business website and social channels for more guidance and expert insights.",
        "bullets": [
          "Video posted on the Intel Business YouTube channel featuring Taha Khalifa.",
          "Channel offers IT resources and expert guidance spanning data centers to devices.",
          "Description includes a subscribe link and a link to the Intel Business website.",
          "Social links provided: X (Twitter), LinkedIn, and Facebook.",
          "No transcript is available in the video description."
        ],
        "takeaways": [
          "Intel Business is presented as a resource hub for IT and data center projects—useful for finding guidance and expert insights.",
          "Decision-makers should visit the Intel Business website for centralized resources related to infrastructure and devices.",
          "Follow the channel and social accounts to stay updated on Intel Business content and potential guidance relevant to data center planning."
        ],
        "tags": [
          "Intel",
          "Intel Business",
          "Taha Khalifa",
          "data center",
          "IT resources",
          "IT guidance",
          "technology",
          "YouTube",
          "enterprise"
        ]
      }
    },
    {
      "id": "kSocjh8PZnQ",
      "title": "Rynek dóbr luksusowych w obliczu transformacji | Andrzej Marczak, Tomasz Wiśniewski",
      "channel": "KPMG Poland",
      "published_at": "2026-01-13T10:23:31.000Z",
      "url": "https://www.youtube.com/watch?v=kSocjh8PZnQ",
      "thumbnail": "https://i.ytimg.com/vi/kSocjh8PZnQ/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… W podcaście KPMG ON AIR eksperci omawiają kluczowe trendy na rynku dóbr luksusowych: przesunięcie w stronę doświadczeń i personalizacji, wzrost znaczenia ESG oraz pojawienie się „affordable luxury”. Dyskusja obejmuje też specyfikę Polski (rosnący, ale rozproszony rynek), segment luksusowej turystyki i sztuki oraz przyszłość z elementami AI, rzemiosła i ludzkiego wymiaru.",
        "bullets": [
          "Globalne trendy: „luxury fatigue” i koncentracja popytu (2% klientów = 40% rynku).",
          "Rosnące znaczenie personalizacji i doświadczeń, szczególnie w kontekście pokolenia Z.",
          "ESG i odpowiedzialny luksus: ekoskóry, certyfikacje i zrównoważone praktyki.",
          "Polska: rynek rośnie, jest rozproszony; rozwija się luksusowa turystyka, hotele, spa i rynek sztuki.",
          "Przyszłość: AI współistniejące z rzemiosłem oraz nacisk na ludzki wymiar usług luksusowych."
        ],
        "takeaways": [
          "Rosnące zastosowanie AI i personalizacji sugeruje wzrost zapotrzebowania na moc obliczeniową i niską latencję — warto rozważyć skalowalność i rozwiązania edge.",
          "Wzrost znaczenia ESG oznacza, że klienci i partnerzy mogą preferować infrastrukturę energooszczędną i certyfikowaną — planuj modernizację i raportowanie emisji.",
          "Rozwój luksusowej turystyki i hoteli w Polsce może przekładać się na zwiększone lokalne obciążenia sieci i potrzebę wysokiej dostępności usług w regionach turystycznych.",
          "Koncentracja wartościowej klienteli podnosi wymagania dotyczące bezpieczeństwa, jakości obsługi i umów SLA — priorytetem są niezawodność i ochrona danych."
        ],
        "tags": [
          "luksus",
          "ESG",
          "AI",
          "personalizacja",
          "Polska",
          "turystyka",
          "rynek",
          "sztuka",
          "affordable-luxury",
          "KPMG"
        ]
      }
    }
  ]
}