{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-20T14:04:57.783Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "17j252pJnJ8",
      "title": "How I earn $900,000 a year as a dermatologist",
      "channel": "CNBC Make It",
      "published_at": "2026-01-19T15:00:05.000Z",
      "url": "https://www.youtube.com/watch?v=17j252pJnJ8",
      "thumbnail": "https://i.ytimg.com/vi/17j252pJnJ8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Dr. Anna Chacon is a 39-year-old Miami dermatologist who runs her own private practice. Her reported net worth is about $6 million, comprised of $3.2 million in investments, a $1.9 million home, and a $1.1 million office building.",
        "bullets": [
          "Dr. Anna Chacon, age 39, practices dermatology in Miami, FL.",
          "She operates a private practice (owns an office building).",
          "Total net worth reported: approximately $6 million.",
          "$3.2 million in investments.",
          "$1.9 million home and $1.1 million office building."
        ],
        "takeaways": [
          "Owned medical office buildings (here $1.1M) imply clinics may be responsible for their own facility infrastructure needs.",
          "Private-practice clinicians with substantial assets could be potential customers for reliable on-site power and infrastructure services.",
          "Investment-backed personal wealth among clinicians suggests they may invest in facility upgrades—factor this when prioritizing outreach or offerings."
        ],
        "tags": [
          "Dr. Anna Chacon",
          "dermatologist",
          "Miami",
          "private practice",
          "net worth",
          "investments",
          "home ownership",
          "office building",
          "personal finance",
          "medical practice"
        ]
      }
    },
    {
      "id": "6L86-OnOXV0",
      "title": "How I Built A $1M/Year Business - And Helped My Parents Retire",
      "channel": "CNBC Make It",
      "published_at": "2026-01-17T15:00:09.000Z",
      "url": "https://www.youtube.com/watch?v=6L86-OnOXV0",
      "thumbnail": "https://i.ytimg.com/vi/6L86-OnOXV0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Tuan Le emigrated from Vietnam to Toronto in 2015 and vowed at age 15 to help his parents retire. Ten years later his social video production company, ShortsCut, generates over $1 million USD annually, and he now pays his parents' rent and living expenses so they no longer work full time.",
        "bullets": [
          "Tuan Le vowed at 15 to help his parents after the family emigrated from Vietnam to Toronto in 2015.",
          "He founded ShortsCut, a social video production company.",
          "ShortsCut brings in over $1 million USD per year in sales.",
          "Le now covers his parents' rent and living expenses, enabling them to stop working full time.",
          "Video published by CNBC Make It on 2026-01-17 with production credits listed in the description."
        ],
        "takeaways": [
          "A video-focused business reaching >$1M/year highlights growing demand for bandwidth and content delivery capacity.",
          "Grid and data center planners should anticipate scalable storage and high-throughput networking needs from digital media companies.",
          "Reliable, low-latency infrastructure and robust backup/storage solutions can be a competitive advantage when courting expanding content-production clients."
        ],
        "tags": [
          "Tuan Le",
          "ShortsCut",
          "CNBC Make It",
          "entrepreneurship",
          "social video",
          "content production",
          "immigrant success",
          "1M business",
          "Toronto",
          "family support"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video highlights a giant bubble of carbon dioxide that can store 20 megawatts of energy. It presents CO2-based batteries as a way to help smooth fluctuations in renewable generation and to support the global transition to clean energy.",
        "bullets": [
          "Giant carbon-dioxide bubble can store 20 megawatts of energy.",
          "Frames the technology as a new type of battery.",
          "Aimed at addressing variability in renewable energy supply.",
          "Positioned to support the shift to clean energy globally."
        ],
        "takeaways": [
          "A 20 MW CO2 storage option could serve as a large-capacity buffer for fluctuating renewable generation.",
          "Grid operators and data center planners should consider CO2 batteries as one potential tool for integrating more renewables.",
          "Assess compatibility and integration pathways for CO2-based storage when planning decarbonization and reliability strategies.",
          "International applicability suggests this technology may be relevant for cross-border or global clean-energy initiatives."
        ],
        "tags": [
          "CO2",
          "carbon-dioxide",
          "energy-storage",
          "renewables",
          "battery",
          "grid",
          "innovation",
          "IEEE"
        ]
      }
    },
    {
      "id": "OINppmPan0o",
      "title": "Figure Skating | Making Team USA presented by Xfinity with Apolo Ohno",
      "channel": "Team USA",
      "published_at": "2026-01-16T19:30:36.000Z",
      "url": "https://www.youtube.com/watch?v=OINppmPan0o",
      "thumbnail": "https://i.ytimg.com/vi/OINppmPan0o/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, figure skating duo Vadym Kolesnik and Emilia Zingas sit down with Apolo Ohno ahead of the Winter Olympics on an episode of Making Team USA presented by Xfinity. The short description highlights their partnership as \"built on trust\" and directs viewers to Team USA's digital channels.",
        "bullets": [
          "Vadym Kolesnik and Emilia Zingas featured in an interview with Apolo Ohno.",
          "Episode framed around their partnership and trust.",
          "Timed ahead of the Winter Olympics.",
          "Presented by Xfinity and part of the Making Team USA series.",
          "Promotes Team USA's YouTube and social channels for viewing."
        ],
        "takeaways": [
          "High-profile sports content emphasizes the need for reliable streaming and bandwidth during event-driven spikes.",
          "Sponsorship visibility (e.g., Xfinity) highlights the value of consistent, branded delivery across platforms.",
          "Short-form athlete features drive cross-platform promotion — plan capacity and distribution for multi-channel reach.",
          "Trust and teamwork themes suggest the importance of resilient operations and dependable partnerships in delivering live and on-demand content."
        ],
        "tags": [
          "figure skating",
          "Vadym Kolesnik",
          "Emilia Zingas",
          "Apolo Ohno",
          "Winter Olympics",
          "Making Team USA",
          "Xfinity",
          "TeamUSA",
          "interview",
          "trust"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this KPMG ON AIR episode with Monika Palmowska and Jakub Roszkiewicz examines how AI is already affecting transfer pricing—from monitoring rentability and comparable analyses to automating documentation. The discussion covers implementation steps (including ERP integration and Digital Gateway), risks such as data security, RODO and hallucinations, and emphasizes that AI will augment rather than replace tax advisors.",
        "bullets": [
          "AI applications: monitoring profitability, comparative analyses, and automation of transfer pricing documentation.",
          "Practical implementation topics: integration with ERP, intelligent benchmarks, and secure environments like Digital Gateway.",
          "AI strengthens advisors’ work and supports development of junior staff, rather than fully replacing experts.",
          "Key risks highlighted: data protection, security, GDPR (RODO) concerns and AI hallucinations.",
          "Recommended starting points: first steps for AI deployment and importance of organizing processes as a foundation."
        ],
        "takeaways": [
          "Prioritize data governance and GDPR (RODO) compliance before deploying AI tools for tax/transfer-pricing tasks.",
          "Use secure environments (e.g., Digital Gateway) to mitigate data security and privacy risks when working with AI.",
          "Plan for ERP integration and intelligent benchmarking to realize operational benefits from AI-driven monitoring and reporting.",
          "Begin AI initiatives by organizing processes and upskilling teams, since AI is positioned to augment advisors and junior staff."
        ],
        "tags": [
          "AI",
          "transfer pricing",
          "tax",
          "automation",
          "data security",
          "GDPR",
          "ERP integration",
          "benchmarking",
          "Digital Gateway",
          "compliance"
        ]
      }
    },
    {
      "id": "dGfcT63U7Mo",
      "title": "The 2026 U.S. Olympic Figure Skating Team 🇺🇸",
      "channel": "Team USA",
      "published_at": "2026-01-15T20:43:24.000Z",
      "url": "https://www.youtube.com/watch?v=dGfcT63U7Mo",
      "thumbnail": "https://i.ytimg.com/vi/dGfcT63U7Mo/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights the U.S. Olympic Figure Skating lineup. The post conveys excitement (🔥) and is tagged #WinterOlympics.",
        "bullets": [
          "Announces the U.S. Olympic Figure Skating lineup",
          "Uses a fire emoji to convey excitement",
          "Includes the hashtag #WinterOlympics"
        ],
        "takeaways": [
          "If hosting or streaming official Olympic lineup content, ensure CDN capacity and low-latency delivery to support live or high-traffic viewing windows.",
          "Plan for autoscaling and load-balancing around announcement times and Olympic events to maintain availability.",
          "Apply robust rights management and content protection for official Olympic materials.",
          "Ensure metadata and tagging (e.g., #WinterOlympics) are captured for discovery, analytics, and content-routing workflows."
        ],
        "tags": [
          "U.S. Olympic Team",
          "Figure Skating",
          "WinterOlympics",
          "Olympics",
          "Team USA",
          "Skating",
          "Olympic Lineup",
          "Winter Sports"
        ]
      }
    },
    {
      "id": "eSUqLmSoYIc",
      "title": "Stack small wins with Microsoft Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-15T17:38:39.000Z",
      "url": "https://www.youtube.com/watch?v=eSUqLmSoYIc",
      "thumbnail": "https://i.ytimg.com/vi/eSUqLmSoYIc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Copilot is presented as a way to help you keep momentum when tackling workouts, projects, or personal goals. The message encourages using Copilot to sustain progress across different kinds of goals.",
        "bullets": [
          "Keep momentum with Copilot for workouts",
          "Maintain progress on projects with Copilot",
          "Sustain personal goal efforts using Copilot",
          "Applies across multiple types of goals",
          "Focuses on continuing forward progress"
        ],
        "takeaways": [
          "Encourages steady progress on projects—relevant for planning and executing long-term data center initiatives",
          "Can help maintain team momentum during routine operations or upgrade cycles",
          "Supports staff goal follow-through (training, certifications) that contribute to operational readiness",
          "Applicable across workflows that require continuous, sustained progress"
        ],
        "tags": [
          "Microsoft Copilot",
          "Copilot",
          "momentum",
          "productivity",
          "workouts",
          "projects",
          "personal goals",
          "progress",
          "goal-setting",
          "habit"
        ]
      }
    },
    {
      "id": "QWgX6I2zab4",
      "title": "High-Frequency Trading | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T20:57:22.000Z",
      "url": "https://www.youtube.com/watch?v=QWgX6I2zab4",
      "thumbnail": "https://i.ytimg.com/vi/QWgX6I2zab4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… The video highlights the use of the Dell PowerEdge R770AP server powered by Intel® Xeon® 6 processors for high-frequency trading, emphasizing precision and speed to perform hundreds of trades in seconds. It positions Intel Xeon 6 CPUs' high-performance capabilities as defining the future of finance.",
        "bullets": [
          "Focus on high-frequency trading workloads where every second matters",
          "Showcases Dell PowerEdge R770AP servers using Intel Xeon 6 processors",
          "Emphasizes precision and speed to execute hundreds of trades in seconds",
          "Claims performance helps maximize gains and minimize losses",
          "Frames Intel Xeon 6 CPU performance as shaping finance’s future"
        ],
        "takeaways": [
          "Prioritize low-latency, high-performance compute platforms for HFT workloads",
          "Evaluate Dell PowerEdge R770AP with Intel Xeon 6 for trading environments requiring high transaction throughput",
          "Recognize CPU performance as a factor in trading execution outcomes (maximize gains/minimize losses)"
        ],
        "tags": [
          "high-frequency trading",
          "HFT",
          "Intel Xeon 6",
          "Dell PowerEdge R770AP",
          "low latency",
          "trading servers",
          "finance",
          "data center",
          "performance"
        ]
      }
    },
    {
      "id": "oc-FZ6BD1R4",
      "title": "Spark creativity with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-14T18:52:27.000Z",
      "url": "https://www.youtube.com/watch?v=oc-FZ6BD1R4",
      "thumbnail": "https://i.ytimg.com/vi/oc-FZ6BD1R4/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video presents Copilot as a tool that brought a lost creative spark back to life. It encourages viewers to download and try Copilot via the link in the bio.",
        "bullets": [
          "Positions Copilot as reviving creativity.",
          "Short promotional message with a clear call to action.",
          "Invites viewers to download and try Copilot.",
          "Directs users to a link in the bio for access."
        ],
        "takeaways": [
          "Copilot is promoted as enhancing creativity; consider running a pilot with creative teams to judge its value.",
          "Use the advertised download/try path to evaluate user experience before broader adoption.",
          "If pilots are promising, plan for provisioning, licensing, and user support to enable wider rollout."
        ],
        "tags": [
          "Copilot",
          "creativity",
          "AI",
          "Microsoft Copilot",
          "download",
          "try",
          "productivity",
          "promo",
          "link-in-bio"
        ]
      }
    },
    {
      "id": "WYyubfkeiQU",
      "title": "Where Winds Meet is #RTXOn with DLSS 4 with Multi Frame Generation",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-14T17:52:22.000Z",
      "url": "https://www.youtube.com/watch?v=WYyubfkeiQU",
      "thumbnail": "https://i.ytimg.com/vi/WYyubfkeiQU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This video showcases the open-world martial arts RPG \"Where Winds Meet\" running with DLSS 4 and Multi Frame Generation and with #RTXOn. Footage is credited to @DigitalDreamsyt.",
        "bullets": [
          "Showcases Where Winds Meet, an open-world martial arts RPG",
          "Highlights DLSS 4 with Multi Frame Generation",
          "Promotes RTX-enabled rendering (#RTXOn)",
          "Footage credited to @DigitalDreamsyt"
        ],
        "takeaways": [
          "The content demonstrates use of DLSS 4 with Multi Frame Generation—infrastructure should support NVIDIA DLSS 4 capabilities to run or showcase similar workloads.",
          "RTX-enabled rendering is featured—ensure GPUs in grid/data center environments are RTX-capable for full feature support.",
          "For cloud gaming or remote-rendering deployments, plan for workloads that leverage DLSS 4 and RTX features when sizing GPU resources.",
          "Asset provenance (creator credit) is included—include support for content attribution in deployment/streaming workflows."
        ],
        "tags": [
          "WhereWindsMeet",
          "DLSS4",
          "MultiFrameGeneration",
          "RTXOn",
          "open-world",
          "martial-arts",
          "NVIDIA",
          "DigitalDreamsyt",
          "gameplay",
          "ray-tracing"
        ]
      }
    },
    {
      "id": "Bl1IaPQxqDw",
      "title": "Taha Khalifa (Intel) | Intel Business",
      "channel": "Intel Business",
      "published_at": "2026-01-14T09:05:28.000Z",
      "url": "https://www.youtube.com/watch?v=Bl1IaPQxqDw",
      "thumbnail": "https://i.ytimg.com/vi/Bl1IaPQxqDw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Intel Business offers IT information and resources covering topics from data centers to devices, providing guidance and expert insights to help get IT projects done right. The channel invites viewers to subscribe and points to a website and social profiles for further connection.",
        "bullets": [
          "Provides IT information spanning data centers to endpoint devices.",
          "Offers resources, guidance, and expert insights to support IT projects.",
          "Invites viewers to subscribe to the Intel Business YouTube channel.",
          "Lists a website and social channels (X, LinkedIn, Facebook) for further connection.",
          "References Taha Khalifa (Intel) in the video description."
        ],
        "takeaways": [
          "Treat Intel Business as a centralized resource for data center and device guidance.",
          "Leverage the channel's expert insights to inform project planning and execution.",
          "Use the website and social links to access additional resources and stay updated.",
          "Apply provided guidance to help improve IT project outcomes and reduce implementation risk."
        ],
        "tags": [
          "Intel Business",
          "Taha Khalifa",
          "IT resources",
          "data centers",
          "devices",
          "IT guidance",
          "expert insights",
          "YouTube",
          "Intel"
        ]
      }
    }
  ]
}