{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-22T17:52:58.104Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, KPMG ON AIR hosts Katarzyna Chojniak and Alicja Barska discussing praktyczne zastosowania AI w audycie — od narzędzi do analizy pełnych populacji po konwersacyjne asystenty i platformę KPMG Clara. Rozmowa omawia korzyści dla klientów, zmieniającą się rolę audytora oraz wyzwania związane z wdrożeniem, bezpieczeństwem danych i regulacjami.",
        "bullets": [
          "AI Transaction Scoring Tool umożliwia analizę pełnych populacji zamiast tradycyjnego próbkowania.",
          "Clara AI to konwersacyjny asystent i wyspecjalizowani agenci wspierający pracę audytorów.",
          "KPMG Clara zapewnia zarządzanie badaniem w czasie rzeczywistym, a Clara for Clients usprawnia komunikację z klientem.",
          "AI wspiera dokumentację i analizę ujawnień, zmieniając rolę audytora z wykonywacza na nadzorującego technologię.",
          "Omówione są także wyzwania wdrożeniowe, kwestie bezpieczeństwa danych, środowisko regulacyjne i potencjalne ryzyka AI."
        ],
        "takeaways": [
          "Przygotuj się na bardziej szczegółowe i szybkie audyty — pełnopopulacyjne analizy mogą ujawnić problemy niewidoczne w próbkach.",
          "Wykorzystanie platform do zarządzania badaniem w czasie rzeczywistym poprawia przejrzystość i komunikację z audytorami.",
          "Zadbaj o procesy bezpieczeństwa danych i zgodność regulacyjną przed udostępnieniem dużych zbiorów danych audytorom.",
          "Oczekuj zmian w interakcji z audytorami — wymagania dotyczące kompetencji personelu i współpracy z narzędziami AI będą rosły."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMG Clara",
          "Clara AI",
          "full-population-analysis",
          "audit-innovation",
          "data-security",
          "real-time-audit",
          "auditor-skills"
        ]
      }
    },
    {
      "id": "t33Fh1JZVgA",
      "title": "AI at Speed: From Investment to Performance",
      "channel": "PwC US",
      "published_at": "2026-01-21T22:48:29.000Z",
      "url": "https://www.youtube.com/watch?v=t33Fh1JZVgA",
      "thumbnail": "https://i.ytimg.com/vi/t33Fh1JZVgA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… PwC US Senior Partner and CEO Paul Griggs speaks with CNBC’s Emma Crosby at the 2026 World Economic Forum in Davos about how organizations are moving from AI exploration to execution. They emphasize assessing AI through investment discipline, performance, and measurable value while designing operating models that remain resilient without sacrificing performance.",
        "bullets": [
          "Organizations shifting from exploration to execution on AI initiatives",
          "AI evaluated through investment discipline, performance, and measurable value",
          "Leaders are moving early and placing capital with intent",
          "Operating models should be resilient yet high-performing",
          "AI is delivering measurable outcomes today and enabling future transformation"
        ],
        "takeaways": [
          "Prioritize AI investments that have clear, measurable performance and value metrics",
          "Allocate capital intentionally to stay ahead in AI adoption rather than delaying",
          "Design operating models that balance resilience and performance to support AI integration",
          "Use demonstrable outcomes to justify infrastructure upgrades and capacity planning"
        ],
        "tags": [
          "AI",
          "investment",
          "performance",
          "measurable-value",
          "operating-models",
          "resilience",
          "transformation",
          "Davos2026",
          "PwC",
          "CNBC"
        ]
      }
    },
    {
      "id": "6hu7hYLiu08",
      "title": "Get Step-By-Step Fixes with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-21T20:14:00.000Z",
      "url": "https://www.youtube.com/watch?v=6hu7hYLiu08",
      "thumbnail": "https://i.ytimg.com/vi/6hu7hYLiu08/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Copilot provides real-time visual support for home projects and repairs by seeing what you see and delivering step-by-step instructions. It aims to help users handle common issues—like leaky pipes and overflowing washing machines—with clear, actionable guidance.",
        "bullets": [
          "Real-time visual assistance that 'sees what you see'.",
          "Delivers step-by-step instructions for home repairs.",
          "Targets common household problems (e.g., plumbing, appliances).",
          "Focus on clear, actionable guidance to support users."
        ],
        "takeaways": [
          "Evaluate visual, step-by-step assistance tools for on-site maintenance to potentially reduce troubleshooting time.",
          "Such guidance could help less-experienced technicians perform routine fixes, affecting training and staffing considerations.",
          "Pilot tests are advisable to assess applicability for infrastructure tasks analogous to household repairs (e.g., leaks, equipment malfunctions).",
          "Any deployment in sensitive facilities should consider access controls, data privacy, and operational security before adoption."
        ],
        "tags": [
          "Copilot",
          "real-time",
          "visual assistance",
          "home repairs",
          "step-by-step",
          "troubleshooting",
          "plumbing",
          "appliances",
          "AI assistance",
          "remote support"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Arknights: Endfield has officially launched and the trailer highlights NVIDIA DLSS 4 with Multi Frame Generation. The game is a 3D real-time strategy RPG where you play the Endministrator exploring Talos-II, and the footage was captured on a GeForce RTX 5080 at 4K Ultra with DLSS 4 Multi Frame Generation 4X Mode.",
        "bullets": [
          "Official launch of Arknights: Endfield showcased on NVIDIA GeForce channel.",
          "Trailer emphasizes NVIDIA DLSS 4 with Multi Frame Generation (MFG).",
          "Game genre: 3D real-time strategy RPG; player role: Endministrator of Endfield Industries on Talos-II.",
          "Footage captured on GeForce RTX 5080 at 4K Ultra Settings, DLSS 4 MFG 4X Mode.",
          "Links provided for the game site and official social channels; NVIDIA news link about DLSS 4 included."
        ],
        "takeaways": [
          "Title supports DLSS 4 with Multi Frame Generation — confirm support for DLSS 4 in infrastructure and driver stacks used for demos or cloud gaming.",
          "Captured on an RTX 5080 at 4K Ultra — plan for high-end GPU availability for marketing captures, validation, or demo workloads.",
          "Ensure GeForce driver and SDK compatibility to reproduce DLSS 4/MFG captures and maintain interoperability for benchmarking.",
          "Leverage provided game and NVIDIA links/social channels for official assets and coordination when planning promotional or performance testing activities."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "NVIDIA",
          "RTX5080",
          "4K",
          "GeForce",
          "RealTimeStrategy",
          "GameLaunch"
        ]
      }
    },
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video shows how Rate Insurance boosts agent efficiency using Agentforce and Gemini. The description also provides a link to learn more about the Google Cloud and Salesforce partnership.",
        "bullets": [
          "Video focuses on Rate Insurance improving agent efficiency with Agentforce and Gemini.",
          "Description includes a link to Google Cloud and Salesforce partnership details: https://goo.gle/3NSZrJS",
          "Published by Google Cloud on 2026-01-20.",
          "Viewers are invited to \"watch how\" Rate Insurance uses these tools.",
          "No transcript is available for this video."
        ],
        "takeaways": [
          "If evaluating agent productivity solutions, review how Agentforce and Gemini are showcased for operational improvements.",
          "Assess the Google Cloud–Salesforce partnership resources linked in the description for integration and support details.",
          "Use the video as a high-level example when considering cloud-based customer service tooling and vendor collaboration."
        ],
        "tags": [
          "Google Cloud",
          "Salesforce",
          "Rate Insurance",
          "Agentforce",
          "Gemini",
          "agent efficiency",
          "cloud partnership",
          "case study",
          "customer service",
          "2026"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Charly Stoever, 35, is a financial coach who lives rent-free in Portland by pet sitting full time and has spent the last 18 months traveling with two suitcases while earning $60,000 a year. The profile is part of CNBC Make It's Millennial Money series.",
        "bullets": [
          "Subject: Charly Stoever, 35, financial coach.",
          "Lives rent-free in Portland by pet sitting full time.",
          "Has lived out of two suitcases for 18 months.",
          "Annual income reported: $60,000.",
          "Video is an installment of CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "Profiles of mobile, rent-free lifestyles highlight a population that may rely on consistent power and connectivity across many short-term locations.",
          "Nomadic work/travel arrangements earning mid-five-figure incomes suggest sustained demand for reliable, widely available infrastructure services.",
          "Mainstream coverage of these lifestyles signals a trend worth monitoring for capacity and distribution planning in edge/network services."
        ],
        "tags": [
          "Charly Stoever",
          "pet sitting",
          "rent-free",
          "travel",
          "Portland",
          "financial coach",
          "CNBC Make It",
          "Millennial Money",
          "nomad"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This video describes a giant bubble of carbon dioxide being used as a battery that can store 20 megawatts of energy. The description frames the technology as a way to buffer fluctuating renewable resources and support the global shift to clean energy.",
        "bullets": [
          "Uses a large carbon dioxide bubble as an energy storage medium.",
          "Claims the system can store 20 megawatts of energy.",
          "Presented as a solution for fluctuating renewable generation.",
          "Framed as a technology that can help accelerate global clean-energy adoption.",
          "Source and hashtags link it to IEEE Spectrum and tech/innovation coverage."
        ],
        "takeaways": [
          "May offer a high-power storage option to help buffer intermittent renewables.",
          "20-megawatt capacity (as described) suggests potential relevance for grid-scale or large facility needs.",
          "Decision-makers should watch for this CO2-bubble approach as a possible addition to energy resiliency toolkits.",
          "Global deployment is suggested—monitor availability and compatibility with existing infrastructure."
        ],
        "tags": [
          "CO2 battery",
          "carbon dioxide",
          "energy storage",
          "renewables",
          "grid stability",
          "clean energy",
          "IEEE Spectrum",
          "innovation",
          "tech"
        ]
      }
    },
    {
      "id": "2nLBZeLk8-0",
      "title": "AI w cenach transferowych – jak wykorzystać jej potencjał? | Monika Palmowska, Jakub Roszkiewicz",
      "channel": "KPMG Poland",
      "published_at": "2026-01-16T12:15:26.000Z",
      "url": "https://www.youtube.com/watch?v=2nLBZeLk8-0",
      "thumbnail": "https://i.ytimg.com/vi/2nLBZeLk8-0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI już teraz zmienia podejście do cen transferowych — od monitorowania rentowności i analiz porównawczych po automatyzację dokumentacji. Eksperci KPMG (Monika Palmowska i Jakub Roszkiewicz) omawiają, że AI może wzmocnić pracę doradców (nie zastąpić ich), wskazują ryzyka związane z danymi i bezpieczeństwem (w tym RODO i halucynacje) oraz przedstawiają praktyczne kroki wdrożeniowe, jak integracja z ERP, uporządkowanie procesów i korzystanie z bezpiecznych środowisk (Digital Gateway).",
        "bullets": [
          "AI wspiera monitoring rentowności, benchmarki i automatyzację dokumentacji cen transferowych.",
          "Technologia ma uzupełniać doradców podatkowych, a nie ich zastępować.",
          "Główne ryzyka to ochrona danych, bezpieczeństwo, RODO oraz zjawisko halucynacji AI.",
          "Rekomendowane rozwiązania techniczne: integracja z ERP, inteligentne benchmarki i bezpieczne środowiska (Digital Gateway).",
          "Pierwsze kroki wdrożenia: uporządkowanie procesów, rozwój kompetencji pracowników i realizacja filarów transformacji."
        ],
        "takeaways": [
          "Priorytet dla bezpieczeństwa danych i zgodności z RODO przy wdrażaniu rozwiązań AI.",
          "Wdrożenie warto prowadzić w bezpiecznych środowiskach (np. Digital Gateway) zamiast otwartych narzędzi publicznych.",
          "Integracja AI z ERP i inteligentnymi benchmarkami zwiększy użyteczność analityki cen transferowych.",
          "Zanim wdrożysz AI, uporządkuj procesy i zadbaj o szkolenia — technologia wzmacnia kompetencje, zwłaszcza młodszych pracowników."
        ],
        "tags": [
          "AI",
          "ceny transferowe",
          "monitoring",
          "automatyzacja",
          "RODO",
          "Digital Gateway",
          "ERP",
          "benchmarking",
          "KPMG"
        ]
      }
    }
  ]
}