{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-29T11:04:28.707Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "yUpQ9pWA9WE",
      "title": "Watch: Fed Chair Jerome Powell's Full News Conference | WSJ",
      "channel": "WSJ News",
      "published_at": "2026-01-29T08:28:54.000Z",
      "url": "https://www.youtube.com/watch?v=yUpQ9pWA9WE",
      "thumbnail": "https://i.ytimg.com/vi/yUpQ9pWA9WE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Federal Reserve Chair Jerome Powell speaks to reporters following the Fed's two-day policy-setting meeting. The video presents the full news conference as posted by WSJ News.",
        "bullets": [
          "Full news conference featuring Fed Chair Jerome Powell",
          "Occurred immediately after the Federal Reserve's two-day policy-setting meeting",
          "Video posted by WSJ News on 2026-01-29",
          "Description includes hashtags: #JeromePowell #Fed #WSJ"
        ],
        "takeaways": [
          "Watch the full news conference for official Fed communications following the policy meeting.",
          "Use Powell's remarks to inform assessments of potential impacts on financing conditions.",
          "Be prepared for short-term market reactions that could affect capital and energy planning.",
          "Coordinate with finance and operations teams to review contingency and budgeting plans."
        ],
        "tags": [
          "JeromePowell",
          "FederalReserve",
          "Fed",
          "MonetaryPolicy",
          "NewsConference",
          "WSJ",
          "WSJNews",
          "PolicyMeeting",
          "Economy"
        ]
      }
    },
    {
      "id": "feL4GUiP7Ws",
      "title": "Building Prior Authorization Systems for Healthcare Payors with Amazon Bedrock",
      "channel": "AWS Events",
      "published_at": "2026-01-29T05:43:38.000Z",
      "url": "https://www.youtube.com/watch?v=feL4GUiP7Ws",
      "thumbnail": "https://i.ytimg.com/vi/feL4GUiP7Ws/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This technical session demonstrates using Amazon Bedrock foundation models to build an intelligent prior authorization system for healthcare payors that meets CMS regulatory requirements. It presents an architectural approach combining advanced NLP with healthcare-specific workflows to automate Local Coverage Determinations (LCDs), analyze complex medical documentation, and generate explainable prior authorization recommendations.",
        "bullets": [
          "Shows how to leverage Amazon Bedrock foundation models for prior authorization workflows.",
          "Focuses on automated processing of Local Coverage Determinations (LCDs) and complex medical documents.",
          "Emphasizes explainable recommendations to support compliance and auditability.",
          "Aligns solution timelines with CMS-0057-F regulatory requirements.",
          "Presented by AWS Engineers and the AWS Generative AI Innovation Center with real-world examples."
        ],
        "takeaways": [
          "Expect architectural guidance for integrating foundation models with healthcare workflows—plan for model hosting and inference capacity.",
          "Compliance and explainability are central—ensure logging, auditability, and validation capabilities in deployments.",
          "Automation of LCD and documentation processing can materially reduce manual workload—reassess operational capacity and throughput planning.",
          "Meeting CMS-0057-F timelines requires end-to-end workflow orchestration—coordinate data pipelines, security controls, and change management."
        ],
        "tags": [
          "Amazon Bedrock",
          "prior authorization",
          "healthcare payors",
          "CMS-0057-F",
          "Local Coverage Determinations",
          "NLP",
          "explainable AI",
          "operational efficiency",
          "healthcare compliance",
          "AWS Generative AI Innovation Center"
        ]
      }
    },
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy GenAI-powered solutions that unlocked new revenue streams and streamlined operations. Sreeni Alakappan explains they leveraged Google Cloud's infrastructure to boost developer productivity, compress their digital transformation timeline, and expand the company's ambitions.",
        "bullets": [
          "TTEC worked with Google Cloud Consulting to accelerate AI solution prototyping and deployment.",
          "GenAI and Google Cloud infrastructure were used to streamline operations and boost developer productivity.",
          "The partnership enabled TTEC to unlock entirely new revenue streams.",
          "Google Cloud Consulting helped compress TTEC’s digital transformation timeline.",
          "Effort expanded what’s possible for TTEC’s business ambitions."
        ],
        "takeaways": [
          "Robust cloud infrastructure enables faster GenAI prototyping and deployment for business use cases.",
          "Engaging cloud consulting services can compress digital transformation timelines and speed time-to-value.",
          "AI deployments can both improve operational efficiency and create new revenue opportunities.",
          "Increased developer productivity via cloud platforms reduces time-to-market for AI-driven features."
        ],
        "tags": [
          "googlecloud",
          "ttec",
          "genai",
          "aideployment",
          "operationalefficiency",
          "customerexperience",
          "googlecloudplatform",
          "generativeai",
          "consulting",
          "digitaltransformation"
        ]
      }
    },
    {
      "id": "5CyVBSbHmbA",
      "title": "Year-end toolkit: Strengthening audit committee collaboration",
      "channel": "PwC US",
      "published_at": "2026-01-27T17:20:31.000Z",
      "url": "https://www.youtube.com/watch?v=5CyVBSbHmbA",
      "thumbnail": "https://i.ytimg.com/vi/5CyVBSbHmbA/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this PwC Year‑end toolkit episode addresses how finance teams can strengthen collaboration with the audit committee, streamline year‑end accounting and reporting, and respond to expanding oversight responsibilities. The discussion covers emerging issues including AI oversight, enterprise risk management, transformation initiatives, evolving cyber risk, and elevated proxy disclosures, with insights from Stephen Parker and host Diana Stoltzfus.",
        "bullets": [
          "Strengthening management/audit committee communication and collaboration.",
          "Key year‑end accounting and reporting issues finance teams should be prepared to address.",
          "Oversight of AI: risks, opportunities, and controls.",
          "Enhancing enterprise risk oversight and navigating cyber risk in the age of AI.",
          "Elevating proxy disclosures and links to related PwC resources and webcast replay."
        ],
        "takeaways": [
          "Keep audit committees informed on major transformation and capital initiatives that affect financial reporting and controls.",
          "Be prepared to explain AI projects, associated risks, and implemented controls to governance and audit stakeholders.",
          "Demonstrate robust enterprise risk and cyber controls—especially for AI‑related threats—to satisfy oversight expectations.",
          "Maintain clear documentation and rationale for year‑end accounting judgments to support efficient audit committee review and external audit."
        ],
        "tags": [
          "year-end",
          "audit-committee",
          "finance",
          "AI-oversight",
          "enterprise-risk-management",
          "cyber-risk",
          "proxy-disclosures",
          "governance",
          "reporting",
          "PwC"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this video shows Jo discovering the power of Copilot Groups to make route planning easier. It highlights route planning as the focus and positions Copilot Groups as a tool for simplifying that work.",
        "bullets": [
          "Focus: route planning made easy",
          "Feature highlighted: Copilot Groups",
          "Person featured: Jo discovers the capability",
          "Channel: Microsoft Copilot",
          "Includes hashtags: #copilot #microsoftcopilot #ai"
        ],
        "takeaways": [
          "If your operations include route planning, Copilot Groups is presented as a tool aimed at simplifying that task.",
          "Decision-makers should be aware of Copilot Groups within the Microsoft Copilot ecosystem when evaluating planning tools.",
          "Share this capability with logistics or field-operations teams to assess potential fit for route workflows.",
          "The video serves as a brief showcase of Copilot Groups’ relevance to route planning needs."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "copilotgroups",
          "routeplanning",
          "logistics",
          "operations",
          "productivity",
          "fieldservice"
        ]
      }
    }
  ]
}