{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-23T16:55:27.174Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "ucM-ExhRl5Q",
      "title": "Audyt w erze AI: praktyczne zastosowania i realne korzyści | Katarzyna Chojniak, Alicja Barska",
      "channel": "KPMG Poland",
      "published_at": "2026-01-22T08:05:39.000Z",
      "url": "https://www.youtube.com/watch?v=ucM-ExhRl5Q",
      "thumbnail": "https://i.ytimg.com/vi/ucM-ExhRl5Q/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… AI in audit is presented as a current, practical toolset that supports repetitive tasks, large-scale data analysis and better decision-making. The podcast outlines specific KPMG tools (AI Transaction Scoring Tool, Clara AI, KPMG Clara and Clara for Clients), the shift from sampling to full-population analysis, changing auditor competencies, and implementation challenges including data security and regulatory concerns.",
        "bullets": [
          "Practical AI tools discussed: AI Transaction Scoring Tool, Clara AI (conversational assistant/agents), KPMG Clara and Clara for Clients.",
          "Shift from traditional sampling to analysis of full populations for more comprehensive audit coverage.",
          "AI supports documentation, disclosure analysis and real-time audit management.",
          "Auditor roles and required competencies are evolving; adaptation and training are needed.",
          "Key implementation challenges: data security, regulatory environment and potential AI-related risks."
        ],
        "takeaways": [
          "Prepare and maintain comprehensive, well-structured datasets—AI-enabled audits rely on full-population analysis for accuracy and speed.",
          "Prioritize robust data security and compliance controls, as AI-driven audit processes increase regulatory and privacy focus.",
          "Streamline secure, real-time communication channels with auditors (e.g., client platforms) to accelerate audit workflows.",
          "Invest in staff skills for working with AI-enabled audit tools (data extraction, documentation support, interpretation of outputs)."
        ],
        "tags": [
          "audyt",
          "AI",
          "KPMG",
          "KPMG Clara",
          "Clara AI",
          "audit innovation",
          "data security",
          "regulatory compliance",
          "full-population analysis",
          "auditor competencies"
        ]
      }
    },
    {
      "id": "6hu7hYLiu08",
      "title": "Get Step-By-Step Fixes with Copilot",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-21T20:14:00.000Z",
      "url": "https://www.youtube.com/watch?v=6hu7hYLiu08",
      "thumbnail": "https://i.ytimg.com/vi/6hu7hYLiu08/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Copilot provides real-time visual support for home projects and repairs. It can see what you see and deliver clear, step-by-step instructions for issues like leaky pipes and overflowing washing machines.",
        "bullets": [
          "Real-time visual assistance that interprets what the user sees.",
          "Step-by-step instructions for common home repairs.",
          "Targets everyday problems (e.g., leaky pipes, overflowing washers).",
          "Designed to give clear, actionable guidance to users.",
          "Intended for on-the-spot troubleshooting and DIY help."
        ],
        "takeaways": [
          "Visual, real-time guidance could enable faster remote troubleshooting for field technicians.",
          "Step-by-step instructions may reduce the need for specialist site visits, lowering operational costs.",
          "Clear on-device guidance can shorten repair times and reduce equipment downtime.",
          "Consider evaluating visual-assist tools to augment training and remote support workflows."
        ],
        "tags": [
          "copilot",
          "real-time support",
          "visual assistance",
          "home repairs",
          "step-by-step",
          "remote troubleshooting",
          "DIY",
          "leaky pipes",
          "washing machine",
          "Microsoft"
        ]
      }
    },
    {
      "id": "SWLsEsTay_8",
      "title": "Arknights: Endfield | 4K NVIDIA DLSS 4 Launch Trailer",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-21T14:00:45.000Z",
      "url": "https://www.youtube.com/watch?v=SWLsEsTay_8",
      "thumbnail": "https://i.ytimg.com/vi/SWLsEsTay_8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… Arknights: Endfield has officially launched and the trailer highlights support for NVIDIA DLSS 4 with Multi Frame Generation. The game is a 3D real-time strategy RPG in which you play the Endministrator of Endfield Industries exploring Talos-II; the footage was captured on a GeForce RTX 5080 at 4K Ultra with DLSS 4 Multi Frame Generation 4X Mode.",
        "bullets": [
          "Official launch trailer announces Arknights: Endfield with NVIDIA DLSS 4 (Multi Frame Generation).",
          "Game type: 3D real-time strategy RPG; player role: Endministrator on Talos-II.",
          "Trailer capture details: GeForce RTX 5080, 4K Ultra Settings, DLSS 4 Multi Frame Generation 4X Mode.",
          "Links provided for DLSS 4 announcement, the game site, and multiple social channels.",
          "Hashtags: #ArknightsEndfield #RTXOn #DLSS4"
        ],
        "takeaways": [
          "DLSS 4 with Multi Frame Generation is being used in a commercial game release—consider GPU support for DLSS 4 when planning high-resolution graphics workloads or demos.",
          "Footage was captured on an RTX 5080 at 4K Ultra, indicating new-generation NVIDIA RTX 50-series hardware may be relevant for 4K capture and rendering pipelines.",
          "For deployments requiring high-fidelity, high-frame-rate capture or streaming, verify compatibility with DLSS 4 Multi Frame Generation and appropriate drivers/software.",
          "Include support for developer and community links (game site, social channels) when coordinating previews, benchmarks, or partner showcases."
        ],
        "tags": [
          "ArknightsEndfield",
          "DLSS4",
          "MultiFrameGeneration",
          "RTX5080",
          "4K",
          "NVIDIA",
          "GeForce",
          "RTS",
          "Gaming"
        ]
      }
    },
    {
      "id": "F_pCrK4eoqc",
      "title": "Rate Insurance Boosts Agent Efficiency with Agentforce and Gemini",
      "channel": "Google Cloud",
      "published_at": "2026-01-20T17:16:17.000Z",
      "url": "https://www.youtube.com/watch?v=F_pCrK4eoqc",
      "thumbnail": "https://i.ytimg.com/vi/F_pCrK4eoqc/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… This video shows how Rate Insurance boosts agent efficiency using Agentforce and Gemini. It also directs viewers to learn more about the Google Cloud and Salesforce partnership via the provided link.",
        "bullets": [
          "Demonstrates Rate Insurance using Agentforce and Gemini",
          "Focus on boosting agent efficiency",
          "Video format: 'Watch how' demo/overview",
          "Provides a link to learn more about the Google Cloud and Salesforce partnership"
        ],
        "takeaways": [
          "Watch the video to observe how Agentforce and Gemini are applied to agent workflows",
          "Use the Google Cloud–Salesforce partnership link to explore integration and partnership details",
          "Consider evaluating Agentforce and Gemini when assessing solutions for agent productivity",
          "Share the demo with stakeholders responsible for customer-facing systems to inform vendor discussions"
        ],
        "tags": [
          "Rate Insurance",
          "Agentforce",
          "Gemini",
          "Google Cloud",
          "Salesforce",
          "agent efficiency",
          "demo",
          "insurance tech",
          "partnership",
          "video"
        ]
      }
    },
    {
      "id": "GUrte_Q6FyY",
      "title": "I Travel The World And Live Rent-Free By Pet Sitting Full Time",
      "channel": "CNBC Make It",
      "published_at": "2026-01-20T17:00:33.000Z",
      "url": "https://www.youtube.com/watch?v=GUrte_Q6FyY",
      "thumbnail": "https://i.ytimg.com/vi/GUrte_Q6FyY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Charly Stoever, 35, is a financial coach who lives rent-free in Portland, Oregon by pet sitting full time and has been traveling light out of two suitcases for the last 18 months. She brings in about $60,000 a year, and the profile is part of CNBC Make It's Millennial Money series.",
        "bullets": [
          "Charly Stoever, 35, is a financial coach.",
          "Lives rent-free in Portland, Oregon by pet sitting full time.",
          "Has spent the past 18 months living out of two suitcases.",
          "Earns approximately $60,000 per year from this arrangement.",
          "This story is part of CNBC Make It's Millennial Money series."
        ],
        "takeaways": [
          "Based on the description, workforce mobility and nontraditional living arrangements may shift where and how people use residential energy.",
          "Decision-makers should consider that more rent-free or mobile lifestyles could alter local demand patterns versus traditional housing occupancy assumptions.",
          "Profiles like this highlight the importance of adaptable services and infrastructure to support a more transient population."
        ],
        "tags": [
          "Charly Stoever",
          "pet-sitting",
          "financial-coach",
          "rent-free",
          "Portland",
          "60k",
          "MillennialMoney",
          "CNBCMakeIt",
          "travel",
          "minimalism"
        ]
      }
    },
    {
      "id": "WdVOBJSOcGY",
      "title": "New CO2 Battery Stores 8 Hours of Energy",
      "channel": "IEEE Spectrum",
      "published_at": "2026-01-16T22:41:10.000Z",
      "url": "https://www.youtube.com/watch?v=WdVOBJSOcGY",
      "thumbnail": "https://i.ytimg.com/vi/WdVOBJSOcGY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, a new battery concept uses a giant bubble of carbon dioxide to store energy, offering about eight hours of discharge and a capacity of 20 megawatts. The description presents this approach as a way to smooth fluctuating renewable generation and help power the global shift to clean energy.",
        "bullets": [
          "Battery stores energy in a giant bubble of carbon dioxide.",
          "Reported capacity: 20 megawatts.",
          "Reported duration: approximately 8 hours of energy storage.",
          "Designed to address fluctuations in renewable energy supply.",
          "Aimed at supporting a global transition to clean energy."
        ],
        "takeaways": [
          "Delivers ~20 MW for ~8 hours — potentially useful for multi-hour firming or backup needs.",
          "Can help smooth renewable generation variability and reduce reliance on fossil backup.",
          "Match capacity/duration against site load profiles to assess suitability for grid or data-center use.",
          "Consider integration and operational planning to leverage the technology for decarbonization goals."
        ],
        "tags": [
          "CO2 battery",
          "carbon dioxide",
          "energy storage",
          "8-hour storage",
          "20 MW",
          "renewables",
          "grid storage",
          "clean energy",
          "battery technology",
          "IEEE Spectrum"
        ]
      }
    }
  ]
}