{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-31T05:59:05.828Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "z-X9MYi1Rr0",
      "title": "Leveraging tax credits and incentives for sustainability projects",
      "channel": "PwC US",
      "published_at": "2026-01-30T13:27:25.000Z",
      "url": "https://www.youtube.com/watch?v=z-X9MYi1Rr0",
      "thumbnail": "https://i.ytimg.com/vi/z-X9MYi1Rr0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Randa Barsoum of PwC US highlights tax credits and incentives beyond the familiar energy incentives that can support sustainability initiatives. She points to state and local abatements, location-based incentives, and R&D tax credits tied to innovation in areas like reimagining packaging or processes, with the key message that a broader view of tax opportunities can unlock meaningful value from sustainability investments.",
        "bullets": [
          "Energy incentives are commonly considered but aren’t the whole picture.",
          "State and local abatements can support sustainability projects.",
          "Location-based incentives are another often-overlooked lever.",
          "R&D tax credits apply to innovation efforts (e.g., reimagining packaging or processes).",
          "Viewing sustainability investments broadly can generate meaningful tax value."
        ],
        "takeaways": [
          "Don’t rely solely on energy incentives—investigate state/local abatements when planning projects or site selection.",
          "Assess location-based incentives as part of your facility and expansion decisions.",
          "Explore R&D tax credits for innovation in processes that improve sustainability and may qualify for credits.",
          "Frame sustainability investments to capture tax value across multiple incentive types."
        ],
        "tags": [
          "sustainability",
          "tax-credits",
          "incentives",
          "R&D",
          "state-abatements",
          "location-incentives",
          "PwC",
          "corporate-tax",
          "ESG",
          "operational-resilience"
        ]
      }
    },
    {
      "id": "oQtkaHzUYlY",
      "title": "Copilot helps Christa find her inner star 🌟",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-29T18:33:49.000Z",
      "url": "https://www.youtube.com/watch?v=oQtkaHzUYlY",
      "thumbnail": "https://i.ytimg.com/vi/oQtkaHzUYlY/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the sky is full of stars, and Copilot helps Christa find the star within. The short blurb invites viewers to download and try Copilot via the link in the bio.",
        "bullets": [
          "Description frames a sky full of stars.",
          "States Copilot helps Christa find her inner star.",
          "Includes a star emoji (🌟).",
          "Direct call to action: download & try Copilot.",
          "Distribution pointer: link in bio."
        ],
        "takeaways": [
          "Messaging is consumer-facing and inspirational rather than technical — it’s positioned as personal empowerment.",
          "There is a clear call to action to download Copilot via social bio links, indicating social channels as a distribution path.",
          "Content emphasizes brand/UX appeal over feature details, so expect this asset to support awareness rather than technical onboarding."
        ],
        "tags": [
          "Copilot",
          "Christa",
          "stars",
          "inner-star",
          "download",
          "link-in-bio",
          "inspiration",
          "promo"
        ]
      }
    },
    {
      "id": "BYtYm-xyKR8",
      "title": "Bringing In $251K A Year With 3 Jobs In The Bay Area",
      "channel": "CNBC Make It",
      "published_at": "2026-01-29T17:47:46.000Z",
      "url": "https://www.youtube.com/watch?v=BYtYm-xyKR8",
      "thumbnail": "https://i.ytimg.com/vi/BYtYm-xyKR8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Naseema McElroy, 44, is a labor and delivery nurse in Brentwood, California who also runs a personal finance brand and holds three jobs in the Bay Area, bringing in $251K a year. After accumulating nearly $1 million in debt in 2015, she started Financially Intentional to document her debt-payoff journey and was debt-free by 2017.",
        "bullets": [
          "Labor and delivery nurse and founder of the personal finance brand Financially Intentional",
          "Earns $251K per year through three jobs in the Bay Area",
          "Accumulated nearly $1M in debt in 2015",
          "Documented her debt-payoff journey and became debt-free by 2017",
          "Profiled in CNBC Make It's Millennial Money series"
        ],
        "takeaways": [
          "Diversified income streams can materially increase financial resilience—consider multiple revenue sources for operational stability.",
          "Documenting and sharing processes can build a recognizable brand and open new revenue channels.",
          "Aggressive financial discipline and focused payoff strategies free up resources for investment or growth.",
          "Side projects can be scaled into full-fledged businesses that complement primary operations."
        ],
        "tags": [
          "personal finance",
          "debt payoff",
          "side hustle",
          "nursing",
          "Bay Area",
          "Financially Intentional",
          "CNBC Make It",
          "Millennial Money",
          "Brentwood",
          "entrepreneurship"
        ]
      }
    },
    {
      "id": "t6y2cVNjCAw",
      "title": "GeForce Garage - Summer of RTX Community Build",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-29T14:01:25.000Z",
      "url": "https://www.youtube.com/watch?v=t6y2cVNjCAw",
      "thumbnail": "https://i.ytimg.com/vi/t6y2cVNjCAw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… NVIDIA GeForce highlights the winner of the Summer of RTX r/buildapc Community Build Contest: u/JeffersonPutnam, who built a small-form-factor GeForce RTX 5090 system. The video lists the full parts (Fractal Design Era 2 chassis, RTX 5090 Founders Edition, MSI MPG B850I Edge, Ryzen 7 9800X3D, 32GB DDR5-6000, Corsair SF1000, Corsair Nautilus 240 RS) and links to the PCPartPicker build and GeForce social channels.",
        "bullets": [
          "Winner: u/JeffersonPutnam — SFF GeForce RTX 5090 build",
          "Host: GeForce host Dwight (Twitter: @_MightyPotato)",
          "Full parts list available on PCPartPicker (link provided)",
          "Highlighted components: Fractal Era 2 chassis, RTX 5090 Founders Edition, Ryzen 7 9800X3D, 32GB DDR5-6000",
          "Power and cooling: Corsair SF1000 SFX PSU and Corsair Nautilus 240 RS AIO"
        ],
        "takeaways": [
          "A GeForce RTX 5090 Founders Edition can be integrated into a small-form-factor chassis (Fractal Era 2).",
          "This SFF build uses a high-capacity SFX power supply (Corsair SF1000), underscoring power-delivery needs when deploying high-end GPUs in compact systems.",
          "The build pairs a 240mm AIO (Corsair Nautilus 240 RS) with high-performance parts, highlighting cooling considerations for dense or compact deployments.",
          "Modern desktop components (Ryzen 7 9800X3D, DDR5-6000) increase power and thermal requirements that should be accounted for in system planning."
        ],
        "tags": [
          "GeForceGarage",
          "RTX5090",
          "SFF",
          "SmallFormFactor",
          "Ryzen9800X3D",
          "CorsairSF1000",
          "FractalEra2",
          "PCBuild",
          "GeForceRTX50",
          "RTXOn"
        ]
      }
    },
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy GenAI solutions on Google Cloud, streamlining operations and boosting developer productivity. The collaboration compressed TTEC’s digital transformation timeline and unlocked entirely new revenue streams while expanding the company’s ambitions for AI-enabled capabilities.",
        "bullets": [
          "TTEC worked with Google Cloud Consulting to rapidly prototype and deploy AI/GenAI solutions.",
          "They leveraged Google Cloud’s robust infrastructure to streamline operations and increase developer productivity.",
          "The engagement compressed TTEC’s digital transformation timeline.",
          "The project unlocked entirely new revenue streams for TTEC.",
          "Google Cloud Consulting helped expand what TTEC considered possible for the business."
        ],
        "takeaways": [
          "Robust cloud infrastructure (as used by TTEC) enabled faster GenAI prototyping and deployment—evaluate platforms that support GenAI workloads.",
          "Compressed transformation timelines can accelerate time-to-revenue for AI initiatives.",
          "Boosts in developer productivity and streamlined operations support scaling AI across the business.",
          "Engaging cloud consulting partners can shorten implementation timelines and broaden strategic possibilities."
        ],
        "tags": [
          "googlecloud",
          "ttec",
          "genai",
          "aideployment",
          "operationalefficiency",
          "customerexperience",
          "googlecloudplatform",
          "generativeai",
          "cloudconsulting"
        ]
      }
    }
  ]
}