{
  "title": "PTD Today — Media",
  "disclaimer": "Informational only — AI-generated summaries; may contain errors. Verify with the original video.",
  "updated_at": "2026-01-29T18:02:32.395Z",
  "channels_tracked": [
    "https://www.youtube.com/@HitachiEnergy",
    "https://www.youtube.com/@SiemensEnergy",
    "https://www.youtube.com/@SchneiderElectric",
    "https://www.youtube.com/@ABB",
    "https://www.youtube.com/@GEVernova",
    "https://www.youtube.com/@eaton",
    "https://www.youtube.com/@microsoftdatacenters",
    "https://www.youtube.com/@GoogleCloudTech",
    "https://www.youtube.com/@IEA",
    "https://www.youtube.com/@NREL",
    "https://www.youtube.com/@USDepartmentofEnergy",
    "https://www.youtube.com/@ENERGYSTAR",
    "https://www.youtube.com/@PJMInterconnection",
    "https://www.youtube.com/@ERCOTISO",
    "https://www.youtube.com/@NationalGridUK",
    "https://www.youtube.com/@DukeEnergy",
    "https://www.youtube.com/@EPRI",
    "https://www.youtube.com/@IEEEorg",
    "https://www.youtube.com/@CIGRE",
    "https://www.youtube.com/@ElectricPowerResearch",
    "https://www.youtube.com/@BloombergTV",
    "https://www.youtube.com/@CNBC",
    "https://www.youtube.com/@FoxBusiness",
    "https://www.youtube.com/@Reuters",
    "https://www.youtube.com/@WSJ",
    "https://www.youtube.com/@FinancialTimes",
    "https://www.youtube.com/@TheEconomist",
    "https://www.youtube.com/@MarketWatch",
    "https://www.youtube.com/@TheVerge",
    "https://www.youtube.com/@TechCrunch",
    "https://www.youtube.com/@MITTechnologyReview",
    "https://www.youtube.com/@McKinsey",
    "https://www.youtube.com/@DeloitteUS",
    "https://www.youtube.com/@PwC",
    "https://www.youtube.com/@KPMG",
    "https://www.youtube.com/@NVIDIA",
    "https://www.youtube.com/@Intel",
    "https://www.youtube.com/@Google",
    "https://www.youtube.com/@Microsoft",
    "https://www.youtube.com/@AmazonWebServices"
  ],
  "filter": {
    "mode": "hybrid",
    "min_match_score": 1,
    "lookback_hours": 168,
    "expand_hours_if_low": 720,
    "max_filter_ai": 40
  },
  "items": [
    {
      "id": "BYtYm-xyKR8",
      "title": "Bringing In $251K A Year With 3 Jobs In The Bay Area",
      "channel": "CNBC Make It",
      "published_at": "2026-01-29T17:47:46.000Z",
      "url": "https://www.youtube.com/watch?v=BYtYm-xyKR8",
      "thumbnail": "https://i.ytimg.com/vi/BYtYm-xyKR8/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Naseema McElroy, a 44-year-old labor and delivery nurse in Brentwood, California, built a personal finance brand after accumulating nearly $1 million in debt in 2015 and documenting her payoff journey. She started Financially Intentional, was debt-free by 2017, and the CNBC Make It episode (part of its Millennial Money series) notes she brings in $251K a year across three jobs in the Bay Area.",
        "bullets": [
          "Naseema McElroy, 44, is a labor and delivery nurse with a personal finance brand in Brentwood, CA.",
          "In 2015 she had nearly $1 million in debt and began learning better money management.",
          "She launched Financially Intentional to document her debt payoff journey.",
          "By 2017 she was debt-free.",
          "Video is part of CNBC Make It's Millennial Money series and highlights she earns $251K/year across three Bay Area jobs."
        ],
        "takeaways": [
          "Employees may pursue multiple income streams (e.g., $251K across three jobs); consider flexible staffing options to retain talent in competitive markets.",
          "Severe personal debt is a real risk for workers; offering financial-wellness resources can help reduce employee stress and turnover.",
          "Encouraging employee storytelling and personal branding can support recruitment and showcase company culture in tight labor markets.",
          "Highlighting success stories around financial recovery can be a low-cost way to boost morale and demonstrate the impact of financial-education initiatives."
        ],
        "tags": [
          "Naseema McElroy",
          "Financially Intentional",
          "debt payoff",
          "labor and delivery nurse",
          "Bay Area",
          "Millennial Money",
          "CNBC Make It",
          "$251K income",
          "personal finance"
        ]
      }
    },
    {
      "id": "t6y2cVNjCAw",
      "title": "GeForce Garage - Summer of RTX Community Build",
      "channel": "NVIDIA GeForce",
      "published_at": "2026-01-29T14:01:25.000Z",
      "url": "https://www.youtube.com/watch?v=t6y2cVNjCAw",
      "thumbnail": "https://i.ytimg.com/vi/t6y2cVNjCAw/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description… GeForce Garage highlights the winner of the Summer of RTX r/buildapc Community Build contest, u/JeffersonPutnam, featuring a small-form-factor GeForce RTX 5090 rig. The video description lists full system specs, a PCPartPicker parts list, the host (Dwight/_MightyPotato), and links to GeForce social channels.",
        "bullets": [
          "Winner: u/JeffersonPutnam’s SFF build featuring a GeForce RTX 5090 Founders Edition.",
          "Chassis: Fractal Design Era 2; GPU: RTX 5090 FE; CPU: Ryzen 7 9800X3D.",
          "Other key components: MSI MPG B850I Edge motherboard, 32GB Teamgroup T-Create Expert DDR5-6000, Corsair SF1000 PSU, Corsair Nautilus 240 RS AIO.",
          "PCPartPicker parts list provided: https://pcpartpicker.com/list/hxnCRV.",
          "Host credited: GeForce host Dwight (https://twitter.com/_MightyPotato); multiple GeForce social links included."
        ],
        "takeaways": [
          "NVIDIA is promoting the GeForce RTX 5090 in consumer/community channels via GeForce Garage and community contests.",
          "The featured build pairs the RTX 5090 Founders Edition with high-end desktop components (Ryzen 7 9800X3D, DDR5-6000) — useful reference for performance-focused desktop configurations.",
          "The build uses a small-form-factor chassis (Fractal Design Era 2) with a high-capacity SFX PSU (Corsair SF1000) and a 240mm AIO, indicating component choices required to support a high-power desktop GPU in compact builds.",
          "A complete parts list is published (PCPartPicker), enabling replication or testing of the exact configuration."
        ],
        "tags": [
          "GeForceGarage",
          "RTX5090",
          "SFF",
          "FractalEra2",
          "Ryzen7",
          "9800X3D",
          "CorsairSF1000",
          "CommunityBuild",
          "PCPartPicker"
        ]
      }
    },
    {
      "id": "yUpQ9pWA9WE",
      "title": "Watch: Fed Chair Jerome Powell's Full News Conference | WSJ",
      "channel": "WSJ News",
      "published_at": "2026-01-29T08:28:54.000Z",
      "url": "https://www.youtube.com/watch?v=yUpQ9pWA9WE",
      "thumbnail": "https://i.ytimg.com/vi/yUpQ9pWA9WE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, Federal Reserve Chair Jerome Powell speaks to reporters following the Federal Reserve's two-day policy-setting meeting. WSJ News posted the full news conference video, but no transcript is available.",
        "bullets": [
          "Full news conference with Fed Chair Jerome Powell.",
          "Occurred immediately after the Fed's two-day policy-setting meeting.",
          "Video posted by WSJ News on 2026-01-29.",
          "No transcript was provided with the video.",
          "Hashtags on the description: #JeromePowell #Fed #WSJ."
        ],
        "takeaways": [
          "Monitor the conference for any policy signals or guidance that could affect financing and capital-planning decisions for grid and data center projects.",
          "Prepare for potential short-term market reactions; review risk and liquidity positions accordingly.",
          "Use the WSJ video as the primary source for direct quotes and timing since no transcript is available.",
          "Coordinate with finance and operations teams to assess how any Fed guidance might influence procurement, financing costs, and project timelines."
        ],
        "tags": [
          "JeromePowell",
          "FederalReserve",
          "Fed",
          "monetarypolicy",
          "newsconference",
          "WSJ",
          "finance",
          "markets",
          "centralbank",
          "economics"
        ]
      }
    },
    {
      "id": "WTWA1Gh7R2A",
      "title": "TTEC accelerates AI deployment and revenue streams with Google Cloud Consulting",
      "channel": "Google Cloud",
      "published_at": "2026-01-28T16:08:10.000Z",
      "url": "https://www.youtube.com/watch?v=WTWA1Gh7R2A",
      "thumbnail": "https://i.ytimg.com/vi/WTWA1Gh7R2A/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, TTEC partnered with Google Cloud Consulting to rapidly prototype and deploy Generative AI solutions on Google Cloud, streamlining operations and boosting developer productivity. The collaboration compressed TTEC’s digital transformation timeline and helped unlock entirely new revenue streams.",
        "bullets": [
          "TTEC engaged Google Cloud Consulting to accelerate AI prototyping and deployment.",
          "Generative AI (GenAI) and Google Cloud infrastructure were key enablers.",
          "Efforts focused on operational streamlining and increased developer productivity.",
          "The partnership compressed the company’s digital transformation timeline.",
          "New revenue streams were unlocked through deployed AI solutions."
        ],
        "takeaways": [
          "Cloud infrastructure and consulting support can shorten AI deployment timelines—plan for rapid prototyping capabilities.",
          "GenAI initiatives can materially improve developer productivity—prioritize tooling and platform access.",
          "AI-driven operational efficiencies can enable new monetization opportunities—align operations with business models.",
          "Partnering with experienced cloud consultants can expand what’s achievable within compressed timeframes."
        ],
        "tags": [
          "google cloud",
          "ttec",
          "genai",
          "ai deployment",
          "operational efficiency",
          "customer experience",
          "cloud consulting",
          "developer productivity",
          "digital transformation"
        ]
      }
    },
    {
      "id": "gv6zK265OUE",
      "title": "Build your first GraphRAG Powered Agent! (No Graph Expert Required) | Databases for AI",
      "channel": "AWS Events",
      "published_at": "2026-01-27T20:55:49.000Z",
      "url": "https://www.youtube.com/watch?v=gv6zK265OUE",
      "thumbnail": "https://i.ytimg.com/vi/gv6zK265OUE/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, this AWS Events video shows how to build a GraphRAG-powered knowledge graph and agent in an afternoon using the AI tools teams already use. The session includes a live demo with real documents (docs, PDFs, wikis) and a sample notebook so you can follow along without a long project timeline.",
        "bullets": [
          "Knowledge in docs, PDFs, and wikis is often inaccessible to models without structured graphs.",
          "Knowledge graphs can unlock that trapped information for reasoning.",
          "Most teams avoid building graphs because they think it's a large undertaking.",
          "The session demonstrates a fast, practical build using familiar AI tools in a live demo.",
          "A sample Jupyter notebook is provided for hands‑on followalong."
        ],
        "takeaways": [
          "Accessing institutional documents via a knowledge graph can surface hidden operational knowledge faster.",
          "A rapid, afternoon build reduces time-to-value and lowers implementation cost compared with long projects.",
          "Provided sample code and a live demo lower the barrier to run a pilot and validate benefits quickly.",
          "Practical approach enables teams to experiment with graph-augmented agents using their existing toolset."
        ],
        "tags": [
          "GraphRAG",
          "knowledge-graph",
          "retrieval-augmented-generation",
          "AI",
          "AWS-Neptune",
          "live-demo",
          "sample-code",
          "documents",
          "PDFs"
        ]
      }
    },
    {
      "id": "azzmtqcIeCU",
      "title": "Cloud Cost Efficiency I The Keys to AWS Optimization | S16 E2",
      "channel": "AWS Events",
      "published_at": "2026-01-27T10:14:44.000Z",
      "url": "https://www.youtube.com/watch?v=azzmtqcIeCU",
      "thumbnail": "https://i.ytimg.com/vi/azzmtqcIeCU/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description…This livestream explores key KPIs for AWS cost efficiency—including cost per transaction, resource utilization rates, and ROI—and explains how to measure, track, and optimize cloud spending. It also covers benchmarking approaches, identifying optimization opportunities, and building dashboards to communicate value to stakeholders.",
        "bullets": [
          "Focus on KPIs: cost per transaction, resource utilization, and ROI.",
          "Practical methods to measure and track AWS spending.",
          "Approaches to benchmark cloud efficiency against targets.",
          "Techniques to identify cost optimization opportunities.",
          "Guidance on building dashboards that show business value."
        ],
        "takeaways": [
          "Quantify cost per transaction to compare workloads and prioritize optimization.",
          "Monitor resource utilization to right-size infrastructure and cut waste.",
          "Use ROI and benchmarking to justify and sequence cost-reduction projects.",
          "Present metrics via dashboards to align technical teams and stakeholders.",
          "Adopt metric-driven processes to sustain continuous FinOps improvements."
        ],
        "tags": [
          "AWS",
          "FinOps",
          "cloud-costs",
          "cost-optimization",
          "cloud-metrics",
          "ROI",
          "benchmarking",
          "resource-utilization",
          "dashboards"
        ]
      }
    },
    {
      "id": "kff9FEElrI0",
      "title": "Zip Up, Clip In, Copilot On",
      "channel": "Microsoft Copilot",
      "published_at": "2026-01-23T22:36:46.000Z",
      "url": "https://www.youtube.com/watch?v=kff9FEElrI0",
      "thumbnail": "https://i.ytimg.com/vi/kff9FEElrI0/hqdefault.jpg",
      "ai": {
        "summary": "Based on the available description, the video highlights route planning made easy as Jo discovers the power of Copilot Groups. It presents Microsoft Copilot’s Groups feature as an AI-focused tool for simplifying route organization.",
        "bullets": [
          "No transcript available; description emphasizes route planning with Copilot Groups.",
          "Features Jo discovering the power of Copilot Groups.",
          "Positions Copilot as an AI-driven solution for organizing routes.",
          "Tagged with copilot, microsoftcopilot, and ai."
        ],
        "takeaways": [
          "Route-planning capabilities could be relevant to field operations and technician dispatch for grid and data center teams.",
          "Decision-makers should consider evaluating Copilot Groups for potential improvements in logistics coordination and route organization.",
          "Assess integration possibilities with existing dispatch, maintenance scheduling, and inventory delivery workflows before deployment.",
          "Pilot testing on specific routing scenarios (e.g., maintenance rounds, outage response) would clarify tangible operational benefits."
        ],
        "tags": [
          "copilot",
          "microsoftcopilot",
          "ai",
          "route-planning",
          "copilot-groups",
          "Jo",
          "logistics",
          "demo"
        ]
      }
    }
  ]
}