{
  "updated_at": "2026-01-04T20:09:30.705714Z",
  "label": "Weekly (last 7 days)",
  "fingerprint": "a5a717f336fcb1f01de515bcb25938335d2be88bcfe1b7527f0a5432f29e7ecf",
  "summary_md": "# PTD Today Weekly Intelligence Brief  \n**Period:** Last 7 days (ending 2026-01-04)\n\n---\n\n## 1) Top Themes  \n- Offshore wind development milestones and investment shifts  \n- Solar market growth projections and regulatory updates  \n- Advancements in AI and digital twin applications for energy  \n- Security concerns impacting subsea data center infrastructure  \n- Manufacturing and domestic content rules in renewables supply chains  \n\n---\n\n## 2) Top Stories  \n- China leads in offshore wind turbine single-unit capacity in 2025, with Vestas installing a 15 MW turbine at wind farms (Source: offshorewind.biz).  \n- Apollo acquires co-ownership of Hornsea 3 Offshore Wind Farm, signaling significant investment activity in offshore wind (Source: offshorewind.biz).  \n- UK solar sector is set for record Contract for Difference (CfD) deployment in 2026, indicating strong policy support and market growth (Source: pv-magazine.com).  \n- The US solar market is on track to reach 737.8 GW capacity by 2035, underlining robust long-term expansion (Source: pv-magazine.com).  \n- China wafer manufacturers raise price quotes ahead of 2026, with module prices potentially hitting CNY 1/W, hinting at supply-chain pricing pressures (Source: pv-magazine.com).  \n- India mandates minimum 20% domestic content for battery storage projects, emphasizing local manufacturing in energy storage (Source: pv-magazine.com).  \n- Finnish police seize a ship suspected of deliberately cutting a subsea cable, highlighting emerging security risks for data center connectivity (Source: datacenterdynamics.com).  \n- New digital twin technology employing artificial intelligence has been developed for floating photovoltaic systems, advancing renewable tech integration (Source: pv-magazine.com).  \n\n---\n\n## 3) Sector Takeaways  \n**Grid / Transmission**  \n- Flexible grid connections are being mandated for community solar projects in a US state, promoting better integration of distributed renewables (Source: pv-magazine.com).  \n- Security incident involving subsea cable cutting by a ship in Finnish waters raises concerns about risks to data center and internet backbone resilience (Source: datacenterdynamics.com).  \n\n**Renewables**  \n- Offshore wind grows with record turbine capacities and investor interest, exemplified by China’s leadership and Apollo’s Hornsea 3 stake.  \n- Solar markets in UK, US, India, China, and Bangladesh show strong policy and project pipeline momentum, including domestic content mandates for storage and pricing trends.  \n- AI and digital twin technology are emerging tools for enhancing floating PV project performance.  \n\n**Oil & Gas**  \n- Not enough information in the headline.  \n\n**Data Centers & AI**  \n- AI advances impact renewable energy management, with new digital twin tech applied to floating PV projects.  \n- Subsea cable security challenges underline critical infrastructure vulnerability affecting data centers.  \n\n**Critical Minerals / Rare Earths**  \n- Not enough information in the headline.  \n\n---\n\n## 4) Notable Companies / Regions  \n- Companies: Vestas, Apollo, Waaree Energies, Tata Power Renewable, Eging  \n- Regions: China, UK, US, India, Bangladesh, Finland  \n\n---"
}