{
  "updated_at": "2026-01-02T04:27:20.575257Z",
  "label": "Weekly (last 7 days)",
  "fingerprint": "33642e605c44c12fc25af64ee8395cb754351ead4b61f3dd981bae5545c12d20",
  "summary_md": "# PTD Today Weekly Intelligence Brief  \n**Date Range:** Last 7 days (up to 2026-01-01)  \n\n---\n\n## 1) Top Themes  \n- Offshore wind turbine capacity growth and ownership changes  \n- Solar market expansion globally including UK, US, India, Bangladesh, Nepal  \n- Integration of AI and digital twin technology in renewable energy applications  \n- Battery storage regulations emphasizing domestic content in India  \n- Grid modernization efforts for community solar and efficiency  \n- Private equity involvement in renewables ownership  \n\n---\n\n## 2) Top Stories  \n- China leads in offshore wind single-unit turbine capacity with Vestas installing a 15 MW turbine at offshore wind farms (Source: offshorewind.biz)  \n- UK is on track for record Contract for Difference (CfD) deployment in solar projects in 2026 (Source: pv-magazine.com)  \n- Chinese solar manufacturer Eging may exit a flagship photovoltaic project, highlighting challenges in China’s solar manufacturing sector (Source: pv-magazine.com)  \n- US solar capacity expected to reach 737.8 GW by 2035, signaling robust long-term market growth (Source: pv-magazine.com)  \n- Nepal issues tender for rural solar home system monitoring, pushing off-grid solar deployment (Source: pv-magazine.com)  \n- A new digital twin using AI has been developed for floating photovoltaic applications, enhancing renewable energy project monitoring (Source: pv-magazine.com)  \n- Bangladesh is seeking contractors for a 220 MW solar project, expanding regional solar infrastructure (Source: pv-magazine.com)  \n- Apollo becomes co-owner of Hornsea 3 offshore wind farm, indicating increased private investment in offshore wind (Source: offshorewind.biz)  \n- India’s Waaree Energies surpasses 20 GW as the country’s largest ALMM-approved solar manufacturer (Source: pv-magazine.com)  \n- India mandates a minimum of 20% domestic content in battery storage projects, supporting local manufacturing and supply chain development (Source: pv-magazine.com)  \n\n---\n\n## 3) Sector Takeaways  \n\n**Grid / Substations / HVDC**  \n- US state orders utility to enable flexible grid connections for community solar, advancing distributed energy integration (Source: pv-magazine.com)  \n- Utilities risk penalizing efficiency by shifting to fixed charges, an issue requiring regulatory attention to maintain grid efficiency incentives (Source: pv-magazine.com)  \n\n**Renewables**  \n- Offshore wind offshore capacity led by China with new high-capacity turbines deployed; new ownership structures with Apollo co-owning major projects.  \n- Solar markets show global momentum: UK records, US long-term capacity growth targets, and development tenders in Nepal and Bangladesh.  \n- Innovation via digital twins using AI enhances floating PV system operation and monitoring.  \n- Indian renewable manufacturing scales up with Waaree Energies and domestic content rules for battery storage reinforcing local supply chains.  \n\n**Oil & Gas**  \n- Not enough information in the headline.  \n\n**Data Centers & AI**  \n- AI “inference economics” is a major trend to watch in 2026, with AI trading outlooks suggesting continued market relevance (Source: CNBC Television).  \n\n**Chips & Supply Chain**  \n- Indian battery storage mandating domestic content hints at upcoming shifts in supply strategy for storage-related semiconductor and component demand (Source: pv-magazine.com).  \n\n**Critical Minerals / Rare Earths**  \n- Not enough information in the headline.  \n\n---\n\n## 4) Notable Companies / Regions Mentioned  \n- **China:** Offshore wind capacity lead; challenges for solar manufacturer Eging  \n- **UK:** Solar CfD market growth  \n- **US:** Large solar market expansion; grid flexibility orders  \n- **India:** Waaree Energies (largest ALMM-approved solar maker), domestic content mandate for batteries, Tata Power Renewable 1GW PV project  \n- **Bangladesh & Nepal:** Solar project tenders and implementations  \n- **Apollo:** Co-ownership of Hornsea 3 offshore wind farm  \n- **Vestas:** 15 MW offshore wind turbine deployment  \n\n---"
}