{
  "updated_at": "2026-01-02T11:19:25.912019Z",
  "label": "Weekly (last 7 days)",
  "fingerprint": "5bdf567a52fff7ce932f73d9b1749adf4b1c6f706fb5568354b4777f83ef92e0",
  "summary_md": "# PTD Today Weekly Intelligence Brief  \n**Period:** Last 7 days (up to 2026-01-02)\n\n---\n\n## 1) Top Themes  \n- Advances and leadership in offshore wind turbine capacity, especially by China and Vestas.  \n- Record and large-scale solar deployments in the US, UK, India, Bangladesh, and Nepal.  \n- Increasing integration of AI and digital tools in renewables and data center monitoring.  \n- Rising semiconductor wafer prices and key developments in chip manufacturing facilities.  \n- Geopolitical/security risks impact critical data infrastructure, including subsea cables.\n\n---\n\n## 2) Top Stories  \n- China leads offshore wind turbine single-unit capacity, with Vestas installing 15 MW turbines at offshore farms (Source: offshorewind.biz).  \n- UK solar sector is poised for record Contract for Difference (CfD) deployments in 2026 (Source: pv-magazine.com).  \n- US solar market forecast to reach 737.8 GW installed capacity by 2035 (Source: pv-magazine.com).  \n- Finnish police seize a ship suspected of cutting subsea cables, detain Russian crew (Source: datacenterdynamics.com).  \n- Tata Power Renewable completes a 1 GW domestic content requirement-compliant PV project for SJVN in India (Source: pv-magazine.com).  \n- India mandates 20% domestic content in battery storage projects to boost local manufacturing (Source: pv-magazine.com).  \n- New AI-enabled digital twin technology developed for floating solar PV applications (Source: pv-magazine.com).  \n- China wafer producers raise quotes, with module prices expected to hit CNY 1/W in 2026 (Source: pv-magazine.com).\n\n---\n\n## 3) Sector Takeaways\n\n### Grid / Transmission  \n- Flexible grid connections mandated in a US state to support community solar growth (Source: pv-magazine.com).  \n- Security risks to subsea data cables highlighted by Finnish police action on cable cutting (Source: datacenterdynamics.com).\n\n### Renewables  \n- Offshore wind: China maintains leadership in turbine unit capacity; Apollo acquires co-ownership in UK's Hornsea 3 project (Sources: offshorewind.biz).  \n- Solar: Continued rapid growth in major markets including US, UK, India, Bangladesh, Nepal; strong focus on domestic content and policy support (Sources: pv-magazine.com).  \n- Battery storage projects in India affected by new 20% local content mandate (Source: pv-magazine.com).  \n- Emerging AI and digital twin applications improve floating solar system performance monitoring (Source: pv-magazine.com).\n\n### Oil & Gas  \n- Not enough information in the headline.\n\n### Data Centers & AI  \n- AI inference economics highlighted as critical for 2026 (Source: CNBC Television).  \n- AI-supported digital twin technology applied for renewables sector floating PV (Source: pv-magazine.com).  \n- Subsea cable sabotage incident underscores vulnerability of global data infrastructure (Source: datacenterdynamics.com).\n\n### Semiconductors  \n- Chip manufacturing under spotlight with Intel's Arizona fab and rising wafer/module prices in China (Sources: CNBC, pv-magazine.com).\n\n### Rare Earth / Critical Minerals  \n- Not enough information in the headline.\n\n---\n\n## 4) Notable Companies/Regions Mentioned  \n- **China:** Offshore wind turbine production leadership, semiconductor module price adjustments, Eging solar project concerns.  \n- **UK:** Solar CfD deployment and Hornsea 3 offshore wind farm co-ownership by Apollo.  \n- **US:** Large-scale solar growth forecasts; state-level grid policy changes.  \n- **India:** Tata Power Renewable (1 GW PV project), ALMM-approved PV manufacturer Waaree Energies, domestic content mandate for battery storage.  \n- **Bangladesh/Nepal:** New solar project tenders and rural monitoring initiatives.  \n- **Finnish Police:** Intervention on subsea cable cuts involving Russian crew.\n\n---\n\n**End of Brief**"
}