{
  "updated_at": "2026-01-03T06:46:35.293830Z",
  "label": "Weekly (last 7 days)",
  "fingerprint": "a920ddf117504928b2ccfbf4c22488f5f9c086c2ef81aa5a1672e0f36213884f",
  "summary_md": "# PTD Today Weekly Intelligence Brief  \n**Period:** Last 7 Days  \n\n---\n\n## 1) Top Themes  \n- Offshore and onshore solar and wind projects advancing worldwide, including capacity milestones and new ownership.  \n- Market dynamics and pricing changes in solar wafers and modules, especially in China.  \n- Increasing policy focus on domestic content and flexible grid connections in renewables.  \n- Use of AI and digital tools (digital twins) in renewable energy monitoring and floating PV applications.  \n- Security incidents affecting subsea data infrastructure (subsea cable cut) impacting data centers.  \n\n---\n\n## 2) Top Stories  \n- Orsted is contesting the US government’s halt of its $5 billion offshore wind project (Source: Reuters).  \n- China leads in offshore wind turbine capacity with Vestas installing 15 MW units at offshore farms (Source: offshorewind.biz).  \n- Apollo becomes co-owner of the Hornsea 3 offshore wind farm, signaling new investment in large-scale wind assets (Source: offshorewind.biz).  \n- UK solar is on track for record Contract for Difference (CfD) deployment in 2026, indicating strong market growth (Source: pv-magazine.com).  \n- China solar manufacturer Eging may exit a flagship PV project amid market and operational challenges (Source: pv-magazine.com).  \n- US expected to reach 737.8 GW of solar capacity by 2035, underscoring rapid solar expansion (Source: pv-magazine.com).  \n- Finnish police seized a ship allegedly responsible for cutting a subsea cable and detained the Russian crew, raising concerns about data center connectivity security (Source: datacenterdynamics.com).  \n- India mandates 20% domestic content in battery storage projects, pushing supply chain localization in renewables (Source: pv-magazine.com).  \n\n---\n\n## 3) Sector Takeaways  \n\n### Grid / Transmission  \n- US states order utilities to enable flexible grid connections for community solar, enhancing grid integration of distributed generation (Source: pv-magazine.com).  \n- Security risks to subsea cables highlighted by Finnish police seizing a ship for alleged cable cutting, impacting data center and communications networks (Source: datacenterdynamics.com).  \n\n### Renewables  \n- Offshore wind continues rapid growth with large-scale turbines (15 MW by Vestas) and major investments (Orsted, Apollo/Hornsea 3).  \n- Solar markets show continued expansion with record CfD deployment in the UK, substantial US capacity forecast, and emerging project tendering in Bangladesh and Nepal.  \n- China’s wafer and module prices expected around CNY 1/W in 2026, affecting global solar supply chains.  \n- India’s new domestic content rules for battery storage reinforce localization and supply chain shifts.  \n- AI-enabled digital twins for floating PV systems demonstrate integration of advanced technologies in renewables management.  \n\n### Oil & Gas  \n- Not enough information in the headline.  \n\n### Data Centers & AI  \n- AI is increasingly important in economic modeling and digital tools for energy projects, such as floating PV digital twins (Sources: CNBC Television, pv-magazine.com).  \n- Subsea cable cutting incident underscores critical vulnerabilities in data center connectivity infrastructure (Source: datacenterdynamics.com).  \n\n### Critical Minerals  \n- Not enough information in the headline.  \n\n---\n\n## 4) Notable Companies/Regions Mentioned  \n- Orsted (Denmark/US offshore wind)  \n- Vestas (wind turbine manufacturer)  \n- Apollo (investor in offshore wind)  \n- Hornsea 3 (large offshore wind farm, UK)  \n- Eging (China solar manufacturer)  \n- Tata Power Renewable (India)  \n- Waaree Energies (India)  \n- Finland (subsea cable incident)  \n- US, UK, China, India, Bangladesh, Nepal (key regional solar/wind markets)"
}