{
  "updated_at": "2026-01-02T04:37:48.602204Z",
  "label": "Weekly",
  "fingerprint": "1f7c6248b8f7af112783c86dc55e00f38bee016df617979a348d2f1b8e09c73d",
  "summary_md": "# PTD Today — Weekly Intelligence Brief\n\n## 1) Top Themes\n- Offshore wind capacity expansion and ownership changes\n- Solar PV market growth, pricing, and policy developments\n- AI integration and economic implications in energy-related sectors\n- Security concerns for subsea infrastructure\n- Domestic content mandates in battery storage projects\n\n## 2) Top Stories\n- Finnish police have seized a ship suspected of cutting a subsea cable and detained the Russian crew involved, highlighting threats to critical cable infrastructure (Source: datacenterdynamics.com).  \n- China maintains leadership in offshore wind turbine single-unit capacity in 2025, with Vestas installing a 15 MW turbine offshore (Source: offshorewind.biz).  \n- Apollo has acquired co-ownership in the Hornsea 3 offshore wind farm, indicating investor interest in large-scale offshore projects (Source: offshorewind.biz).  \n- The UK solar sector is poised for record Contract for Difference (CfD) deployment in 2026, signaling policy-driven growth (Source: pv-magazine.com).  \n- India mandates 20% domestic content for battery storage projects, aiming to boost local manufacturing (Source: pv-magazine.com).  \n- US solar market projection sets a target of 737.8 GW capacity by 2035, underscoring strong long-term growth (Source: pv-magazine.com).  \n- Chinese wafer manufacturers increase price quotes, with 2026 module prices expected to reach CNY 1/W, affecting global PV supply chains (Source: pv-magazine.com).  \n- New digital twin technology utilizing AI is developed for floating PV applications, merging renewable tech with AI innovation (Source: pv-magazine.com).  \n\n## 3) Sector Takeaways\n\n**Grid / Transmission**  \n- Security of subsea cables is a growing concern after Finnish police intervene in suspected cable sabotage.  \n- US utilities face regulatory pressure to enable flexible grid connections to support community solar.  \n\n**Renewables & Storage**  \n- Offshore wind capacity advances with larger turbines and new ownership participation (China, UK, Apollo/Hornsea 3).  \n- Solar PV markets grow globally: UK CfD records, US market expansion, and India domestic content rules for battery storage enhance local industry development.  \n- Floating PV innovations employing AI for digital twins indicate technological advances in renewable asset management.  \n\n**Data Centers & AI**  \n- AI inference economics and trade remain focal topics as AI integrates deeper into energy and industrial applications.  \n\n**Oil & Gas**  \n- Not enough information in the headline.  \n\n**Critical Materials**  \n- India's domestic content rule for battery storage projects impacts critical materials sourcing and local manufacturing.  \n- Chinese wafer price increases may influence raw material supply dynamics.  \n\n## 4) Notable Companies / Regions  \n- China (offshore wind capacity, solar manufacturing prices)  \n- UK (solar CfD deployment)  \n- India (battery storage content mandate, PV manufacturing)  \n- Apollo (co-owner of Hornsea 3 offshore wind farm)  \n- Vestas (15 MW offshore wind turbine installed)  \n- Finland (police action on subsea cable incident)  \n- US (solar market growth, community solar grid policies)"
}