{
  "updated_at": "2026-01-02T04:16:00.208233Z",
  "label": "Year 2025 review",
  "fingerprint": "ae7f34b59d13217a38facba352ed08fc4136d72b90fde52b65b0a00f61f5f890",
  "summary_md": "# PTD Today Year 2025 Review Intelligence Brief\n\n---\n\n## 1) Top Themes\n- Solar power expansion and policy developments globally (UK, US, India, Bangladesh, Nepal, China)\n- Advancements and integration of AI in energy applications, including digital twins for PV and AI inference economics\n- Offshore wind investment and ownership changes, exemplified by Hornsea 3\n- Energy storage regulation and domestic content mandates, notably in India\n- Semiconductor manufacturing updates related to chip supply chain resilience\n- Utility grid modernization involving flexible connections for community solar projects\n\n---\n\n## 2) Top Stories\n1. UK solar is set for record Contract for Difference (CfD) deployment in 2026, indicating continued growth in renewable subsidies (Source: pv-magazine.com).  \n2. The U.S. solar market is projected to reach a cumulative 737.8 GW capacity by 2035, highlighting robust solar expansion (Source: pv-magazine.com).  \n3. India enforces a 20% domestic content requirement for battery storage projects, strengthening local supply chains (Source: pv-magazine.com).  \n4. Apollo becomes co-owner of the Hornsea 3 offshore wind farm, signifying increased private investment in offshore wind assets (Source: offshorewind.biz).  \n5. China-based solar manufacturer Eging faces possible exit from a flagship PV project, reflecting challenges within Chinese solar manufacturing (Source: pv-magazine.com).  \n6. Nepal issues a tender for monitoring rural solar home systems, emphasizing solar’s role in rural electrification (Source: pv-magazine.com).  \n7. US state regulators order utilities to enable flexible grid connections for community solar, facilitating distributed energy integration (Source: pv-magazine.com).  \n8. Tata Power Renewable completes a 1 GW DCR-compliant solar PV project for SJVN, marking a significant large-scale solar milestone in India (Source: pv-magazine.com).  \n9. A new digital twin for floating PV uses artificial intelligence to improve performance and management of solar assets on water (Source: pv-magazine.com).  \n10. Intel’s new Arizona semiconductor fabrication plant underscores ongoing importance of chip manufacturing amid global supply chain concerns (Source: CNBC).\n\n---\n\n## 3) Sector Takeaways\n\n### Grid\n- Increased regulatory focus on flexible grid connections to support community solar projects advances grid modernization.\n- Growing integration of AI-driven digital twins enhances grid asset management and PV performance.\n\n### Renewables\n- Solar power continues aggressive deployment globally, with record CfD contracts in the UK and expansive market growth forecasts in the US and Asia.\n- Offshore wind sees growing private equity involvement, as demonstrated by Apollo’s co-ownership of Hornsea 3.\n- Policy shifts such as India’s domestic content mandate for storage incentivize local industry development.\n- Rural solar projects gain traction in emerging markets like Nepal and Bangladesh.\n\n### Storage\n- India’s 20% domestic content mandate for battery storage projects signals rising policy support for domestic manufacturing and supply chain localization.\n\n### Data Centers & AI\n- AI’s role expands into energy through use cases like digital twins for floating PV, and evolving \"AI inference economics\" presents a new dimension for 2026.\n- Energy sector AI adoption continues to be monitored as a strategic trade theme.\n\n### Chips & Supply Chain\n- Intel’s Arizona fab symbolizes critical semiconductor manufacturing capacity relevant for power transmission and AI hardware supply chain stability.\n\n### Rare Earths\n- No relevant articles in this set.\n\n---\n\n## 4) Notable Companies / Regions Mentioned\n- Regions: UK, US, India, China, Nepal, Bangladesh\n- Companies: Apollo (offshore wind investor), Tata Power Renewable, Intel, Eging (Chinese solar manufacturer)\n- Projects: Hornsea 3 offshore wind farm, SJVN 1 GW solar PV project\n\n---"
}